PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#ifndef __MKL46Z4_CONSTANTS_H__
#define __MKL46Z4_CONSTANTS_H__
//**********************************************************************
//Freescale MKL46Z256xxx4 device values and configuration code
//* .equ Various, ATES for memory map
//[1] Freescale Semiconductor, <B>Kinetis L Peripheral Module Quick
//    Reference</B>, KLQRUG, Rev. 0, 9/2012.
//[2] ARM, <B>Application Note 48 Scatter Loading</B>, ARM DAI 0048A,
//    Jan. 1998
//[3] Freescale Semiconductor, <B>KL46 Sub-Family Reference Manual</B>,
//    KL46P121M48SF4RM, Rev. 3, 7/2013.
//[4] Freescale Semiconductor, MKL46Z4.h, rev. 2.2, 4/12/2013
//---------------------------------------------------------------
//Author:  R. W. Melton
//Date:  September 25, 2017
//***************************************************************
//.equ , ates
//Standard data masks
#define BYTE_MASK 0xFF
#define NIBBLE_MASK 0x0F
//Standard data sizes (in bits)
#define BYTE_BITS 8
#define NIBBLE_BITS 4
//Architecture data sizes (in bytes)
// Cortex-M0+
#define WORD_SIZE 4
// Cortex-M0+
#define HALFWORD_SIZE 2
//Architecture data masks
#define HALFWORD_MASK 0xFFFF
//Return                 
// Bit 0 of ret. addr. must be
#define RET_ADDR_T_MASK 1
//---------------------------------------------------------------
//Vectors
// KL46
#define VECTOR_TABLE_SIZE 0x000000C0
// Bytes per vector
#define VECTOR_SIZE 4
//---------------------------------------------------------------
//CPU PSR:  Program status register
//Combined APSR, EPSR, and IPSR
//----------------------------------------------------------
//APSR:  Application Program Status Register
//31  :N=negative flag
//30  :Z=zero flag
//29  :C=carry flag
//28  :V=overflow flag
//27-0:(reserved)
#define APSR_MASK 0xF0000000
#define APSR_SHIFT 28
#define APSR_N_MASK 0x80000000
#define APSR_N_SHIFT 31
#define APSR_Z_MASK 0x40000000
#define APSR_Z_SHIFT 30
#define APSR_C_MASK 0x20000000
#define APSR_C_SHIFT 29
#define APSR_V_MASK 0x10000000
#define APSR_V_SHIFT 28
//----------------------------------------------------------
//EPSR
//31-25:(reserved)
//   24:T=thumb state bit
//23- 0:(reserved)
#define EPSR_MASK 0x01000000
#define EPSR_SHIFT 24
#define EPSR_T_MASK 0x01000000
#define EPSR_T_SHIFT 24
//----------------------------------------------------------
//IPSR
//31-6:(reserved)
// 5-0:Exception number=number of current exception
//      0=thread mode
//      1:(reserved)
//      2=NMI
//      3=hard fault
//      4-10:(reserved)
//     11=SVCall
//     12-13:(reserved)
//     14=PendSV
//     15=SysTick
//     16=IRQ0
//     16-47:IRQ(Exception number - 16)
//     47=IRQ31
//     48-63:(reserved)
#define IPSR_MASK 0x0000003F
#define IPSR_SHIFT 0
#define IPSR_EXCEPTION_MASK 0x0000003F
#define IPSR_EXCEPTION_SHIFT 0
//----------------------------------------------------------
#define PSR_N_MASK APSR_N_MASK
#define PSR_N_SHIFT APSR_N_SHIFT
#define PSR_Z_MASK APSR_Z_MASK
#define PSR_Z_SHIFT APSR_Z_SHIFT
#define PSR_C_MASK APSR_C_MASK
#define PSR_C_SHIFT APSR_C_SHIFT
#define PSR_V_MASK APSR_V_MASK
#define PSR_V_SHIFT APSR_V_SHIFT
#define PSR_T_MASK EPSR_T_MASK
#define PSR_T_SHIFT EPSR_T_SHIFT
#define PSR_EXCEPTION_MASK IPSR_EXCEPTION_MASK
#define PSR_EXCEPTION_SHIFT IPSR_EXCEPTION_SHIFT
//---------------------------------------------------------------
//Cortex-M0+ Core
// Core revision r0p0
#define __CM0PLUS_REV 0x0000
// Whether MPU is present
#define __MPU_PRESENT 0
// Number of NVIC priority bits
#define __NVIC_PRIO_BITS 2
// Whether vendor-specific
#define __Vendor_SysTickConfig 0
// Whether VTOR is present
#define __VTOR_PRESENT 1
//---------------------------------------------------------------
//Interrupt numbers
//Core interrupts
// Non-maskable interrupt (NMI)
#define NonMaskableInt_IRQn -14
// Hard fault interrupt
#define HardFault_IRQn -13
// Supervisor call interrupt (SVCall)
#define SVCall_IRQn -5
// Pendable request for system service interrupt
#define PendSV_IRQn -2
// System tick timer interrupt (SysTick)
#define SysTick_IRQn -1
//--------------------------
//Device specific interrupts
// DMA channel 0 transfer complete/error interrupt
#define DMA0_IRQn 0
// DMA channel 1 transfer complete/error interrupt
#define DMA1_IRQn 1
// DMA channel 2 transfer complete/error interrupt
#define DMA2_IRQn 2
// DMA channel 3 transfer complete/error interrupt
#define DMA3_IRQn 3
// Reserved interrupt 20
#define Reserved20_IRQn 4
// FTFA command complete/read collision interrupt
#define FTFA_IRQn 5
// Low-voltage detect, low-voltage warning interrupt
#define LVD_LVW_IRQn 6
// Low leakage wakeup interrupt
#define LLW_IRQn 7
// I2C0 interrupt
#define I2C0_IRQn 8
// I2C1 interrupt
#define I2C1_IRQn 9
// SPI0 interrupt
#define SPI0_IRQn 10
// SPI1 interrupt
#define SPI1_IRQn 11
// UART0 status/error interrupt
#define UART0_IRQn 12
// UART1 status/error interrupt
#define UART1_IRQn 13
// UART2 status/error interrupt
#define UART2_IRQn 14
// ADC0 interrupt
#define ADC0_IRQn 15
// CMP0 interrupt
#define CMP0_IRQn 16
// TPM0 fault, overflow, and channels interrupt
#define TPM0_IRQn 17
// TPM1 fault, overflow, and channels interrupt
#define TPM1_IRQn 18
// TPM2 fault, overflow, and channels interrupt
#define TPM2_IRQn 19
// RTC alarm interrupt
#define RTC_IRQn 20
// RTC seconds interrupt
#define RTC_Seconds_IRQn 21
// PIT interrupt
#define PIT_IRQn 22
// I2S0 interrupt
#define I2S0_IRQn 23
// USB OTG interrupt
#define USB0_IRQn 24
// DAC0 interrupt
#define DAC0_IRQn 25
// TSI0 interrupt
#define TSI0_IRQn 26
// MCG interrupt
#define MCG_IRQn 27
// LPTMR0 interrupt
#define LPTimer_IRQn 28
// SLCD interrupt
#define LCD_IRQn 29
// Port A pin detect interrupt
#define PORTA_IRQn 30
// Port C and Port D pin detectinterrupt
#define PORTC_PORTD_IRQn 31
//---------------------------------------------------------------
//Memory map major version
//(Memory maps with equal major version number are compatible)
#define MCU_MEM_MAP_VERSION 0x0200
//Memory map minor version
#define MCU_MEM_MAP_VERSION_MINOR 0x0002
//---------------------------------------------------------------
//ADC
#define ADC0_BASE 0x4003B000
#define ADC_SC1A_OFFSET 0x00
#define ADC_SC1B_OFFSET 0x04
#define ADC_CFG1_OFFSET 0x08
#define ADC_CFG2_OFFSET 0x0C
#define ADC_RA_OFFSET 0x10
#define ADC_RB_OFFSET 0x14
#define ADC_CV1_OFFSET 0x18
#define ADC_CV2_OFFSET 0x1C
#define ADC_SC2_OFFSET 0x20
#define ADC_SC3_OFFSET 0x24
#define ADC_OFS_OFFSET 0x28
#define ADC_PG_OFFSET 0x2C
#define ADC_MG_OFFSET 0x30
#define ADC_CLPD_OFFSET 0x34
#define ADC_CLPS_OFFSET 0x38
#define ADC_CLP4_OFFSET 0x3C
#define ADC_CLP3_OFFSET 0x40
#define ADC_CLP2_OFFSET 0x44
#define ADC_CLP1_OFFSET 0x48
#define ADC_CLP0_OFFSET 0x4C
#define ADC_CLMD_OFFSET 0x54
#define ADC_CLMS_OFFSET 0x58
#define ADC_CLM4_OFFSET 0x5C
#define ADC_CLM3_OFFSET 0x60
#define ADC_CLM2_OFFSET 0x64
#define ADC_CLM1_OFFSET 0x68
#define ADC_CLM0_OFFSET 0x6C
#define ADC0_CFG1 ( ADC0_BASE + ADC_CFG1_OFFSET)
#define ADC0_CFG2 ( ADC0_BASE + ADC_CFG2_OFFSET)
#define ADC0_CLMD ( ADC0_BASE + ADC_CLMD_OFFSET)
#define ADC0_CLMS ( ADC0_BASE + ADC_CLMS_OFFSET)
#define ADC0_CLM0 ( ADC0_BASE + ADC_CLM0_OFFSET)
#define ADC0_CLM1 ( ADC0_BASE + ADC_CLM1_OFFSET)
#define ADC0_CLM2 ( ADC0_BASE + ADC_CLM2_OFFSET)
#define ADC0_CLM3 ( ADC0_BASE + ADC_CLM3_OFFSET)
#define ADC0_CLM4 ( ADC0_BASE + ADC_CLM4_OFFSET)
#define ADC0_CLPD ( ADC0_BASE + ADC_CLPD_OFFSET)
#define ADC0_CLPS ( ADC0_BASE + ADC_CLPS_OFFSET)
#define ADC0_CLP0 ( ADC0_BASE + ADC_CLP0_OFFSET)
#define ADC0_CLP1 ( ADC0_BASE + ADC_CLP1_OFFSET)
#define ADC0_CLP2 ( ADC0_BASE + ADC_CLP2_OFFSET)
#define ADC0_CLP3 ( ADC0_BASE + ADC_CLP3_OFFSET)
#define ADC0_CLP4 ( ADC0_BASE + ADC_CLP4_OFFSET)
#define ADC0_CV1 ( ADC0_BASE + ADC_CV1_OFFSET)
#define ADC0_CV2 ( ADC0_BASE + ADC_CV2_OFFSET)
#define ADC0_MG ( ADC0_BASE + ADC_MG_OFFSET)
#define ADC0_OFS ( ADC0_BASE + ADC_OFS_OFFSET)
#define ADC0_PG ( ADC0_BASE + ADC_PG_OFFSET)
#define ADC0_RA ( ADC0_BASE + ADC_RA_OFFSET)
#define ADC0_RB ( ADC0_BASE + ADC_RB_OFFSET)
#define ADC0_SC1A ( ADC0_BASE + ADC_SC1A_OFFSET)
#define ADC0_SC1B ( ADC0_BASE + ADC_SC1B_OFFSET)
#define ADC0_SC2 ( ADC0_BASE + ADC_SC2_OFFSET)
#define ADC0_SC3 ( ADC0_BASE + ADC_SC3_OFFSET)
//---------------------------------------------------------------
//ADC_CFG1:  ADC configuration register 1
//31-8:(reserved):read-only:0
//   7:ADLPC=ADC low-power configuration
// 6-5:ADIV=ADC clock divide select
//     Internal ADC clock = input clock / 2^ADIV
//   4:ADLSMP=ADC long sample time configuration
//            0=short
//            1=long
// 3-2:MODE=conversion mode selection
//          00=(DIFF'):single-ended 8-bit conversion
//             (DIFF):differential 9-bit 2's complement conversion
//          01=(DIFF'):single-ended 12-bit conversion
//             (DIFF):differential 13-bit 2's complement conversion
//          10=(DIFF'):single-ended 10-bit conversion
//             (DIFF):differential 11-bit 2's complement conversion
//          11=(DIFF'):single-ended 16-bit conversion
//             (DIFF):differential 16-bit 2's complement conversion
// 1-0:ADICLK=ADC input clock select
//          00=bus clock
//          01=bus clock / 2
//          10=alternate clock (ALTCLK)
//          11=asynchronous clock (ADACK)
#define ADC_CFG1_ADLPC_MASK 0x80
#define ADC_CFG1_ADLPC_SHIFT 7
#define ADC_CFG1_ADIV_MASK 0x60
#define ADC_CFG1_ADIV_SHIFT 5
#define ADC_CFG1_ADLSMP_MASK 0x10
#define ADC_CFG1_ADLSMP_SHIFT 4
#define ADC_CFG1_MODE_MASK 0x0C
#define ADC_CFG1_MODE_SHIFT 2
#define ADC_CFG1_ADICLK_MASK 0x03
#define ADC_CFG1_ADICLK_SHIFT 0
//---------------------------------------------------------------
//ADC_CFG2:  ADC configuration register 2
//31-8:(reserved):read-only:0
// 7-5:(reserved):read-only:0
//   4:MUXSEL=ADC mux select
//            0=ADxxA channels are selected
//            1=ADxxB channels are selected
//   3:ADACKEN=ADC asynchronous clock output enable
//             0=asynchronous clock determined by ACD0_CFG1.ADICLK 
//             1=asynchronous clock enabled
//   2:ADHSC=ADC high-speed configuration
//           0=normal conversion
//           1=high-speed conversion (only 2 additional ADK cycles)
// 1-0:ADLSTS=ADC long sample time select (ADK cycles)
//          00=default longest sample time:  
//             24 total ADK cycles (20 extra)
//          01=16 total ADK cycles (12 extra)
//          10=10 total ADK cycles (6 extra)
//          11=6 total ADK cycles (2 extra)
#define ADC_CFG2_MUXSEL_MASK 0x10
#define ADC_CFG2_MUXSEL_SHIFT 4
#define ADC_CFG2_ADACKEN_MASK 0x08
#define ADC_CFG2_ADACKEN_SHIFT 3
#define ADC_CFG2_ADHSC_MASK 0x04
#define ADC_CFG2_ADHSC_SHIFT 2
#define ADC_CFG2_ADLSTS_MASK 0x03
#define ADC_CFG2_ADLSTS_SHIFT 0
//---------------------------------------------------------------
//ADC_CLMD:  ADC minus-side general calibration value register D
//31-6:(reserved):read-only:0
// 5-0:CLMD=calibration value
#define ADC_CLMD_MASK 0x3F
#define ADC_CLMD_SHIFT 0
//---------------------------------------------------------------
//ADC_CLMS:  ADC minus-side general calibration value register S
//31-6:(reserved):read-only:0
// 5-0:CLMS=calibration value
#define ADC_CLMS_MASK 0x3F
#define ADC_CLMS_SHIFT 0
//---------------------------------------------------------------
//ADC_CLM0:  ADC minus-side general calibration value register 0
//31-6:(reserved):read-only:0
// 5-0:CLM0=calibration value
#define ADC_CLM0_MASK 0x3F
#define ADC_CLM0_SHIFT 0
//---------------------------------------------------------------
//ADC_CLM1:  ADC minus-side general calibration value register 1
//31-7:(reserved):read-only:0
// 6-0:CLM1=calibration value
#define ADC_CLM1_MASK 0x7F
#define ADC_CLM1_SHIFT 0
//---------------------------------------------------------------
//ADC_CLM2:  ADC minus-side general calibration value register 2
//31-8:(reserved):read-only:0
// 7-0:CLM2=calibration value
#define ADC_CLM2_MASK 0xFF
#define ADC_CLM2_SHIFT 0
//---------------------------------------------------------------
//ADC_CLM3:  ADC minus-side general calibration value register 3
//31-9:(reserved):read-only:0
// 8-0:CLM3=calibration value
#define ADC_CLM3_MASK 0x1FF
#define ADC_CLM3_SHIFT 0
//---------------------------------------------------------------
//ADC_CLM4:  ADC minus-side general calibration value register 4
//31-10:(reserved):read-only:0
// 9- 0:CLM4=calibration value
#define ADC_CLM4_MASK 0x3FF
#define ADC_CLM4_SHIFT 0
//---------------------------------------------------------------
//ADC_CLPD:  ADC plus-side general calibration value register D
//31-6:(reserved):read-only:0
// 5-0:CLPD=calibration value
#define ADC_CLPD_MASK 0x3F
#define ADC_CLPD_SHIFT 0
//---------------------------------------------------------------
//ADC_CLPS:  ADC plus-side general calibration value register S
//31-6:(reserved):read-only:0
// 5-0:CLPS=calibration value
#define ADC_CLPS_MASK 0x3F
#define ADC_CLPS_SHIFT 0
//---------------------------------------------------------------
//ADC_CLP0:  ADC plus-side general calibration value register 0
//31-6:(reserved):read-only:0
// 5-0:CLP0=calibration value
#define ADC_CLP0_MASK 0x3F
#define ADC_CLP0_SHIFT 0
//---------------------------------------------------------------
//ADC_CLP1:  ADC plus-side general calibration value register 1
//31-7:(reserved):read-only:0
// 6-0:CLP1=calibration value
#define ADC_CLP1_MASK 0x7F
#define ADC_CLP1_SHIFT 0
//---------------------------------------------------------------
//ADC_CLP2:  ADC plus-side general calibration value register 2
//31-8:(reserved):read-only:0
// 7-0:CLP2=calibration value
#define ADC_CLP2_MASK 0xFF
#define ADC_CLP2_SHIFT 0
//---------------------------------------------------------------
//ADC_CLP3:  ADC plus-side general calibration value register 3
//31-9:(reserved):read-only:0
// 8-0:CLP3=calibration value
#define ADC_CLP3_MASK 0x1FF
#define ADC_CLP3_SHIFT 0
//---------------------------------------------------------------
//ADC_CLP4:  ADC plus-side general calibration value register 4
//31-10:(reserved):read-only:0
// 9- 0:CLP4=calibration value
#define ADC_CLP4_MASK 0x3FF
#define ADC_CLP4_SHIFT 0
//---------------------------------------------------------------
//ADC_CVn:  ADC channel n compare value register
//CV1 used to compare result when ADC_SC2.ACFE=1
//CV2 used to compare result when ADC_SC2.ACREN=1
//31-16:(reserved):read-only:0
//15- 0:compare value (sign- or zero-extended if fewer than 16 bits)
#define ADC_CV_MASK 0xFFFF
#define ADC_CV_SHIFT 0
//---------------------------------------------------------------
//ADC_MG:  ADC minus-side gain register
//31-16:(reserved):read-only:0
//15- 0:MG=minus-side gain
#define ADC_MG_MASK 0xFFFF
#define ADC_MG_SHIFT 0
//---------------------------------------------------------------
//ADC_OFS:  ADC offset correction register
//31-16:(reserved):read-only:0
//15- 0:OFS=offset error correction value
#define ADC_OFS_MASK 0xFFFF
#define ADC_OFS_SHIFT 0
//---------------------------------------------------------------
//ADC_PG:  ADC plus-side gain register
//31-16:(reserved):read-only:0
//15- 0:PG=plus-side gain
#define ADC_PG_MASK 0xFFFF
#define ADC_PG_SHIFT 0
//---------------------------------------------------------------
//ADC_Rn:  ADC channel n data result register
//31-16:(reserved):read-only:0
//15- 0:data result (sign- or zero-extended if fewer than 16 bits)
#define ADC_D_MASK 0xFFFF
#define ADC_D_SHIFT 0
//---------------------------------------------------------------
//ADC_SC1n:  ADC channel n status and control register 1
//31-8:(reserved):read-only:0
//   7:COCO=conversion complete flag (read-only)
//   6:AIEN=ADC interrupt enabled
//   5:DIFF=differential mode enable
// 4-0:ADCH=ADC input channel select
//          00000=(DIFF'):DADP0//(DIFF):DAD0
//          00001=(DIFF'):DADP1//(DIFF):DAD1
//          00010=(DIFF'):DADP2//(DIFF):DAD2
//          00011=(DIFF'):DADP3//(DIFF):DAD3
//          00100=(DIFF'):AD4//(DIFF):(reserved)
//          00101=(DIFF'):AD5//(DIFF):(reserved)
//          00110=(DIFF'):AD6//(DIFF):(reserved)
//          00111=(DIFF'):AD7//(DIFF):(reserved)
//          01000=(DIFF'):AD8//(DIFF):(reserved)
//          01001=(DIFF'):AD9//(DIFF):(reserved)
//          01010=(DIFF'):AD10//(DIFF):(reserved)
//          01011=(DIFF'):AD11//(DIFF):(reserved)
//          01100=(DIFF'):AD12//(DIFF):(reserved)
//          01101=(DIFF'):AD13//(DIFF):(reserved)
//          01110=(DIFF'):AD14//(DIFF):(reserved)
//          01111=(DIFF'):AD15//(DIFF):(reserved)
//          10000=(DIFF'):AD16//(DIFF):(reserved)
//          10001=(DIFF'):AD17//(DIFF):(reserved)
//          10010=(DIFF'):AD18//(DIFF):(reserved)
//          10011=(DIFF'):AD19//(DIFF):(reserved)
//          10100=(DIFF'):AD20//(DIFF):(reserved)
//          10101=(DIFF'):AD21//(DIFF):(reserved)
//          10110=(DIFF'):AD22//(DIFF):(reserved)
//          10111=(DIFF'):AD23//(DIFF):(reserved)
//          11000 (reserved)
//          11001 (reserved)
//          11010=(DIFF'):temp sensor (single-ended)
//                (DIFF):temp sensor (differential)
//          11011=(DIFF'):bandgap (single-ended)
//                (DIFF):bandgap (differential)
//          11100 (reserved)
//          11101=(DIFF'):VREFSH (single-ended)
//                (DIFF):-VREFSH (differential)
//          11110=(DIFF'):VREFSL (single-ended)
//                (DIFF):(reserved)
//          11111=disabled
#define ADC_COCO_MASK 0x80
#define ADC_COCO_SHIFT 7
#define ADC_AIEN_MASK 0x40
#define ADC_AIEN_SHIFT 6
#define ADC_DIFF_MASK 0x20
#define ADC_DIFF_SHIFT 5
#define ADC_ADCH_MASK 0x1F
#define ADC_ADCH_SHIFT 0
//---------------------------------------------------------------
//ADC_SC2:  ADC status and control register 2
//31-8:(reserved):read-only:0
//   7:ADACT=ADC conversion active
//   6:ADTRG=ADC conversion trigger select
//           0=software trigger
//           1=hardware trigger
//   5:ACFE=ADC compare function enable
//   4:ACFGT=ADC compare function greater than enable
//           based on values in ADC_CV1 and ADC_CV2
//           0=configure less than threshold and non-inclusive range
//           1=configure greater than threshold and non-inclusive range
//   3:ACREN=ADC compare function range enable
//           0=disabled// only ADC_CV1 compared
//           1=enabled// both ADC_CV1 and ADC_CV2 compared
//   2:DMAEN=DMA enable
// 1-0:REFSEL=voltage reference selection
//            00=default:VREFH and VREFL
//            01=alterantive:VALTH and VALTL
//            10=(reserved)
//            11=(reserved)
#define ADC_ADACT_MASK 0x80
#define ADC_ADACT_SHIFT 7
#define ADC_ADTRG_MASK 0x40
#define ADC_ADTRG_SHIFT 6
#define ADC_ACFE_MASK 0x20
#define ADC_ACFE_SHIFT 5
#define ADC_ACFGT_MASK 0x10
#define ADC_ACFGT_SHIFT 4
#define ADC_ACREN_MASK 0x08
#define ADC_ACREN_SHIFT 3
#define ADC_DMAEN_MASK 0x04
#define ADC_DMAEN_SHIFT 2
#define ADC_REFSEL_MASK 0x03
#define ADC_REFSEL_SHIFT 0
//---------------------------------------------------------------
//ADC_SC3:  ADC status and control register 3
//31-8:(reserved):read-only:0
//   7:CAL=calibration
//         write:0=(no effect)
//               1=start calibration sequence
//         read:0=calibration sequence complete
//              1=calibration sequence in progress
//   6:CALF=calibration failed flag
// 5-4:(reserved):read-only:0
//   3:ADC=ADC continuous conversion enable (if ADC_SC3.AVGE = 1)
//   2:AVGE=hardware average enable
// 1-0:AVGS=hardware average select:  2^(2+AVGS) samples
#define ADC_CAL_MASK 0x80
#define ADC_CAL_SHIFT 7
#define ADC_CALF_MASK 0x40
#define ADC_CALF_SHIFT 6
#define ADC_ADCO_MASK 0x08
#define ADC_ADCO_SHIFT 3
#define ADC_AVGE_MASK 0x04
#define ADC_AVGE_SHIFT 2
#define ADC_AVGS_MASK 0x03
#define ADC_AVGS_SHIFT 0
//---------------------------------------------------------------
//CMP
#define CMP0_BASE 0x40073000
#define CMP0_CR0_OFFSET 0x00
#define CMP0_CR1_OFFSET 0x01
#define CMP0_FPR_OFFSET 0x02
#define CMP0_SCR_OFFSET 0x03
#define CMP0_DACCR_OFFSET 0x04
#define CMP0_MUXCR_OFFSET 0x05
#define CMP0_CR0 (CMP0_BASE + CMP0_CR0_OFFSET)
#define CMP0_CR1 (CMP0_BASE + CMP0_CR1_OFFSET)
#define CMP0_FPR (CMP0_BASE + CMP0_FPR_OFFSET)
#define CMP0_SCR (CMP0_BASE + CMP0_SCR_OFFSET)
#define CMP0_DACCR (CMP0_BASE + CMP0_DACCR_OFFSET)
#define CMP0_MUXCR (CMP0_BASE + CMP0_MUXCR_OFFSET)
//---------------------------------------------------------------
//CMP0_CR0:  CMP0 control register 0 (0x00)
//  7:(reserved):read-only:0
//6-4:FILTER_CNT=filter sample count (00)
//  3:(reserved):read-only:0
//  2:(reserved):read-only:0
//1-0:HYSTCTR=comparator hard block hysteresis control (00)
#define CMP_CR0_HYSTCTR_MASK 0x3
#define CMP_CR0_HYSTCTR_SHIFT 0
#define CMP_CR0_FILTER_CNT_MASK 0x70
#define CMP_CR0_FILTER_CNT_SHIFT 4
//---------------------------------------------------------------
//CMP0_CR0:  CMP0 control register 1 (0x00)
//7:SE=sample enable (0)
//6:WE=windowing enable (0)
//5:TRIGM=trigger mode enable (0)
//4:PMODE=power mode select (0)
//3:INV=comparator invert (0)
//2:COS=comparator output select (0)
//1:OPE=comparator output pin enable (0)
//0:EN=comparator module enable (0)
#define CMP_CR1_EN_MASK 0x1
#define CMP_CR1_EN_SHIFT 0
#define CMP_CR1_OPE_MASK 0x2
#define CMP_CR1_OPE_SHIFT 1
#define CMP_CR1_COS_MASK 0x4
#define CMP_CR1_COS_SHIFT 2
#define CMP_CR1_INV_MASK 0x8
#define CMP_CR1_INV_SHIFT 3
#define CMP_CR1_PMODE_MASK 0x10
#define CMP_CR1_PMODE_SHIFT 4
#define CMP_CR1_TRIGM_MASK 0x20
#define CMP_CR1_TRIGM_SHIFT 5
#define CMP_CR1_WE_MASK 0x40
#define CMP_CR1_WE_SHIFT 6
#define CMP_CR1_SE_MASK 0x80
#define CMP_CR1_SE_SHIFT 7
//---------------------------------------------------------------
//CMP0_FPR=CMP filter period register (0x00)
//7-0:FILT_PER=CMP filter period register (0x00)
#define CMP_FPR_FILT_PER_MASK 0xFF
#define CMP_FPR_FILT_PER_SHIFT 0
//---------------------------------------------------------------
//CMP0_SCR=CMP status and control register (0x00)
//7:(reserved):read-only:0
//6:DMAEN=DMA enable control (0)
//5:(reserved):read-only:0
//4:IER=comparator interrupt enable rising (0)
//3:IEF=comparator interrupt enable falling (0)
//2:CFR=analog comparator flag rising: w1c (0)
//1:CFF=analog comparator flag falling: w1c (0)
//0:COUT=analog comparator output (0)
#define CMP_SCR_COUT_MASK 0x1
#define CMP_SCR_COUT_SHIFT 0
#define CMP_SCR_CFF_MASK 0x2
#define CMP_SCR_CFF_SHIFT 1
#define CMP_SCR_CFR_MASK 0x4
#define CMP_SCR_CFR_SHIFT 2
#define CMP_SCR_IEF_MASK 0x8
#define CMP_SCR_IEF_SHIFT 3
#define CMP_SCR_IER_MASK 0x10
#define CMP_SCR_IER_SHIFT 4
#define CMP_SCR_DMAEN_MASK 0x40
#define CMP_SCR_DMAEN_SHIFT 6
//---------------------------------------------------------------
//CMP0_DACCR=DAC control register (0x00)
//  7:DACEN=DAC enable (0)
//  6:VRSEL=supply voltage reference source select (0)
//5-0:VOSEL=DAC output voltage select (00000)
//          DAC0 = (Vin / 64) x (VOSEL[5:0] + 1)
#define CMP_DACCR_VOSEL_MASK 0x3F
#define CMP_DACCR_VOSEL_SHIFT 0
#define CMP_DACCR_VRSEL_MASK 0x40
#define CMP_DACCR_VRSEL_SHIFT 6
#define CMP_DACCR_DACEN_MASK 0x80
#define CMP_DACCR_DACEN_SHIFT 7
//---------------------------------------------------------------
//CMP0_MUXCR=MUX control register (0x00)
//  7:PSTM=pass through mode enable (0)
//5-3:PSEL=plus input mux control (000)
//         selects IN[PSEL]
//2-0:MSEL=minus input mux control (000)
//         selects IN[MSEL]
#define CMP_MUXCR_MSEL_MASK 0x7
#define CMP_MUXCR_MSEL_SHIFT 0
#define CMP_MUXCR_PSEL_MASK 0x38
#define CMP_MUXCR_PSEL_SHIFT 3
#define CMP_MUXCR_PSTM_MASK 0x80
#define CMP_MUXCR_PSTM_SHIFT 7
//---------------------------------------------------------------
//DAC
#define DAC0_BASE 0x4003F000
#define DAC0_DAT0L_OFFSET 0x00
#define DAC0_DAT0H_OFFSET 0x01
#define DAC0_DAT1L_OFFSET 0x02
#define DAC0_DAT1H_OFFSET 0x03
#define DAC0_SR_OFFSET 0x20
#define DAC0_C0_OFFSET 0x21
#define DAC0_C1_OFFSET 0x22
#define DAC0_C2_OFFSET 0x23
#define DAC0_DAT0L (DAC0_BASE + DAC0_DAT0L_OFFSET)
#define DAC0_DAT0H (DAC0_BASE + DAC0_DAT0H_OFFSET)
#define DAC0_DAT1L (DAC0_BASE + DAC0_DAT1L_OFFSET)
