PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#define DAC0_DAT1H (DAC0_BASE + DAC0_DAT1H_OFFSET)
#define DAC0_SR (DAC0_BASE + DAC0_SR_OFFSET)
#define DAC0_C0 (DAC0_BASE + DAC0_C0_OFFSET)
#define DAC0_C1 (DAC0_BASE + DAC0_C1_OFFSET)
#define DAC0_C2 (DAC0_BASE + DAC0_C2_OFFSET)
//---------------------------------------------------------------
//DAC_DAT0H:  DAC data high register 0
//If buffer not enabled, Vout = Vin * (1 + DATA[11:0])/4096.
//7-4:(reserved):read-only:0
//3-0:DATA1=DATA[11:8]
#define DAC_DAT0H_MASK 0x0F
#define DAC_DAT0H_SHIFT 0
//---------------------------------------------------------------
//DAC_DAT0L:  DAC data low register 0
//If buffer not enabled, Vout = Vin * (1 + DATA[11:0])/4096.
//7-0:DATA0=DATA[7:0]
//---------------------------------------------------------------
//DAC_DAT1H:  DAC data high register 1
//If buffer not enabled, Vout = Vin * (1 + DATA[11:0])/4096.
//7-4:(reserved):read-only:0
//3-0:DATA1=DATA[11:8]
#define DAC_DAT1H_MASK 0x0F
#define DAC_DAT1H_SHIFT 0
//---------------------------------------------------------------
//DAC_DAT1L:  DAC data low register 1
//If buffer not enabled, Vout = Vin * (1 + DATA[11:0])/4096.
//7-0:DATA0=DATA[7:0]
//---------------------------------------------------------------
//DAC_C0:  DAC control register 0
//7:DACEN=DAC enable
//6:DACRFS=DAC reference select
//         0:DACREF_1=VREFH
//         1:DACREF_2=VDDA (best for ADC operation)
//5:DACTRGSEL=DAC trigger select
//            0:HW
//            1:SW
//4:DACSWTRG=DAC software trigger
//           active-high write-only field that reads 0
//           DACBFEN & DACTRGSEL:  writing 1 advances buffer pointer
//3:LPEN=DAC low power control
//       0:high-power mode
//       1:low-power mode
//2:(reserved):read-only:0
//1:DACBTIEN=DAC buffer read pointer top flag interrupt enable
//0:DACBBIEN=DAC buffer read pointer bottom flag interrupt enable
#define DAC_C0_DACEN_MASK 0x80
#define DAC_C0_DACEN_SHIFT 7
#define DAC_C0_DACRFS_MASK 0x40
#define DAC_C0_DACRFS_SHIFT 6
#define DAC_C0_DACTRGSEL_MASK 0x20
#define DAC_C0_DACTRGSEL_SHIFT 5
#define DAC_C0_DACSWTRG_MASK 0x10
#define DAC_C0_DACSWTRG_SHIFT 4
#define DAC_C0_LPEN_MASK 0x08
#define DAC_C0_LPEN_SHIFT 3
#define DAC_C0_DACBTIEN_MASK 0x02
#define DAC_C0_DACBTIEN_SHIFT 1
#define DAC_C0_DACBBIEN_MASK 0x01
#define DAC_C0_DACBBIEN_SHIFT 0
//---------------------------------------------------------------
//DAC_C1:  DAC control register 1
//  7:DMAEN=DMA enable select
//6-3:(reserved)
//  2:DACBFMD=DAC buffer work mode select
//            0:normal
//            1:one-time scan
//  1:(reserved)
//  0:DACBFEN=DAC buffer enable
//            0:disabled:data in first word of buffer
//            1:enabled:read pointer points to data
#define DAC_C1_DMAEN_MASK 0x80
#define DAC_C1_DMAEN_SHIFT 7
#define DAC_C1_DACBFMD_MASK 0x04
#define DAC_C1_DACBFMD_SHIFT 2
#define DAC_C1_DACBFEN_MASK 0x01
#define DAC_C1_DACBFEN_SHIFT 0
//---------------------------------------------------------------
//DAC_C2:  DAC control register 2
//7-5:(reserved):read-only:0
//  4:DACBFRP=DAC buffer read pointer
//3-1:(reserved):read-only:0
//  0:DACBFUP=DAC buffer read upper limit
#define DAC_C2_DACBFRP_MASK 0x10
#define DAC_C2_DACBFRP_SHIFT 4
#define DAC_C2_DACBFUP_MASK 0x01
#define DAC_C2_DACBFUP_SHIFT 0
//---------------------------------------------------------------
//DAC_SR:  DAC status register
//Writing 0 clears a field// writing 1 has no effect.
//7-2:(reserved):read-only:0
//1:DACBFRPTF=DAC buffer read pointer top position flag
//            Indicates whether pointer is zero
//0:DACBFRPBF=DAC buffer read pointer bottom position flag
//            Indicates whether pointer is equal to DAC0_C2.DACBFUP.
#define DAC_SR_DACBFRPTF_MASK 0x02
#define DAC_SR_DACBFRPTF_SHIFT 1
#define DAC_SR_DACBFRPBF_MASK 0x01
#define DAC_SR_DACBFRPBF_SHIFT 0
//---------------------------------------------------------------
//Fast (zero wait state) GPIO (FGPIO) or (IOPORT)
//FGPIOx_PDD: Port x Data Direction Register
//Bit n:  0=Port x pin n configured as input
//        1=Port x pin n configured as output
#define FGPIO_BASE 0xF80FF000
//offsets for PDOR, PSOR, PCOR, PTOR, PDIR, and PDDR defined
//  with .equ GPIO, ates
//offsets for Ports A-E defined with .equ GPIO, ates
//Port A
#define FGPIOA_BASE 0xF80FF000
#define FGPIOA_PDOR (FGPIOA_BASE + GPIO_PDOR_OFFSET)
#define FGPIOA_PSOR (FGPIOA_BASE + GPIO_PSOR_OFFSET)
#define FGPIOA_PCOR (FGPIOA_BASE + GPIO_PCOR_OFFSET)
#define FGPIOA_PTOR (FGPIOA_BASE + GPIO_PTOR_OFFSET)
#define FGPIOA_PDIR (FGPIOA_BASE + GPIO_PDIR_OFFSET)
#define FGPIOA_PDDR (FGPIOA_BASE + GPIO_PDDR_OFFSET)
//Port B
#define FGPIOB_BASE 0xF80FF040
#define FGPIOB_PDOR (FGPIOB_BASE + GPIO_PDOR_OFFSET)
#define FGPIOB_PSOR (FGPIOB_BASE + GPIO_PSOR_OFFSET)
#define FGPIOB_PCOR (FGPIOB_BASE + GPIO_PCOR_OFFSET)
#define FGPIOB_PTOR (FGPIOB_BASE + GPIO_PTOR_OFFSET)
#define FGPIOB_PDIR (FGPIOB_BASE + GPIO_PDIR_OFFSET)
#define FGPIOB_PDDR (FGPIOB_BASE + GPIO_PDDR_OFFSET)
//Port C
#define FGPIOC_BASE 0xF80FF080
#define FGPIOC_PDOR (FGPIOC_BASE + GPIO_PDOR_OFFSET)
#define FGPIOC_PSOR (FGPIOC_BASE + GPIO_PSOR_OFFSET)
#define FGPIOC_PCOR (FGPIOC_BASE + GPIO_PCOR_OFFSET)
#define FGPIOC_PTOR (FGPIOC_BASE + GPIO_PTOR_OFFSET)
#define FGPIOC_PDIR (FGPIOC_BASE + GPIO_PDIR_OFFSET)
#define FGPIOC_PDDR (FGPIOC_BASE + GPIO_PDDR_OFFSET)
//Port D
#define FGPIOD_BASE 0xF80FF0C0
#define FGPIOD_PDOR (FGPIOD_BASE + GPIO_PDOR_OFFSET)
#define FGPIOD_PSOR (FGPIOD_BASE + GPIO_PSOR_OFFSET)
#define FGPIOD_PCOR (FGPIOD_BASE + GPIO_PCOR_OFFSET)
#define FGPIOD_PTOR (FGPIOD_BASE + GPIO_PTOR_OFFSET)
#define FGPIOD_PDIR (FGPIOD_BASE + GPIO_PDIR_OFFSET)
#define FGPIOD_PDDR (FGPIOD_BASE + GPIO_PDDR_OFFSET)
//Port E
#define FGPIOE_BASE 0xF80FF100
#define FGPIOE_PDOR (FGPIOE_BASE + GPIO_PDOR_OFFSET)
#define FGPIOE_PSOR (FGPIOE_BASE + GPIO_PSOR_OFFSET)
#define FGPIOE_PCOR (FGPIOE_BASE + GPIO_PCOR_OFFSET)
#define FGPIOE_PTOR (FGPIOE_BASE + GPIO_PTOR_OFFSET)
#define FGPIOE_PDIR (FGPIOE_BASE + GPIO_PDIR_OFFSET)
#define FGPIOE_PDDR (FGPIOE_BASE + GPIO_PDDR_OFFSET)
//---------------------------------------------------------------
//Flash Configuration Field (FCF) 0x400-0x40F
//Following Freescale startup_MKL46Z4.s
//     CMSIS Cortex-M0plus Core Device Startup File for the MKL64Z4
//     v2.2, 4/12/2013
//16-byte flash configuration field that stores default protection settings
//(loaded on reset) and security information that allows the MCU to 
//restrict acces to the FTFL module.
//FCF Backdoor Comparison Key
//8 bytes from 0x400-0x407
//-----------------------------------------------------
//FCF Backdoor Comparison Key 0
//7-0:Backdoor Key 0
#define FCF_BACKDOOR_KEY0 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 1
//7-0:Backdoor Key 1
#define FCF_BACKDOOR_KEY1 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 2
//7-0:Backdoor Key 2
#define FCF_BACKDOOR_KEY2 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 3
//7-0:Backdoor Key 3
#define FCF_BACKDOOR_KEY3 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 4
//7-0:Backdoor Key 4
#define FCF_BACKDOOR_KEY4 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 5
//7-0:Backdoor Key 5
#define FCF_BACKDOOR_KEY5 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 6
//7-0:Backdoor Key 6
#define FCF_BACKDOOR_KEY6 0xFF
//-----------------------------------------------------
//FCF Backdoor Comparison Key 7
//7-0:Backdoor Key 7
#define FCF_BACKDOOR_KEY7 0xFF
//-----------------------------------------------------
//FCF Flash nonvolatile option byte (FCF_FOPT)
//Allows user to customize operation of the MCU at boot time.
//7-6:11:(reserved)
//  5: 1:FAST_INIT=fast initialization
//4,0:11:LPBOOT=core and system clock divider:  2^(3-LPBOOT)
//  3: 1:RESET_PIN_CFG=enable reset pin following POR
//  2: 1:NMI_DIS=Enable NMI
//  1: 1:(reserved)
//  0:(see bit 4 above)
#define FCF_FOPT 0xFF
//-----------------------------------------------------
//FCF Program flash protection bytes (FCF_FPROT)
//Each program flash region can be protected from program and erase 
//operation by setting the associated PROT bit.  Each bit protects a 
//1/32 region of the program flash memory.
//FCF FPROT0
//7:1:FCF_PROT7=Program flash region 7/32 not protected
//6:1:FCF_PROT6=Program flash region 6/32 not protected
//5:1:FCF_PROT5=Program flash region 5/32 not protected
//4:1:FCF_PROT4=Program flash region 4/32 not protected
//3:1:FCF_PROT3=Program flash region 3/32 not protected
//2:1:FCF_PROT2=Program flash region 2/32 not protected
//1:1:FCF_PROT1=Program flash region 1/32 not protected
//0:1:FCF_PROT0=Program flash region 0/32 not protected
#define FCF_FPROT0 0xFF
//-----------------------------------------------------
//FCF FPROT1
//7:1:FCF_PROT15=Program flash region 15/32 not protected
//6:1:FCF_PROT14=Program flash region 14/32 not protected
//5:1:FCF_PROT13=Program flash region 13/32 not protected
//4:1:FCF_PROT12=Program flash region 12/32 not protected
//3:1:FCF_PROT11=Program flash region 11/32 not protected
//2:1:FCF_PROT10=Program flash region 10/32 not protected
//1:1:FCF_PROT9=Program flash region 9/32 not protected
//0:1:FCF_PROT8=Program flash region 8/32 not protected
#define FCF_FPROT1 0xFF
//-----------------------------------------------------
//FCF FPROT2
//7:1:FCF_PROT23=Program flash region 23/32 not protected
//6:1:FCF_PROT22=Program flash region 22/32 not protected
//5:1:FCF_PROT21=Program flash region 21/32 not protected
//4:1:FCF_PROT20=Program flash region 20/32 not protected
//3:1:FCF_PROT19=Program flash region 19/32 not protected
//2:1:FCF_PROT18=Program flash region 18/32 not protected
//1:1:FCF_PROT17=Program flash region 17/32 not protected
//0:1:FCF_PROT16=Program flash region 16/32 not protected
#define FCF_FPROT2 0xFF
//-----------------------------------------------------
//FCF FPROT3
//7:1:FCF_PROT31=Program flash region 31/32 not protected
//6:1:FCF_PROT30=Program flash region 30/32 not protected
//5:1:FCF_PROT29=Program flash region 29/32 not protected
//4:1:FCF_PROT28=Program flash region 28/32 not protected
//3:1:FCF_PROT27=Program flash region 27/32 not protected
//2:1:FCF_PROT26=Program flash region 26/32 not protected
//1:1:FCF_PROT25=Program flash region 25/32 not protected
//0:1:FCF_PROT24=Program flash region 24/32 not protected
#define FCF_FPROT3 0xFF
//-----------------------------------------------------
//FCF Flash security byte (FCF_FSEC)
//WARNING: If SEC field is configured as "MCU security status is 
//secure" and MEEN field is configured as "Mass erase is disabled",
//MCU's security status cannot be set back to unsecure state since 
//mass erase via the debugger is blocked !!!
//7-6:01:KEYEN=backdoor key security enable
//            :00=Backdoor key access disabled
//            :01=Backdoor key access disabled (preferred value)
//            :10=Backdoor key access enabled
//            :11=Backdoor key access disabled
//5-4:11:MEEN=mass erase enable bits
//           (does not matter if SEC unsecure)
//           :00=mass erase enabled
//           :01=mass erase enabled
//           :10=mass erase disabled
//           :11=mass erase enabled
//3-2:11:FSLACC=Freescale failure analysis access code
//             (does not matter if SEC unsecure)
//             :00=Freescale factory access granted
//             :01=Freescale factory access denied
//             :10=Freescale factory access denied
//             :11=Freescale factory access granted
//1-0:10:SEC=flash security
//          :00=MCU secure
//          :01=MCU secure
//          :10=MCU unsecure (standard value)
//          :11=MCU secure
#define FCF_FSEC 0x7E
//---------------------------------------------------------------
//General-purpose input and output (GPIO)
//GPIOx_PDD: Port x Data Direction Register
//Bit n:  0=Port x pin n configured as input
//        1=Port x pin n configured as output
#define GPIO_BASE 0x400FF000
#define GPIO_PDOR_OFFSET 0x00
#define GPIO_PSOR_OFFSET 0x04
#define GPIO_PCOR_OFFSET 0x08
#define GPIO_PTOR_OFFSET 0x0C
#define GPIO_PDIR_OFFSET 0x10
#define GPIO_PDDR_OFFSET 0x14
#define GPIOA_OFFSET 0x00
#define GPIOB_OFFSET 0x40
#define GPIOC_OFFSET 0x80
#define GPIOD_OFFSET 0xC0
#define GPIOE_OFFSET 0x0100
//Port A
#define GPIOA_BASE 0x400FF000
#define GPIOA_PDOR (GPIOA_BASE + GPIO_PDOR_OFFSET)
#define GPIOA_PSOR (GPIOA_BASE + GPIO_PSOR_OFFSET)
#define GPIOA_PCOR (GPIOA_BASE + GPIO_PCOR_OFFSET)
#define GPIOA_PTOR (GPIOA_BASE + GPIO_PTOR_OFFSET)
#define GPIOA_PDIR (GPIOA_BASE + GPIO_PDIR_OFFSET)
#define GPIOA_PDDR (GPIOA_BASE + GPIO_PDDR_OFFSET)
//Port B
#define GPIOB_BASE 0x400FF040
#define GPIOB_PDOR (GPIOB_BASE + GPIO_PDOR_OFFSET)
#define GPIOB_PSOR (GPIOB_BASE + GPIO_PSOR_OFFSET)
#define GPIOB_PCOR (GPIOB_BASE + GPIO_PCOR_OFFSET)
#define GPIOB_PTOR (GPIOB_BASE + GPIO_PTOR_OFFSET)
#define GPIOB_PDIR (GPIOB_BASE + GPIO_PDIR_OFFSET)
#define GPIOB_PDDR (GPIOB_BASE + GPIO_PDDR_OFFSET)
//Port C
#define GPIOC_BASE 0x400FF080
#define GPIOC_PDOR (GPIOC_BASE + GPIO_PDOR_OFFSET)
#define GPIOC_PSOR (GPIOC_BASE + GPIO_PSOR_OFFSET)
#define GPIOC_PCOR (GPIOC_BASE + GPIO_PCOR_OFFSET)
#define GPIOC_PTOR (GPIOC_BASE + GPIO_PTOR_OFFSET)
#define GPIOC_PDIR (GPIOC_BASE + GPIO_PDIR_OFFSET)
#define GPIOC_PDDR (GPIOC_BASE + GPIO_PDDR_OFFSET)
//Port D
#define GPIOD_BASE 0x400FF0C0
#define GPIOD_PDOR (GPIOD_BASE + GPIO_PDOR_OFFSET)
#define GPIOD_PSOR (GPIOD_BASE + GPIO_PSOR_OFFSET)
#define GPIOD_PCOR (GPIOD_BASE + GPIO_PCOR_OFFSET)
#define GPIOD_PTOR (GPIOD_BASE + GPIO_PTOR_OFFSET)
#define GPIOD_PDIR (GPIOD_BASE + GPIO_PDIR_OFFSET)
#define GPIOD_PDDR (GPIOD_BASE + GPIO_PDDR_OFFSET)
//Port E
#define GPIOE_BASE 0x400FF100
#define GPIOE_PDOR (GPIOE_BASE + GPIO_PDOR_OFFSET)
#define GPIOE_PSOR (GPIOE_BASE + GPIO_PSOR_OFFSET)
#define GPIOE_PCOR (GPIOE_BASE + GPIO_PCOR_OFFSET)
#define GPIOE_PTOR (GPIOE_BASE + GPIO_PTOR_OFFSET)
#define GPIOE_PDIR (GPIOE_BASE + GPIO_PDIR_OFFSET)
#define GPIOE_PDDR (GPIOE_BASE + GPIO_PDDR_OFFSET)
//---------------------------------------------------------------
//IOPORT:  GPIO alias for zero wait state access to GPIO
//See FGPIO
//---------------------------------------------------------------
//LCD Controller (SLCD)
#define LCD_BASE 0x40053000
#define LCD_GCR_OFFSET 0x00
#define LCD_AR_OFFSET 0x04
#define LCD_FDCR_OFFSET 0x08
#define LCD_FDSR_OFFSET 0x0C
#define LCD_PENL_OFFSET 0x10
#define LCD_PENH_OFFSET 0x14
#define LCD_BPENL_OFFSET 0x18
#define LCD_BPENH_OFFSET 0x1C
// WF.D[16] or WF.B[64]
#define LCD_WF_OFFSET 0x20
#define LCD_WF3TO0_OFFSET 0x20
#define LCD_WF7TO4_OFFSET 0x24
#define LCD_WF11TO8_OFFSET 0x28
#define LCD_WF15TO12_OFFSET 0x2C
#define LCD_WF19TO16_OFFSET 0x30
#define LCD_WF23TO20_OFFSET 0x34
#define LCD_WF27TO24_OFFSET 0x38
#define LCD_WF31TO28_OFFSET 0x3C
#define LCD_WF35TO32_OFFSET 0x40
#define LCD_WF39TO36_OFFSET 0x44
#define LCD_WF43TO40_OFFSET 0x48
#define LCD_WF47TO44_OFFSET 0x4C
#define LCD_WF51TO48_OFFSET 0x50
#define LCD_WF55TO52_OFFSET 0x54
#define LCD_WF59TO56_OFFSET 0x58
#define LCD_WF63TO60_OFFSET 0x5C
#define LCD_GCR (LCD_BASE + LCD_GCR_OFFSET)
#define LCD_AR (LCD_BASE + LCD_AR_OFFSET)
#define LCD_FDCR (LCD_BASE + LCD_FDCR_OFFSET)
#define LCD_FDSR (LCD_BASE + LCD_FDSR_OFFSET)
#define LCD_PENL (LCD_BASE + LCD_PENL_OFFSET)
#define LCD_PENH (LCD_BASE + LCD_PENH_OFFSET)
#define LCD_BPENL (LCD_BASE + LCD_BPENL_OFFSET)
#define LCD_BPENH (LCD_BASE + LCD_BPENH_OFFSET)
// WF.D[16] or WF.B[64]
#define LCD_WF (LCD_BASE + LCD_WF_OFFSET)
#define LCD_WF3TO0 (LCD_BASE + LCD_WF3TO0_OFFSET)
#define LCD_WF7TO4 (LCD_BASE + LCD_WF7TO4_OFFSET)
#define LCD_WF11TO8 (LCD_BASE + LCD_WF11TO8_OFFSET)
#define LCD_WF15TO12 (LCD_BASE + LCD_WF15TO12_OFFSET)
#define LCD_WF19TO16 (LCD_BASE + LCD_WF19TO16_OFFSET)
#define LCD_WF23TO20 (LCD_BASE + LCD_WF23TO20_OFFSET)
#define LCD_WF27TO24 (LCD_BASE + LCD_WF27TO24_OFFSET)
#define LCD_WF31TO28 (LCD_BASE + LCD_WF31TO28_OFFSET)
#define LCD_WF35TO32 (LCD_BASE + LCD_WF35TO32_OFFSET)
#define LCD_WF39TO36 (LCD_BASE + LCD_WF39TO36_OFFSET)
#define LCD_WF43TO40 (LCD_BASE + LCD_WF43TO40_OFFSET)
#define LCD_WF47TO44 (LCD_BASE + LCD_WF47TO44_OFFSET)
#define LCD_WF51TO48 (LCD_BASE + LCD_WF51TO48_OFFSET)
#define LCD_WF55TO52 (LCD_BASE + LCD_WF55TO52_OFFSET)
#define LCD_WF59TO56 (LCD_BASE + LCD_WF59TO56_OFFSET)
#define LCD_WF63TO60 (LCD_BASE + LCD_WF63TO60_OFFSET)
//---------------------------------------------------------------
//LCD_GCR:  LCD general control register:  (POR:  0x08300003)
//   31:  RVEN:  regulated voltage enable:  (POR:  0)
//30-28:  (reserved):read-only:000
//27-24:  RVTRIM:  regulated voltage trim:  (1000)
//   23:  CPSEL:  charge pump select: (0)
//                0:  resister network
//                1:  charge pump
//   22:  (reserved):read-only:0
//21-20:  LADJ:  load adjust:  (11)
//          CPSEL = 0:  adjust resistor bias network
//            00:  low load (LCD glass <= 2000 pF)
//                 LCD or GPIO for pins VLL1, VLL2, VCAP1, or VCAP2
//            01:  low laod (LCD glass <= 2000 pF)
//                 LCD or GPIO for pins VLL1, VLL2, VCAP1, or VCAP2
//            10:  high load (LCD glass <= 8000 pF)
//                 LCD or GPIO for pins VCAP1 or VCAP2
//            11:  high load (LCD glass <= 8000 pF)
//                 LCD or GPIO for pins VCAP1 or VCAP2
//          CPSEL = 1:  adjust clock source for charge pump
//            00:  fastest clock (LCD glass <= 8000 pF [4000 pF if FFR])
//            01:  intermediate clock (LCD glass <= 4000 pF [2000 pF if FFR])
//            10:  intermediate clock (LCD glass <= 2000 pF [1000 pF if FFR])
//            11:  slowest clock (LCD glass <= 1000 pF [500 pF if FFR])
//   19:  (reserved):read-only:0
//   18:  (reserved):read-only:0
//   17:  VSUPPLY:  voltage supply control:  (0)
//                  0:  VLL3 internally from VDD
//                  1:  VLL3 externally from VDD or VLL internally from VIREG
//   16:  (reserved):read-only:0
//   15:  PADSAFE:  pad safe state enable:  (0)
//   14:  FDCIEN:  LCD fault detection complete interrupt enable:  (0)
//13-12:  ATLDIV:  LCD alternate clock divider = 8^ALTDIV:  (00)
//   11:  ALTSOURCE:  alternate clock source select = ALTSOURCE + 1:  (0)
//   10:  FFR:  fast frame rate select:  (0)
//              0:  standard frequency, [23.3, 73.1]
//              1:  fast frequency = std. x 2, [46.6, 146.2]
//    9:  LCDDOZE:  LCD doze enable:  (0)
//    8:  LCDSTP:  LCD stop:  (0)
//    7:  LCDEN:  LCD driver enable:  (0)
//    6:  SOURCE:  LCD clock source select:  (0)
//                 0:  Default clock (SIM_SOPT1.OSC32KSEL)
//                 1:  Alternate clock (LCD_GCR.ALTSOURCE)
//  5-3:  LCLK:  LCD clock prescaler:  (000)
//               frequency = SOURCE / ((DUTY + 1) x 8 x (4 +LCLK) x Y)
//  2-0:  DUTY:  LCD duty select:  (011)
//               000, 001, 010, 011, 111:  1 / (DUTY + 1) duty cycle
#define LCD_GCR_DUTY_MASK 0x7
#define LCD_GCR_DUTY_SHIFT 0
#define LCD_GCR_LCLK_MASK 0x38
#define LCD_GCR_LCLK_SHIFT 3
#define LCD_GCR_SOURCE_MASK 0x40
#define LCD_GCR_SOURCE_SHIFT 6
#define LCD_GCR_LCDEN_MASK 0x80
#define LCD_GCR_LCDEN_SHIFT 7
#define LCD_GCR_LCDSTP_MASK 0x100
#define LCD_GCR_LCDSTP_SHIFT 8
#define LCD_GCR_LCDDOZE_MASK 0x200
#define LCD_GCR_LCDDOZE_SHIFT 9
#define LCD_GCR_FFR_MASK 0x400
#define LCD_GCR_FFR_SHIFT 10
#define LCD_GCR_ALTSOURCE_MASK 0x800
#define LCD_GCR_ALTSOURCE_SHIFT 11
#define LCD_GCR_ALTDIV_MASK 0x3000
#define LCD_GCR_ALTDIV_SHIFT 12
#define LCD_GCR_FDCIEN_MASK 0x4000
#define LCD_GCR_FDCIEN_SHIFT 14
#define LCD_GCR_PADSAFE_MASK 0x8000
#define LCD_GCR_PADSAFE_SHIFT 15
#define LCD_GCR_VSUPPLY_MASK 0x20000
#define LCD_GCR_VSUPPLY_SHIFT 17
#define LCD_GCR_LADJ_MASK 0x300000
#define LCD_GCR_LADJ_SHIFT 20
#define LCD_GCR_CPSEL_MASK 0x800000
#define LCD_GCR_CPSEL_SHIFT 23
#define LCD_GCR_RVTRIM_MASK 0xF000000
#define LCD_GCR_RVTRIM_SHIFT 24
#define LCD_GCR_RVEN_MASK 0x80000000
#define LCD_GCR_RVEN_SHIFT 31
//---------------------------------------------------------------
//LCD_AR:  LCD auxiliary register:  (POR:  0x00000000)
//31-16:  (reserved):read-only:0x0000
//   15:  (reserved):read-only:0
// 14-8:  (reserved):read-only:0000000
//    7:  BLINK:  blink command:  (0)
//    6:  ALT:  alternate display mode:  (0)
//    5:  BLANK:  blank display mode:  (0)
//    4:  (reserved:read-only:0
//    3:  BMODE:  blink mode:  (0)
//                0:  display blank during blink period
//                1:  display alternate display during blink period (LCD_GCR.DUTY < 5)
//  2-0:  BRATE:  blink-rate configuration:  (000)
//                Blink rate = LCD clock / (2 ^ (12 + BRATE))
#define LCD_AR_BRATE_MASK 0x7
#define LCD_AR_BRATE_SHIFT 0
#define LCD_AR_BMODE_MASK 0x8
#define LCD_AR_BMODE_SHIFT 3
#define LCD_AR_BLANK_MASK 0x20
#define LCD_AR_BLANK_SHIFT 5
#define LCD_AR_ALT_MASK 0x40
#define LCD_AR_ALT_SHIFT 6
#define LCD_AR_BLINK_MASK 0x80
#define LCD_AR_BLINK_SHIFT 7
//---------------------------------------------------------------
//LCD_FDCR:  LCD fault detect control register:  (POR:  0x00000000)
//31-16:  (reserved):read-only:0x0000
//   15:  (reserved):read-only:0
//14-12:  FDPRS:  fault detect clock prescaler (000)
//                Fault detect sample clock = Bus clock / (2 ^ FDPRS)
// 11-9:  FDSWW:  fault detect sample window width:  (000)
//                Window width = 4 x (2 ^ FDSWW)
//    8:  (reserved):read-only:0
//    7:  FDEN:  fault detect enable:  (0)
//    6:  FDBPEN:  fault detect back plane enable:  (0)
//  5-0:  BDPINID:  fault detect pin ID:  (000000)
#define LCD_FDCR_FDPINID_MASK 0x3F
#define LCD_FDCR_FDPINID_SHIFT 0
#define LCD_FDCR_FDBPEN_MASK 0x40
#define LCD_FDCR_FDBPEN_SHIFT 6
#define LCD_FDCR_FDEN_MASK 0x80
#define LCD_FDCR_FDEN_SHIFT 7
#define LCD_FDCR_FDSWW_MASK 0xE00
#define LCD_FDCR_FDSWW_SHIFT 9
#define LCD_FDCR_FDPRS_MASK 0x7000
#define LCD_FDCR_FDPRS_SHIFT 12
//---------------------------------------------------------------
//LCD_FDSR:  LCD fault detect status register:  (POR:  0x00000000)
//31-16:  (reserved):read-only:0x0000
//   15:  FDCF:  fault detection complete flag:  (0)
//         read:0=fault detection not completed
//              1=fault detection completed
//         write:0=(no effect)
//               1=clear
// 14-8:  (reserved):read-only:0000000
//  7-0:  FDCNT:  fault detect counter:  (0x00)
#define LCD_FDSR_FDCNT_MASK 0xFF
#define LCD_FDSR_FDCNT_SHIFT 0
#define LCD_FDSR_FDCF_MASK 0x8000
#define LCD_FDSR_FDCF_SHIFT 15
//---------------------------------------------------------------
//LCD_PENn:  LCD pen enable register:  (POR:  0x00000000)
//31-0:  PEN:  LCD pin enable
//       bit n enables LCD operation on LCD pin n
#define LCD_PEN_PEN_MASK 0xFFFFFFFF
#define LCD_PEN_PEN_SHIFT 0
//---------------------------------------------------------------
//LCD_BPENn:  LCD back plane enable register:  (POR:  0x00000000)
//31-0:  BPEN:  back plane enable
//       bit n enables front'/back plane operation on LCD pin n
#define LCD_BPEN_BPEN_MASK 0xFFFFFFFF
#define LCD_BPEN_BPEN_SHIFT 0
//---------------------------------------------------------------
//LCD_WFyTOx:  LCD waveform register:  (POR:  0x00000000)
//May be written with 8-, 16-, or 32-bit writes
//y = x + 3
//31-24:  WFy [WF(x+3)]
//23-16:  WF(y-1) [WF(x+2)]
// 15-8:  WF(y-2) [WF(x+1)]
//  7-0:  WF(y-3) [WFx]
//        Each byte WFn (n in {x, x+1, x+2, y}) controls an LCD pen
//          bit 7:segment/phase H
//          bit 6:segment/phase G
//          bit 5:segment/phase F
//          bit 4:segment/phase E
//          bit 3:segment/phase D
//          bit 2:segment/phase C
//          bit 1:segment/phase B
//          bit 0:segment/phase A:
//                value 0:  segment off or phase deactivtated
//                value 1:  segment on or phase activated
//---------------------------------------------------------------
//Custom WFn register mapping not in C MKL46Z4.h
#define LCD_WF0_REG LCD_WF3TO0
