PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#define LCD_WF1_REG LCD_WF3TO0
#define LCD_WF2_REG LCD_WF3TO0
#define LCD_WF3_REG LCD_WF3TO0
#define LCD_WF4_REG LCD_WF7TO4
#define LCD_WF5_REG LCD_WF7TO4
#define LCD_WF6_REG LCD_WF7TO4
#define LCD_WF7_REG LCD_WF7TO4
#define LCD_WF8_REG LCD_WF11TO8
#define LCD_WF9_REG LCD_WF11TO8
#define LCD_WF10_REG LCD_WF11TO8
#define LCD_WF11_REG LCD_WF11TO8
#define LCD_WF12_REG LCD_WF15TO12
#define LCD_WF13_REG LCD_WF15TO12
#define LCD_WF14_REG LCD_WF15TO12
#define LCD_WF15_REG LCD_WF15TO12
#define LCD_WF16_REG LCD_WF19TO16
#define LCD_WF17_REG LCD_WF19TO16
#define LCD_WF18_REG LCD_WF19TO16
#define LCD_WF19_REG LCD_WF19TO16
#define LCD_WF20_REG LCD_WF23TO20
#define LCD_WF21_REG LCD_WF23TO20
#define LCD_WF22_REG LCD_WF23TO20
#define LCD_WF23_REG LCD_WF23TO20
#define LCD_WF24_REG LCD_WF27TO24
#define LCD_WF25_REG LCD_WF27TO24
#define LCD_WF26_REG LCD_WF27TO24
#define LCD_WF27_REG LCD_WF27TO24
#define LCD_WF28_REG LCD_WF31TO28
#define LCD_WF29_REG LCD_WF31TO28
#define LCD_WF30_REG LCD_WF31TO28
#define LCD_WF31_REG LCD_WF31TO28
#define LCD_WF32_REG LCD_WF35TO32
#define LCD_WF33_REG LCD_WF35TO32
#define LCD_WF34_REG LCD_WF35TO32
#define LCD_WF35_REG LCD_WF35TO32
#define LCD_WF36_REG LCD_WF39TO36
#define LCD_WF37_REG LCD_WF39TO36
#define LCD_WF38_REG LCD_WF39TO36
#define LCD_WF39_REG LCD_WF39TO36
#define LCD_WF40_REG LCD_WF43TO40
#define LCD_WF41_REG LCD_WF43TO40
#define LCD_WF42_REG LCD_WF43TO40
#define LCD_WF43_REG LCD_WF43TO40
#define LCD_WF44_REG LCD_WF47TO44
#define LCD_WF45_REG LCD_WF47TO44
#define LCD_WF46_REG LCD_WF47TO44
#define LCD_WF47_REG LCD_WF47TO44
#define LCD_WF48_REG LCD_WF51TO48
#define LCD_WF49_REG LCD_WF51TO48
#define LCD_WF50_REG LCD_WF51TO48
#define LCD_WF51_REG LCD_WF51TO48
#define LCD_WF52_REG LCD_WF55TO52
#define LCD_WF53_REG LCD_WF55TO52
#define LCD_WF54_REG LCD_WF55TO52
#define LCD_WF55_REG LCD_WF55TO52
#define LCD_WF56_REG LCD_WF59TO56
#define LCD_WF57_REG LCD_WF59TO56
#define LCD_WF58_REG LCD_WF59TO56
#define LCD_WF59_REG LCD_WF59TO56
#define LCD_WF60_REG LCD_WF63TO60
#define LCD_WF61_REG LCD_WF63TO60
#define LCD_WF62_REG LCD_WF63TO60
#define LCD_WF63_REG LCD_WF63TO60
//---------------------------------------------------------------
///* WF Bit Fields */ from C MKL46Z4.h
#define LCD_WF_WF0_MASK 0xFF
#define LCD_WF_WF0_SHIFT 0
#define LCD_WF_WF60_MASK 0xFF
#define LCD_WF_WF60_SHIFT 0
#define LCD_WF_WF56_MASK 0xFF
#define LCD_WF_WF56_SHIFT 0
#define LCD_WF_WF52_MASK 0xFF
#define LCD_WF_WF52_SHIFT 0
#define LCD_WF_WF4_MASK 0xFF
#define LCD_WF_WF4_SHIFT 0
#define LCD_WF_WF48_MASK 0xFF
#define LCD_WF_WF48_SHIFT 0
#define LCD_WF_WF44_MASK 0xFF
#define LCD_WF_WF44_SHIFT 0
#define LCD_WF_WF40_MASK 0xFF
#define LCD_WF_WF40_SHIFT 0
#define LCD_WF_WF8_MASK 0xFF
#define LCD_WF_WF8_SHIFT 0
#define LCD_WF_WF36_MASK 0xFF
#define LCD_WF_WF36_SHIFT 0
#define LCD_WF_WF32_MASK 0xFF
#define LCD_WF_WF32_SHIFT 0
#define LCD_WF_WF28_MASK 0xFF
#define LCD_WF_WF28_SHIFT 0
#define LCD_WF_WF12_MASK 0xFF
#define LCD_WF_WF12_SHIFT 0
#define LCD_WF_WF24_MASK 0xFF
#define LCD_WF_WF24_SHIFT 0
#define LCD_WF_WF20_MASK 0xFF
#define LCD_WF_WF20_SHIFT 0
#define LCD_WF_WF16_MASK 0xFF
#define LCD_WF_WF16_SHIFT 0
#define LCD_WF_WF5_MASK 0xFF00
#define LCD_WF_WF5_SHIFT 8
#define LCD_WF_WF49_MASK 0xFF00
#define LCD_WF_WF49_SHIFT 8
#define LCD_WF_WF45_MASK 0xFF00
#define LCD_WF_WF45_SHIFT 8
#define LCD_WF_WF61_MASK 0xFF00
#define LCD_WF_WF61_SHIFT 8
#define LCD_WF_WF25_MASK 0xFF00
#define LCD_WF_WF25_SHIFT 8
#define LCD_WF_WF17_MASK 0xFF00
#define LCD_WF_WF17_SHIFT 8
#define LCD_WF_WF41_MASK 0xFF00
#define LCD_WF_WF41_SHIFT 8
#define LCD_WF_WF13_MASK 0xFF00
#define LCD_WF_WF13_SHIFT 8
#define LCD_WF_WF57_MASK 0xFF00
#define LCD_WF_WF57_SHIFT 8
#define LCD_WF_WF53_MASK 0xFF00
#define LCD_WF_WF53_SHIFT 8
#define LCD_WF_WF37_MASK 0xFF00
#define LCD_WF_WF37_SHIFT 8
#define LCD_WF_WF9_MASK 0xFF00
#define LCD_WF_WF9_SHIFT 8
#define LCD_WF_WF1_MASK 0xFF00
#define LCD_WF_WF1_SHIFT 8
#define LCD_WF_WF29_MASK 0xFF00
#define LCD_WF_WF29_SHIFT 8
#define LCD_WF_WF33_MASK 0xFF00
#define LCD_WF_WF33_SHIFT 8
#define LCD_WF_WF21_MASK 0xFF00
#define LCD_WF_WF21_SHIFT 8
#define LCD_WF_WF26_MASK 0xFF0000
#define LCD_WF_WF26_SHIFT 16
#define LCD_WF_WF46_MASK 0xFF0000
#define LCD_WF_WF46_SHIFT 16
#define LCD_WF_WF6_MASK 0xFF0000
#define LCD_WF_WF6_SHIFT 16
#define LCD_WF_WF42_MASK 0xFF0000
#define LCD_WF_WF42_SHIFT 16
#define LCD_WF_WF18_MASK 0xFF0000
#define LCD_WF_WF18_SHIFT 16
#define LCD_WF_WF38_MASK 0xFF0000
#define LCD_WF_WF38_SHIFT 16
#define LCD_WF_WF22_MASK 0xFF0000
#define LCD_WF_WF22_SHIFT 16
#define LCD_WF_WF34_MASK 0xFF0000
#define LCD_WF_WF34_SHIFT 16
#define LCD_WF_WF50_MASK 0xFF0000
#define LCD_WF_WF50_SHIFT 16
#define LCD_WF_WF14_MASK 0xFF0000
#define LCD_WF_WF14_SHIFT 16
#define LCD_WF_WF54_MASK 0xFF0000
#define LCD_WF_WF54_SHIFT 16
#define LCD_WF_WF2_MASK 0xFF0000
#define LCD_WF_WF2_SHIFT 16
#define LCD_WF_WF58_MASK 0xFF0000
#define LCD_WF_WF58_SHIFT 16
#define LCD_WF_WF30_MASK 0xFF0000
#define LCD_WF_WF30_SHIFT 16
#define LCD_WF_WF62_MASK 0xFF0000
#define LCD_WF_WF62_SHIFT 16
#define LCD_WF_WF10_MASK 0xFF0000
#define LCD_WF_WF10_SHIFT 16
#define LCD_WF_WF63_MASK 0xFF000000
#define LCD_WF_WF63_SHIFT 24
#define LCD_WF_WF59_MASK 0xFF000000
#define LCD_WF_WF59_SHIFT 24
#define LCD_WF_WF55_MASK 0xFF000000
#define LCD_WF_WF55_SHIFT 24
#define LCD_WF_WF3_MASK 0xFF000000
#define LCD_WF_WF3_SHIFT 24
#define LCD_WF_WF51_MASK 0xFF000000
#define LCD_WF_WF51_SHIFT 24
#define LCD_WF_WF47_MASK 0xFF000000
#define LCD_WF_WF47_SHIFT 24
#define LCD_WF_WF43_MASK 0xFF000000
#define LCD_WF_WF43_SHIFT 24
#define LCD_WF_WF7_MASK 0xFF000000
#define LCD_WF_WF7_SHIFT 24
#define LCD_WF_WF39_MASK 0xFF000000
#define LCD_WF_WF39_SHIFT 24
#define LCD_WF_WF35_MASK 0xFF000000
#define LCD_WF_WF35_SHIFT 24
#define LCD_WF_WF31_MASK 0xFF000000
#define LCD_WF_WF31_SHIFT 24
#define LCD_WF_WF11_MASK 0xFF000000
#define LCD_WF_WF11_SHIFT 24
#define LCD_WF_WF27_MASK 0xFF000000
#define LCD_WF_WF27_SHIFT 24
#define LCD_WF_WF23_MASK 0xFF000000
#define LCD_WF_WF23_SHIFT 24
#define LCD_WF_WF19_MASK 0xFF000000
#define LCD_WF_WF19_SHIFT 24
#define LCD_WF_WF15_MASK 0xFF000000
#define LCD_WF_WF15_SHIFT 24
//---------------------------------------------------------------
//WFn Custom bit field names (not in C MKL46Z4.h)
//Each byte WFn (n in {x, x+1, x+2, y}) controls an LCD pen
//          bit 7:segment/phase H
//          bit 6:segment/phase G
//          bit 5:segment/phase F
//          bit 4:segment/phase E
//          bit 3:segment/phase D
//          bit 2:segment/phase C
//          bit 1:segment/phase B
//          bit 0:segment/phase A:
//                value 0:  segment off or phase deactivtated
//                value 1:  segment on or phase activated
#define LCD_WF_A_MASK 0x01
#define LCD_WF_A_SHIFT 0
#define LCD_WF_B_MASK 0x02
#define LCD_WF_B_SHIFT 1
#define LCD_WF_C_MASK 0x04
#define LCD_WF_C_SHIFT 2
#define LCD_WF_D_MASK 0x08
#define LCD_WF_D_SHIFT 3
#define LCD_WF_E_MASK 0x10
#define LCD_WF_E_SHIFT 4
#define LCD_WF_F_MASK 0x20
#define LCD_WF_F_SHIFT 5
#define LCD_WF_G_MASK 0x40
#define LCD_WF_G_SHIFT 6
#define LCD_WF_H_MASK 0x80
#define LCD_WF_H_SHIFT 7
//---------------------------------------------------------------
///* WF8B Bit Fields */
#define LCD_WF8B_BPALCD0_MASK 0x1
#define LCD_WF8B_BPALCD0_SHIFT 0
#define LCD_WF8B_BPALCD63_MASK 0x1
#define LCD_WF8B_BPALCD63_SHIFT 0
#define LCD_WF8B_BPALCD62_MASK 0x1
#define LCD_WF8B_BPALCD62_SHIFT 0
#define LCD_WF8B_BPALCD61_MASK 0x1
#define LCD_WF8B_BPALCD61_SHIFT 0
#define LCD_WF8B_BPALCD60_MASK 0x1
#define LCD_WF8B_BPALCD60_SHIFT 0
#define LCD_WF8B_BPALCD59_MASK 0x1
#define LCD_WF8B_BPALCD59_SHIFT 0
#define LCD_WF8B_BPALCD58_MASK 0x1
#define LCD_WF8B_BPALCD58_SHIFT 0
#define LCD_WF8B_BPALCD57_MASK 0x1
#define LCD_WF8B_BPALCD57_SHIFT 0
#define LCD_WF8B_BPALCD1_MASK 0x1
#define LCD_WF8B_BPALCD1_SHIFT 0
#define LCD_WF8B_BPALCD56_MASK 0x1
#define LCD_WF8B_BPALCD56_SHIFT 0
#define LCD_WF8B_BPALCD55_MASK 0x1
#define LCD_WF8B_BPALCD55_SHIFT 0
#define LCD_WF8B_BPALCD54_MASK 0x1
#define LCD_WF8B_BPALCD54_SHIFT 0
#define LCD_WF8B_BPALCD53_MASK 0x1
#define LCD_WF8B_BPALCD53_SHIFT 0
#define LCD_WF8B_BPALCD52_MASK 0x1
#define LCD_WF8B_BPALCD52_SHIFT 0
#define LCD_WF8B_BPALCD51_MASK 0x1
#define LCD_WF8B_BPALCD51_SHIFT 0
#define LCD_WF8B_BPALCD50_MASK 0x1
#define LCD_WF8B_BPALCD50_SHIFT 0
#define LCD_WF8B_BPALCD2_MASK 0x1
#define LCD_WF8B_BPALCD2_SHIFT 0
#define LCD_WF8B_BPALCD49_MASK 0x1
#define LCD_WF8B_BPALCD49_SHIFT 0
#define LCD_WF8B_BPALCD48_MASK 0x1
#define LCD_WF8B_BPALCD48_SHIFT 0
#define LCD_WF8B_BPALCD47_MASK 0x1
#define LCD_WF8B_BPALCD47_SHIFT 0
#define LCD_WF8B_BPALCD46_MASK 0x1
#define LCD_WF8B_BPALCD46_SHIFT 0
#define LCD_WF8B_BPALCD45_MASK 0x1
#define LCD_WF8B_BPALCD45_SHIFT 0
#define LCD_WF8B_BPALCD44_MASK 0x1
#define LCD_WF8B_BPALCD44_SHIFT 0
#define LCD_WF8B_BPALCD43_MASK 0x1
#define LCD_WF8B_BPALCD43_SHIFT 0
#define LCD_WF8B_BPALCD3_MASK 0x1
#define LCD_WF8B_BPALCD3_SHIFT 0
#define LCD_WF8B_BPALCD42_MASK 0x1
#define LCD_WF8B_BPALCD42_SHIFT 0
#define LCD_WF8B_BPALCD41_MASK 0x1
#define LCD_WF8B_BPALCD41_SHIFT 0
#define LCD_WF8B_BPALCD40_MASK 0x1
#define LCD_WF8B_BPALCD40_SHIFT 0
#define LCD_WF8B_BPALCD39_MASK 0x1
#define LCD_WF8B_BPALCD39_SHIFT 0
#define LCD_WF8B_BPALCD38_MASK 0x1
#define LCD_WF8B_BPALCD38_SHIFT 0
#define LCD_WF8B_BPALCD37_MASK 0x1
#define LCD_WF8B_BPALCD37_SHIFT 0
#define LCD_WF8B_BPALCD36_MASK 0x1
#define LCD_WF8B_BPALCD36_SHIFT 0
#define LCD_WF8B_BPALCD4_MASK 0x1
#define LCD_WF8B_BPALCD4_SHIFT 0
#define LCD_WF8B_BPALCD35_MASK 0x1
#define LCD_WF8B_BPALCD35_SHIFT 0
#define LCD_WF8B_BPALCD34_MASK 0x1
#define LCD_WF8B_BPALCD34_SHIFT 0
#define LCD_WF8B_BPALCD33_MASK 0x1
#define LCD_WF8B_BPALCD33_SHIFT 0
#define LCD_WF8B_BPALCD32_MASK 0x1
#define LCD_WF8B_BPALCD32_SHIFT 0
#define LCD_WF8B_BPALCD31_MASK 0x1
#define LCD_WF8B_BPALCD31_SHIFT 0
#define LCD_WF8B_BPALCD30_MASK 0x1
#define LCD_WF8B_BPALCD30_SHIFT 0
#define LCD_WF8B_BPALCD29_MASK 0x1
#define LCD_WF8B_BPALCD29_SHIFT 0
#define LCD_WF8B_BPALCD5_MASK 0x1
#define LCD_WF8B_BPALCD5_SHIFT 0
#define LCD_WF8B_BPALCD28_MASK 0x1
#define LCD_WF8B_BPALCD28_SHIFT 0
#define LCD_WF8B_BPALCD27_MASK 0x1
#define LCD_WF8B_BPALCD27_SHIFT 0
#define LCD_WF8B_BPALCD26_MASK 0x1
#define LCD_WF8B_BPALCD26_SHIFT 0
#define LCD_WF8B_BPALCD25_MASK 0x1
#define LCD_WF8B_BPALCD25_SHIFT 0
#define LCD_WF8B_BPALCD24_MASK 0x1
#define LCD_WF8B_BPALCD24_SHIFT 0
#define LCD_WF8B_BPALCD23_MASK 0x1
#define LCD_WF8B_BPALCD23_SHIFT 0
#define LCD_WF8B_BPALCD22_MASK 0x1
#define LCD_WF8B_BPALCD22_SHIFT 0
#define LCD_WF8B_BPALCD6_MASK 0x1
#define LCD_WF8B_BPALCD6_SHIFT 0
#define LCD_WF8B_BPALCD21_MASK 0x1
#define LCD_WF8B_BPALCD21_SHIFT 0
#define LCD_WF8B_BPALCD20_MASK 0x1
#define LCD_WF8B_BPALCD20_SHIFT 0
#define LCD_WF8B_BPALCD19_MASK 0x1
#define LCD_WF8B_BPALCD19_SHIFT 0
#define LCD_WF8B_BPALCD18_MASK 0x1
#define LCD_WF8B_BPALCD18_SHIFT 0
#define LCD_WF8B_BPALCD17_MASK 0x1
#define LCD_WF8B_BPALCD17_SHIFT 0
#define LCD_WF8B_BPALCD16_MASK 0x1
#define LCD_WF8B_BPALCD16_SHIFT 0
#define LCD_WF8B_BPALCD15_MASK 0x1
#define LCD_WF8B_BPALCD15_SHIFT 0
#define LCD_WF8B_BPALCD7_MASK 0x1
#define LCD_WF8B_BPALCD7_SHIFT 0
#define LCD_WF8B_BPALCD14_MASK 0x1
#define LCD_WF8B_BPALCD14_SHIFT 0
#define LCD_WF8B_BPALCD13_MASK 0x1
#define LCD_WF8B_BPALCD13_SHIFT 0
#define LCD_WF8B_BPALCD12_MASK 0x1
#define LCD_WF8B_BPALCD12_SHIFT 0
#define LCD_WF8B_BPALCD11_MASK 0x1
#define LCD_WF8B_BPALCD11_SHIFT 0
#define LCD_WF8B_BPALCD10_MASK 0x1
#define LCD_WF8B_BPALCD10_SHIFT 0
#define LCD_WF8B_BPALCD9_MASK 0x1
#define LCD_WF8B_BPALCD9_SHIFT 0
#define LCD_WF8B_BPALCD8_MASK 0x1
#define LCD_WF8B_BPALCD8_SHIFT 0
#define LCD_WF8B_BPBLCD1_MASK 0x2
#define LCD_WF8B_BPBLCD1_SHIFT 1
#define LCD_WF8B_BPBLCD32_MASK 0x2
#define LCD_WF8B_BPBLCD32_SHIFT 1
#define LCD_WF8B_BPBLCD30_MASK 0x2
#define LCD_WF8B_BPBLCD30_SHIFT 1
#define LCD_WF8B_BPBLCD60_MASK 0x2
#define LCD_WF8B_BPBLCD60_SHIFT 1
#define LCD_WF8B_BPBLCD24_MASK 0x2
#define LCD_WF8B_BPBLCD24_SHIFT 1
#define LCD_WF8B_BPBLCD28_MASK 0x2
#define LCD_WF8B_BPBLCD28_SHIFT 1
#define LCD_WF8B_BPBLCD23_MASK 0x2
#define LCD_WF8B_BPBLCD23_SHIFT 1
#define LCD_WF8B_BPBLCD48_MASK 0x2
#define LCD_WF8B_BPBLCD48_SHIFT 1
#define LCD_WF8B_BPBLCD10_MASK 0x2
#define LCD_WF8B_BPBLCD10_SHIFT 1
#define LCD_WF8B_BPBLCD15_MASK 0x2
#define LCD_WF8B_BPBLCD15_SHIFT 1
#define LCD_WF8B_BPBLCD36_MASK 0x2
#define LCD_WF8B_BPBLCD36_SHIFT 1
#define LCD_WF8B_BPBLCD44_MASK 0x2
#define LCD_WF8B_BPBLCD44_SHIFT 1
#define LCD_WF8B_BPBLCD62_MASK 0x2
#define LCD_WF8B_BPBLCD62_SHIFT 1
#define LCD_WF8B_BPBLCD53_MASK 0x2
#define LCD_WF8B_BPBLCD53_SHIFT 1
#define LCD_WF8B_BPBLCD22_MASK 0x2
#define LCD_WF8B_BPBLCD22_SHIFT 1
#define LCD_WF8B_BPBLCD47_MASK 0x2
#define LCD_WF8B_BPBLCD47_SHIFT 1
#define LCD_WF8B_BPBLCD33_MASK 0x2
#define LCD_WF8B_BPBLCD33_SHIFT 1
#define LCD_WF8B_BPBLCD2_MASK 0x2
#define LCD_WF8B_BPBLCD2_SHIFT 1
#define LCD_WF8B_BPBLCD49_MASK 0x2
#define LCD_WF8B_BPBLCD49_SHIFT 1
#define LCD_WF8B_BPBLCD0_MASK 0x2
#define LCD_WF8B_BPBLCD0_SHIFT 1
#define LCD_WF8B_BPBLCD55_MASK 0x2
#define LCD_WF8B_BPBLCD55_SHIFT 1
#define LCD_WF8B_BPBLCD56_MASK 0x2
#define LCD_WF8B_BPBLCD56_SHIFT 1
#define LCD_WF8B_BPBLCD21_MASK 0x2
#define LCD_WF8B_BPBLCD21_SHIFT 1
#define LCD_WF8B_BPBLCD6_MASK 0x2
#define LCD_WF8B_BPBLCD6_SHIFT 1
#define LCD_WF8B_BPBLCD29_MASK 0x2
#define LCD_WF8B_BPBLCD29_SHIFT 1
#define LCD_WF8B_BPBLCD25_MASK 0x2
#define LCD_WF8B_BPBLCD25_SHIFT 1
#define LCD_WF8B_BPBLCD8_MASK 0x2
#define LCD_WF8B_BPBLCD8_SHIFT 1
#define LCD_WF8B_BPBLCD54_MASK 0x2
#define LCD_WF8B_BPBLCD54_SHIFT 1
#define LCD_WF8B_BPBLCD38_MASK 0x2
#define LCD_WF8B_BPBLCD38_SHIFT 1
#define LCD_WF8B_BPBLCD43_MASK 0x2
#define LCD_WF8B_BPBLCD43_SHIFT 1
#define LCD_WF8B_BPBLCD20_MASK 0x2
#define LCD_WF8B_BPBLCD20_SHIFT 1
#define LCD_WF8B_BPBLCD9_MASK 0x2
#define LCD_WF8B_BPBLCD9_SHIFT 1
#define LCD_WF8B_BPBLCD7_MASK 0x2
#define LCD_WF8B_BPBLCD7_SHIFT 1
#define LCD_WF8B_BPBLCD50_MASK 0x2
#define LCD_WF8B_BPBLCD50_SHIFT 1
#define LCD_WF8B_BPBLCD40_MASK 0x2
#define LCD_WF8B_BPBLCD40_SHIFT 1
#define LCD_WF8B_BPBLCD63_MASK 0x2
#define LCD_WF8B_BPBLCD63_SHIFT 1
#define LCD_WF8B_BPBLCD26_MASK 0x2
#define LCD_WF8B_BPBLCD26_SHIFT 1
#define LCD_WF8B_BPBLCD12_MASK 0x2
#define LCD_WF8B_BPBLCD12_SHIFT 1
#define LCD_WF8B_BPBLCD19_MASK 0x2
#define LCD_WF8B_BPBLCD19_SHIFT 1
#define LCD_WF8B_BPBLCD34_MASK 0x2
#define LCD_WF8B_BPBLCD34_SHIFT 1
#define LCD_WF8B_BPBLCD39_MASK 0x2
#define LCD_WF8B_BPBLCD39_SHIFT 1
#define LCD_WF8B_BPBLCD59_MASK 0x2
#define LCD_WF8B_BPBLCD59_SHIFT 1
#define LCD_WF8B_BPBLCD61_MASK 0x2
#define LCD_WF8B_BPBLCD61_SHIFT 1
#define LCD_WF8B_BPBLCD37_MASK 0x2
#define LCD_WF8B_BPBLCD37_SHIFT 1
#define LCD_WF8B_BPBLCD31_MASK 0x2
#define LCD_WF8B_BPBLCD31_SHIFT 1
#define LCD_WF8B_BPBLCD58_MASK 0x2
#define LCD_WF8B_BPBLCD58_SHIFT 1
#define LCD_WF8B_BPBLCD18_MASK 0x2
#define LCD_WF8B_BPBLCD18_SHIFT 1
#define LCD_WF8B_BPBLCD45_MASK 0x2
#define LCD_WF8B_BPBLCD45_SHIFT 1
#define LCD_WF8B_BPBLCD27_MASK 0x2
#define LCD_WF8B_BPBLCD27_SHIFT 1
#define LCD_WF8B_BPBLCD14_MASK 0x2
#define LCD_WF8B_BPBLCD14_SHIFT 1
#define LCD_WF8B_BPBLCD51_MASK 0x2
#define LCD_WF8B_BPBLCD51_SHIFT 1
#define LCD_WF8B_BPBLCD52_MASK 0x2
#define LCD_WF8B_BPBLCD52_SHIFT 1
#define LCD_WF8B_BPBLCD4_MASK 0x2
#define LCD_WF8B_BPBLCD4_SHIFT 1
#define LCD_WF8B_BPBLCD35_MASK 0x2
#define LCD_WF8B_BPBLCD35_SHIFT 1
#define LCD_WF8B_BPBLCD17_MASK 0x2
#define LCD_WF8B_BPBLCD17_SHIFT 1
#define LCD_WF8B_BPBLCD41_MASK 0x2
#define LCD_WF8B_BPBLCD41_SHIFT 1
#define LCD_WF8B_BPBLCD11_MASK 0x2
#define LCD_WF8B_BPBLCD11_SHIFT 1
#define LCD_WF8B_BPBLCD46_MASK 0x2
#define LCD_WF8B_BPBLCD46_SHIFT 1
#define LCD_WF8B_BPBLCD57_MASK 0x2
#define LCD_WF8B_BPBLCD57_SHIFT 1
#define LCD_WF8B_BPBLCD42_MASK 0x2
#define LCD_WF8B_BPBLCD42_SHIFT 1
#define LCD_WF8B_BPBLCD5_MASK 0x2
#define LCD_WF8B_BPBLCD5_SHIFT 1
#define LCD_WF8B_BPBLCD3_MASK 0x2
#define LCD_WF8B_BPBLCD3_SHIFT 1
#define LCD_WF8B_BPBLCD16_MASK 0x2
#define LCD_WF8B_BPBLCD16_SHIFT 1
#define LCD_WF8B_BPBLCD13_MASK 0x2
#define LCD_WF8B_BPBLCD13_SHIFT 1
#define LCD_WF8B_BPCLCD10_MASK 0x4
#define LCD_WF8B_BPCLCD10_SHIFT 2
#define LCD_WF8B_BPCLCD55_MASK 0x4
#define LCD_WF8B_BPCLCD55_SHIFT 2
#define LCD_WF8B_BPCLCD2_MASK 0x4
#define LCD_WF8B_BPCLCD2_SHIFT 2
#define LCD_WF8B_BPCLCD23_MASK 0x4
#define LCD_WF8B_BPCLCD23_SHIFT 2
#define LCD_WF8B_BPCLCD48_MASK 0x4
#define LCD_WF8B_BPCLCD48_SHIFT 2
#define LCD_WF8B_BPCLCD24_MASK 0x4
#define LCD_WF8B_BPCLCD24_SHIFT 2
#define LCD_WF8B_BPCLCD60_MASK 0x4
#define LCD_WF8B_BPCLCD60_SHIFT 2
#define LCD_WF8B_BPCLCD47_MASK 0x4
#define LCD_WF8B_BPCLCD47_SHIFT 2
#define LCD_WF8B_BPCLCD22_MASK 0x4
#define LCD_WF8B_BPCLCD22_SHIFT 2
#define LCD_WF8B_BPCLCD8_MASK 0x4
#define LCD_WF8B_BPCLCD8_SHIFT 2
#define LCD_WF8B_BPCLCD21_MASK 0x4
#define LCD_WF8B_BPCLCD21_SHIFT 2
#define LCD_WF8B_BPCLCD49_MASK 0x4
#define LCD_WF8B_BPCLCD49_SHIFT 2
#define LCD_WF8B_BPCLCD25_MASK 0x4
#define LCD_WF8B_BPCLCD25_SHIFT 2
#define LCD_WF8B_BPCLCD1_MASK 0x4
#define LCD_WF8B_BPCLCD1_SHIFT 2
#define LCD_WF8B_BPCLCD20_MASK 0x4
#define LCD_WF8B_BPCLCD20_SHIFT 2
#define LCD_WF8B_BPCLCD50_MASK 0x4
#define LCD_WF8B_BPCLCD50_SHIFT 2
#define LCD_WF8B_BPCLCD19_MASK 0x4
#define LCD_WF8B_BPCLCD19_SHIFT 2
#define LCD_WF8B_BPCLCD26_MASK 0x4
#define LCD_WF8B_BPCLCD26_SHIFT 2
#define LCD_WF8B_BPCLCD59_MASK 0x4
#define LCD_WF8B_BPCLCD59_SHIFT 2
#define LCD_WF8B_BPCLCD61_MASK 0x4
#define LCD_WF8B_BPCLCD61_SHIFT 2
#define LCD_WF8B_BPCLCD46_MASK 0x4
#define LCD_WF8B_BPCLCD46_SHIFT 2
#define LCD_WF8B_BPCLCD18_MASK 0x4
#define LCD_WF8B_BPCLCD18_SHIFT 2
#define LCD_WF8B_BPCLCD5_MASK 0x4
#define LCD_WF8B_BPCLCD5_SHIFT 2
#define LCD_WF8B_BPCLCD63_MASK 0x4
#define LCD_WF8B_BPCLCD63_SHIFT 2
#define LCD_WF8B_BPCLCD27_MASK 0x4
#define LCD_WF8B_BPCLCD27_SHIFT 2
#define LCD_WF8B_BPCLCD17_MASK 0x4
#define LCD_WF8B_BPCLCD17_SHIFT 2
#define LCD_WF8B_BPCLCD51_MASK 0x4
#define LCD_WF8B_BPCLCD51_SHIFT 2
#define LCD_WF8B_BPCLCD9_MASK 0x4
#define LCD_WF8B_BPCLCD9_SHIFT 2
#define LCD_WF8B_BPCLCD54_MASK 0x4
#define LCD_WF8B_BPCLCD54_SHIFT 2
#define LCD_WF8B_BPCLCD15_MASK 0x4
#define LCD_WF8B_BPCLCD15_SHIFT 2
#define LCD_WF8B_BPCLCD16_MASK 0x4
#define LCD_WF8B_BPCLCD16_SHIFT 2
#define LCD_WF8B_BPCLCD14_MASK 0x4
#define LCD_WF8B_BPCLCD14_SHIFT 2
#define LCD_WF8B_BPCLCD32_MASK 0x4
#define LCD_WF8B_BPCLCD32_SHIFT 2
#define LCD_WF8B_BPCLCD28_MASK 0x4
#define LCD_WF8B_BPCLCD28_SHIFT 2
#define LCD_WF8B_BPCLCD53_MASK 0x4
#define LCD_WF8B_BPCLCD53_SHIFT 2
#define LCD_WF8B_BPCLCD33_MASK 0x4
#define LCD_WF8B_BPCLCD33_SHIFT 2
#define LCD_WF8B_BPCLCD0_MASK 0x4
#define LCD_WF8B_BPCLCD0_SHIFT 2
#define LCD_WF8B_BPCLCD43_MASK 0x4
#define LCD_WF8B_BPCLCD43_SHIFT 2
#define LCD_WF8B_BPCLCD7_MASK 0x4
#define LCD_WF8B_BPCLCD7_SHIFT 2
#define LCD_WF8B_BPCLCD4_MASK 0x4
#define LCD_WF8B_BPCLCD4_SHIFT 2
#define LCD_WF8B_BPCLCD34_MASK 0x4
#define LCD_WF8B_BPCLCD34_SHIFT 2
#define LCD_WF8B_BPCLCD29_MASK 0x4
#define LCD_WF8B_BPCLCD29_SHIFT 2
#define LCD_WF8B_BPCLCD45_MASK 0x4
#define LCD_WF8B_BPCLCD45_SHIFT 2
#define LCD_WF8B_BPCLCD57_MASK 0x4
#define LCD_WF8B_BPCLCD57_SHIFT 2
#define LCD_WF8B_BPCLCD42_MASK 0x4
#define LCD_WF8B_BPCLCD42_SHIFT 2
#define LCD_WF8B_BPCLCD35_MASK 0x4
#define LCD_WF8B_BPCLCD35_SHIFT 2
#define LCD_WF8B_BPCLCD13_MASK 0x4
#define LCD_WF8B_BPCLCD13_SHIFT 2
#define LCD_WF8B_BPCLCD36_MASK 0x4
#define LCD_WF8B_BPCLCD36_SHIFT 2
#define LCD_WF8B_BPCLCD30_MASK 0x4
#define LCD_WF8B_BPCLCD30_SHIFT 2
#define LCD_WF8B_BPCLCD52_MASK 0x4
#define LCD_WF8B_BPCLCD52_SHIFT 2
#define LCD_WF8B_BPCLCD58_MASK 0x4
#define LCD_WF8B_BPCLCD58_SHIFT 2
#define LCD_WF8B_BPCLCD41_MASK 0x4
#define LCD_WF8B_BPCLCD41_SHIFT 2
#define LCD_WF8B_BPCLCD37_MASK 0x4
#define LCD_WF8B_BPCLCD37_SHIFT 2
#define LCD_WF8B_BPCLCD3_MASK 0x4
#define LCD_WF8B_BPCLCD3_SHIFT 2
#define LCD_WF8B_BPCLCD12_MASK 0x4
#define LCD_WF8B_BPCLCD12_SHIFT 2
#define LCD_WF8B_BPCLCD11_MASK 0x4
#define LCD_WF8B_BPCLCD11_SHIFT 2
#define LCD_WF8B_BPCLCD38_MASK 0x4
#define LCD_WF8B_BPCLCD38_SHIFT 2
#define LCD_WF8B_BPCLCD44_MASK 0x4
#define LCD_WF8B_BPCLCD44_SHIFT 2
#define LCD_WF8B_BPCLCD31_MASK 0x4
#define LCD_WF8B_BPCLCD31_SHIFT 2
#define LCD_WF8B_BPCLCD40_MASK 0x4
#define LCD_WF8B_BPCLCD40_SHIFT 2
#define LCD_WF8B_BPCLCD62_MASK 0x4
#define LCD_WF8B_BPCLCD62_SHIFT 2
#define LCD_WF8B_BPCLCD56_MASK 0x4
#define LCD_WF8B_BPCLCD56_SHIFT 2
#define LCD_WF8B_BPCLCD39_MASK 0x4
#define LCD_WF8B_BPCLCD39_SHIFT 2
#define LCD_WF8B_BPCLCD6_MASK 0x4
#define LCD_WF8B_BPCLCD6_SHIFT 2
#define LCD_WF8B_BPDLCD47_MASK 0x8
#define LCD_WF8B_BPDLCD47_SHIFT 3
#define LCD_WF8B_BPDLCD23_MASK 0x8
#define LCD_WF8B_BPDLCD23_SHIFT 3
#define LCD_WF8B_BPDLCD48_MASK 0x8
#define LCD_WF8B_BPDLCD48_SHIFT 3
#define LCD_WF8B_BPDLCD24_MASK 0x8
#define LCD_WF8B_BPDLCD24_SHIFT 3
#define LCD_WF8B_BPDLCD15_MASK 0x8
#define LCD_WF8B_BPDLCD15_SHIFT 3
#define LCD_WF8B_BPDLCD22_MASK 0x8
#define LCD_WF8B_BPDLCD22_SHIFT 3
#define LCD_WF8B_BPDLCD60_MASK 0x8
#define LCD_WF8B_BPDLCD60_SHIFT 3
#define LCD_WF8B_BPDLCD10_MASK 0x8
#define LCD_WF8B_BPDLCD10_SHIFT 3
#define LCD_WF8B_BPDLCD21_MASK 0x8
#define LCD_WF8B_BPDLCD21_SHIFT 3
#define LCD_WF8B_BPDLCD49_MASK 0x8
#define LCD_WF8B_BPDLCD49_SHIFT 3
#define LCD_WF8B_BPDLCD1_MASK 0x8
#define LCD_WF8B_BPDLCD1_SHIFT 3
#define LCD_WF8B_BPDLCD25_MASK 0x8
#define LCD_WF8B_BPDLCD25_SHIFT 3
#define LCD_WF8B_BPDLCD20_MASK 0x8
#define LCD_WF8B_BPDLCD20_SHIFT 3
#define LCD_WF8B_BPDLCD2_MASK 0x8
#define LCD_WF8B_BPDLCD2_SHIFT 3
#define LCD_WF8B_BPDLCD55_MASK 0x8
#define LCD_WF8B_BPDLCD55_SHIFT 3
#define LCD_WF8B_BPDLCD59_MASK 0x8
#define LCD_WF8B_BPDLCD59_SHIFT 3
#define LCD_WF8B_BPDLCD5_MASK 0x8
#define LCD_WF8B_BPDLCD5_SHIFT 3
#define LCD_WF8B_BPDLCD19_MASK 0x8
#define LCD_WF8B_BPDLCD19_SHIFT 3
#define LCD_WF8B_BPDLCD6_MASK 0x8
#define LCD_WF8B_BPDLCD6_SHIFT 3
#define LCD_WF8B_BPDLCD26_MASK 0x8
#define LCD_WF8B_BPDLCD26_SHIFT 3
#define LCD_WF8B_BPDLCD0_MASK 0x8
#define LCD_WF8B_BPDLCD0_SHIFT 3
#define LCD_WF8B_BPDLCD50_MASK 0x8
#define LCD_WF8B_BPDLCD50_SHIFT 3
#define LCD_WF8B_BPDLCD46_MASK 0x8
#define LCD_WF8B_BPDLCD46_SHIFT 3
#define LCD_WF8B_BPDLCD18_MASK 0x8
#define LCD_WF8B_BPDLCD18_SHIFT 3
#define LCD_WF8B_BPDLCD61_MASK 0x8
#define LCD_WF8B_BPDLCD61_SHIFT 3
#define LCD_WF8B_BPDLCD9_MASK 0x8
#define LCD_WF8B_BPDLCD9_SHIFT 3
#define LCD_WF8B_BPDLCD17_MASK 0x8
#define LCD_WF8B_BPDLCD17_SHIFT 3
#define LCD_WF8B_BPDLCD27_MASK 0x8
#define LCD_WF8B_BPDLCD27_SHIFT 3
#define LCD_WF8B_BPDLCD53_MASK 0x8
#define LCD_WF8B_BPDLCD53_SHIFT 3
#define LCD_WF8B_BPDLCD51_MASK 0x8
#define LCD_WF8B_BPDLCD51_SHIFT 3
#define LCD_WF8B_BPDLCD54_MASK 0x8
#define LCD_WF8B_BPDLCD54_SHIFT 3
#define LCD_WF8B_BPDLCD13_MASK 0x8
#define LCD_WF8B_BPDLCD13_SHIFT 3
#define LCD_WF8B_BPDLCD16_MASK 0x8
#define LCD_WF8B_BPDLCD16_SHIFT 3
#define LCD_WF8B_BPDLCD32_MASK 0x8
#define LCD_WF8B_BPDLCD32_SHIFT 3
#define LCD_WF8B_BPDLCD14_MASK 0x8
#define LCD_WF8B_BPDLCD14_SHIFT 3
#define LCD_WF8B_BPDLCD28_MASK 0x8
#define LCD_WF8B_BPDLCD28_SHIFT 3
#define LCD_WF8B_BPDLCD43_MASK 0x8
#define LCD_WF8B_BPDLCD43_SHIFT 3
#define LCD_WF8B_BPDLCD4_MASK 0x8
#define LCD_WF8B_BPDLCD4_SHIFT 3
#define LCD_WF8B_BPDLCD45_MASK 0x8
#define LCD_WF8B_BPDLCD45_SHIFT 3
#define LCD_WF8B_BPDLCD8_MASK 0x8
#define LCD_WF8B_BPDLCD8_SHIFT 3
#define LCD_WF8B_BPDLCD62_MASK 0x8
#define LCD_WF8B_BPDLCD62_SHIFT 3
#define LCD_WF8B_BPDLCD33_MASK 0x8
#define LCD_WF8B_BPDLCD33_SHIFT 3
#define LCD_WF8B_BPDLCD34_MASK 0x8
#define LCD_WF8B_BPDLCD34_SHIFT 3
#define LCD_WF8B_BPDLCD29_MASK 0x8
#define LCD_WF8B_BPDLCD29_SHIFT 3
#define LCD_WF8B_BPDLCD58_MASK 0x8
#define LCD_WF8B_BPDLCD58_SHIFT 3
#define LCD_WF8B_BPDLCD57_MASK 0x8
#define LCD_WF8B_BPDLCD57_SHIFT 3
#define LCD_WF8B_BPDLCD42_MASK 0x8
#define LCD_WF8B_BPDLCD42_SHIFT 3
#define LCD_WF8B_BPDLCD35_MASK 0x8
#define LCD_WF8B_BPDLCD35_SHIFT 3
#define LCD_WF8B_BPDLCD52_MASK 0x8
#define LCD_WF8B_BPDLCD52_SHIFT 3
#define LCD_WF8B_BPDLCD7_MASK 0x8
#define LCD_WF8B_BPDLCD7_SHIFT 3
#define LCD_WF8B_BPDLCD36_MASK 0x8
#define LCD_WF8B_BPDLCD36_SHIFT 3
#define LCD_WF8B_BPDLCD30_MASK 0x8
#define LCD_WF8B_BPDLCD30_SHIFT 3
