PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#define LCD_WF8B_BPDLCD41_MASK 0x8
#define LCD_WF8B_BPDLCD41_SHIFT 3
#define LCD_WF8B_BPDLCD37_MASK 0x8
#define LCD_WF8B_BPDLCD37_SHIFT 3
#define LCD_WF8B_BPDLCD44_MASK 0x8
#define LCD_WF8B_BPDLCD44_SHIFT 3
#define LCD_WF8B_BPDLCD63_MASK 0x8
#define LCD_WF8B_BPDLCD63_SHIFT 3
#define LCD_WF8B_BPDLCD38_MASK 0x8
#define LCD_WF8B_BPDLCD38_SHIFT 3
#define LCD_WF8B_BPDLCD56_MASK 0x8
#define LCD_WF8B_BPDLCD56_SHIFT 3
#define LCD_WF8B_BPDLCD40_MASK 0x8
#define LCD_WF8B_BPDLCD40_SHIFT 3
#define LCD_WF8B_BPDLCD31_MASK 0x8
#define LCD_WF8B_BPDLCD31_SHIFT 3
#define LCD_WF8B_BPDLCD12_MASK 0x8
#define LCD_WF8B_BPDLCD12_SHIFT 3
#define LCD_WF8B_BPDLCD39_MASK 0x8
#define LCD_WF8B_BPDLCD39_SHIFT 3
#define LCD_WF8B_BPDLCD3_MASK 0x8
#define LCD_WF8B_BPDLCD3_SHIFT 3
#define LCD_WF8B_BPDLCD11_MASK 0x8
#define LCD_WF8B_BPDLCD11_SHIFT 3
#define LCD_WF8B_BPELCD12_MASK 0x10
#define LCD_WF8B_BPELCD12_SHIFT 4
#define LCD_WF8B_BPELCD39_MASK 0x10
#define LCD_WF8B_BPELCD39_SHIFT 4
#define LCD_WF8B_BPELCD3_MASK 0x10
#define LCD_WF8B_BPELCD3_SHIFT 4
#define LCD_WF8B_BPELCD38_MASK 0x10
#define LCD_WF8B_BPELCD38_SHIFT 4
#define LCD_WF8B_BPELCD40_MASK 0x10
#define LCD_WF8B_BPELCD40_SHIFT 4
#define LCD_WF8B_BPELCD37_MASK 0x10
#define LCD_WF8B_BPELCD37_SHIFT 4
#define LCD_WF8B_BPELCD41_MASK 0x10
#define LCD_WF8B_BPELCD41_SHIFT 4
#define LCD_WF8B_BPELCD36_MASK 0x10
#define LCD_WF8B_BPELCD36_SHIFT 4
#define LCD_WF8B_BPELCD8_MASK 0x10
#define LCD_WF8B_BPELCD8_SHIFT 4
#define LCD_WF8B_BPELCD35_MASK 0x10
#define LCD_WF8B_BPELCD35_SHIFT 4
#define LCD_WF8B_BPELCD42_MASK 0x10
#define LCD_WF8B_BPELCD42_SHIFT 4
#define LCD_WF8B_BPELCD34_MASK 0x10
#define LCD_WF8B_BPELCD34_SHIFT 4
#define LCD_WF8B_BPELCD33_MASK 0x10
#define LCD_WF8B_BPELCD33_SHIFT 4
#define LCD_WF8B_BPELCD11_MASK 0x10
#define LCD_WF8B_BPELCD11_SHIFT 4
#define LCD_WF8B_BPELCD43_MASK 0x10
#define LCD_WF8B_BPELCD43_SHIFT 4
#define LCD_WF8B_BPELCD32_MASK 0x10
#define LCD_WF8B_BPELCD32_SHIFT 4
#define LCD_WF8B_BPELCD31_MASK 0x10
#define LCD_WF8B_BPELCD31_SHIFT 4
#define LCD_WF8B_BPELCD44_MASK 0x10
#define LCD_WF8B_BPELCD44_SHIFT 4
#define LCD_WF8B_BPELCD30_MASK 0x10
#define LCD_WF8B_BPELCD30_SHIFT 4
#define LCD_WF8B_BPELCD29_MASK 0x10
#define LCD_WF8B_BPELCD29_SHIFT 4
#define LCD_WF8B_BPELCD7_MASK 0x10
#define LCD_WF8B_BPELCD7_SHIFT 4
#define LCD_WF8B_BPELCD45_MASK 0x10
#define LCD_WF8B_BPELCD45_SHIFT 4
#define LCD_WF8B_BPELCD28_MASK 0x10
#define LCD_WF8B_BPELCD28_SHIFT 4
#define LCD_WF8B_BPELCD2_MASK 0x10
#define LCD_WF8B_BPELCD2_SHIFT 4
#define LCD_WF8B_BPELCD27_MASK 0x10
#define LCD_WF8B_BPELCD27_SHIFT 4
#define LCD_WF8B_BPELCD46_MASK 0x10
#define LCD_WF8B_BPELCD46_SHIFT 4
#define LCD_WF8B_BPELCD26_MASK 0x10
#define LCD_WF8B_BPELCD26_SHIFT 4
#define LCD_WF8B_BPELCD10_MASK 0x10
#define LCD_WF8B_BPELCD10_SHIFT 4
#define LCD_WF8B_BPELCD13_MASK 0x10
#define LCD_WF8B_BPELCD13_SHIFT 4
#define LCD_WF8B_BPELCD25_MASK 0x10
#define LCD_WF8B_BPELCD25_SHIFT 4
#define LCD_WF8B_BPELCD5_MASK 0x10
#define LCD_WF8B_BPELCD5_SHIFT 4
#define LCD_WF8B_BPELCD24_MASK 0x10
#define LCD_WF8B_BPELCD24_SHIFT 4
#define LCD_WF8B_BPELCD47_MASK 0x10
#define LCD_WF8B_BPELCD47_SHIFT 4
#define LCD_WF8B_BPELCD23_MASK 0x10
#define LCD_WF8B_BPELCD23_SHIFT 4
#define LCD_WF8B_BPELCD22_MASK 0x10
#define LCD_WF8B_BPELCD22_SHIFT 4
#define LCD_WF8B_BPELCD48_MASK 0x10
#define LCD_WF8B_BPELCD48_SHIFT 4
#define LCD_WF8B_BPELCD21_MASK 0x10
#define LCD_WF8B_BPELCD21_SHIFT 4
#define LCD_WF8B_BPELCD49_MASK 0x10
#define LCD_WF8B_BPELCD49_SHIFT 4
#define LCD_WF8B_BPELCD20_MASK 0x10
#define LCD_WF8B_BPELCD20_SHIFT 4
#define LCD_WF8B_BPELCD19_MASK 0x10
#define LCD_WF8B_BPELCD19_SHIFT 4
#define LCD_WF8B_BPELCD9_MASK 0x10
#define LCD_WF8B_BPELCD9_SHIFT 4
#define LCD_WF8B_BPELCD50_MASK 0x10
#define LCD_WF8B_BPELCD50_SHIFT 4
#define LCD_WF8B_BPELCD18_MASK 0x10
#define LCD_WF8B_BPELCD18_SHIFT 4
#define LCD_WF8B_BPELCD6_MASK 0x10
#define LCD_WF8B_BPELCD6_SHIFT 4
#define LCD_WF8B_BPELCD17_MASK 0x10
#define LCD_WF8B_BPELCD17_SHIFT 4
#define LCD_WF8B_BPELCD51_MASK 0x10
#define LCD_WF8B_BPELCD51_SHIFT 4
#define LCD_WF8B_BPELCD16_MASK 0x10
#define LCD_WF8B_BPELCD16_SHIFT 4
#define LCD_WF8B_BPELCD56_MASK 0x10
#define LCD_WF8B_BPELCD56_SHIFT 4
#define LCD_WF8B_BPELCD57_MASK 0x10
#define LCD_WF8B_BPELCD57_SHIFT 4
#define LCD_WF8B_BPELCD52_MASK 0x10
#define LCD_WF8B_BPELCD52_SHIFT 4
#define LCD_WF8B_BPELCD1_MASK 0x10
#define LCD_WF8B_BPELCD1_SHIFT 4
#define LCD_WF8B_BPELCD58_MASK 0x10
#define LCD_WF8B_BPELCD58_SHIFT 4
#define LCD_WF8B_BPELCD59_MASK 0x10
#define LCD_WF8B_BPELCD59_SHIFT 4
#define LCD_WF8B_BPELCD53_MASK 0x10
#define LCD_WF8B_BPELCD53_SHIFT 4
#define LCD_WF8B_BPELCD14_MASK 0x10
#define LCD_WF8B_BPELCD14_SHIFT 4
#define LCD_WF8B_BPELCD0_MASK 0x10
#define LCD_WF8B_BPELCD0_SHIFT 4
#define LCD_WF8B_BPELCD60_MASK 0x10
#define LCD_WF8B_BPELCD60_SHIFT 4
#define LCD_WF8B_BPELCD15_MASK 0x10
#define LCD_WF8B_BPELCD15_SHIFT 4
#define LCD_WF8B_BPELCD61_MASK 0x10
#define LCD_WF8B_BPELCD61_SHIFT 4
#define LCD_WF8B_BPELCD54_MASK 0x10
#define LCD_WF8B_BPELCD54_SHIFT 4
#define LCD_WF8B_BPELCD62_MASK 0x10
#define LCD_WF8B_BPELCD62_SHIFT 4
#define LCD_WF8B_BPELCD63_MASK 0x10
#define LCD_WF8B_BPELCD63_SHIFT 4
#define LCD_WF8B_BPELCD55_MASK 0x10
#define LCD_WF8B_BPELCD55_SHIFT 4
#define LCD_WF8B_BPELCD4_MASK 0x10
#define LCD_WF8B_BPELCD4_SHIFT 4
#define LCD_WF8B_BPFLCD13_MASK 0x20
#define LCD_WF8B_BPFLCD13_SHIFT 5
#define LCD_WF8B_BPFLCD39_MASK 0x20
#define LCD_WF8B_BPFLCD39_SHIFT 5
#define LCD_WF8B_BPFLCD55_MASK 0x20
#define LCD_WF8B_BPFLCD55_SHIFT 5
#define LCD_WF8B_BPFLCD47_MASK 0x20
#define LCD_WF8B_BPFLCD47_SHIFT 5
#define LCD_WF8B_BPFLCD63_MASK 0x20
#define LCD_WF8B_BPFLCD63_SHIFT 5
#define LCD_WF8B_BPFLCD43_MASK 0x20
#define LCD_WF8B_BPFLCD43_SHIFT 5
#define LCD_WF8B_BPFLCD5_MASK 0x20
#define LCD_WF8B_BPFLCD5_SHIFT 5
#define LCD_WF8B_BPFLCD62_MASK 0x20
#define LCD_WF8B_BPFLCD62_SHIFT 5
#define LCD_WF8B_BPFLCD14_MASK 0x20
#define LCD_WF8B_BPFLCD14_SHIFT 5
#define LCD_WF8B_BPFLCD24_MASK 0x20
#define LCD_WF8B_BPFLCD24_SHIFT 5
#define LCD_WF8B_BPFLCD54_MASK 0x20
#define LCD_WF8B_BPFLCD54_SHIFT 5
#define LCD_WF8B_BPFLCD15_MASK 0x20
#define LCD_WF8B_BPFLCD15_SHIFT 5
#define LCD_WF8B_BPFLCD32_MASK 0x20
#define LCD_WF8B_BPFLCD32_SHIFT 5
#define LCD_WF8B_BPFLCD61_MASK 0x20
#define LCD_WF8B_BPFLCD61_SHIFT 5
#define LCD_WF8B_BPFLCD25_MASK 0x20
#define LCD_WF8B_BPFLCD25_SHIFT 5
#define LCD_WF8B_BPFLCD60_MASK 0x20
#define LCD_WF8B_BPFLCD60_SHIFT 5
#define LCD_WF8B_BPFLCD41_MASK 0x20
#define LCD_WF8B_BPFLCD41_SHIFT 5
#define LCD_WF8B_BPFLCD33_MASK 0x20
#define LCD_WF8B_BPFLCD33_SHIFT 5
#define LCD_WF8B_BPFLCD53_MASK 0x20
#define LCD_WF8B_BPFLCD53_SHIFT 5
#define LCD_WF8B_BPFLCD59_MASK 0x20
#define LCD_WF8B_BPFLCD59_SHIFT 5
#define LCD_WF8B_BPFLCD0_MASK 0x20
#define LCD_WF8B_BPFLCD0_SHIFT 5
#define LCD_WF8B_BPFLCD46_MASK 0x20
#define LCD_WF8B_BPFLCD46_SHIFT 5
#define LCD_WF8B_BPFLCD58_MASK 0x20
#define LCD_WF8B_BPFLCD58_SHIFT 5
#define LCD_WF8B_BPFLCD26_MASK 0x20
#define LCD_WF8B_BPFLCD26_SHIFT 5
#define LCD_WF8B_BPFLCD36_MASK 0x20
#define LCD_WF8B_BPFLCD36_SHIFT 5
#define LCD_WF8B_BPFLCD10_MASK 0x20
#define LCD_WF8B_BPFLCD10_SHIFT 5
#define LCD_WF8B_BPFLCD52_MASK 0x20
#define LCD_WF8B_BPFLCD52_SHIFT 5
#define LCD_WF8B_BPFLCD57_MASK 0x20
#define LCD_WF8B_BPFLCD57_SHIFT 5
#define LCD_WF8B_BPFLCD27_MASK 0x20
#define LCD_WF8B_BPFLCD27_SHIFT 5
#define LCD_WF8B_BPFLCD11_MASK 0x20
#define LCD_WF8B_BPFLCD11_SHIFT 5
#define LCD_WF8B_BPFLCD56_MASK 0x20
#define LCD_WF8B_BPFLCD56_SHIFT 5
#define LCD_WF8B_BPFLCD1_MASK 0x20
#define LCD_WF8B_BPFLCD1_SHIFT 5
#define LCD_WF8B_BPFLCD8_MASK 0x20
#define LCD_WF8B_BPFLCD8_SHIFT 5
#define LCD_WF8B_BPFLCD40_MASK 0x20
#define LCD_WF8B_BPFLCD40_SHIFT 5
#define LCD_WF8B_BPFLCD51_MASK 0x20
#define LCD_WF8B_BPFLCD51_SHIFT 5
#define LCD_WF8B_BPFLCD16_MASK 0x20
#define LCD_WF8B_BPFLCD16_SHIFT 5
#define LCD_WF8B_BPFLCD45_MASK 0x20
#define LCD_WF8B_BPFLCD45_SHIFT 5
#define LCD_WF8B_BPFLCD6_MASK 0x20
#define LCD_WF8B_BPFLCD6_SHIFT 5
#define LCD_WF8B_BPFLCD17_MASK 0x20
#define LCD_WF8B_BPFLCD17_SHIFT 5
#define LCD_WF8B_BPFLCD28_MASK 0x20
#define LCD_WF8B_BPFLCD28_SHIFT 5
#define LCD_WF8B_BPFLCD42_MASK 0x20
#define LCD_WF8B_BPFLCD42_SHIFT 5
#define LCD_WF8B_BPFLCD29_MASK 0x20
#define LCD_WF8B_BPFLCD29_SHIFT 5
#define LCD_WF8B_BPFLCD50_MASK 0x20
#define LCD_WF8B_BPFLCD50_SHIFT 5
#define LCD_WF8B_BPFLCD18_MASK 0x20
#define LCD_WF8B_BPFLCD18_SHIFT 5
#define LCD_WF8B_BPFLCD34_MASK 0x20
#define LCD_WF8B_BPFLCD34_SHIFT 5
#define LCD_WF8B_BPFLCD19_MASK 0x20
#define LCD_WF8B_BPFLCD19_SHIFT 5
#define LCD_WF8B_BPFLCD2_MASK 0x20
#define LCD_WF8B_BPFLCD2_SHIFT 5
#define LCD_WF8B_BPFLCD9_MASK 0x20
#define LCD_WF8B_BPFLCD9_SHIFT 5
#define LCD_WF8B_BPFLCD3_MASK 0x20
#define LCD_WF8B_BPFLCD3_SHIFT 5
#define LCD_WF8B_BPFLCD37_MASK 0x20
#define LCD_WF8B_BPFLCD37_SHIFT 5
#define LCD_WF8B_BPFLCD49_MASK 0x20
#define LCD_WF8B_BPFLCD49_SHIFT 5
#define LCD_WF8B_BPFLCD20_MASK 0x20
#define LCD_WF8B_BPFLCD20_SHIFT 5
#define LCD_WF8B_BPFLCD44_MASK 0x20
#define LCD_WF8B_BPFLCD44_SHIFT 5
#define LCD_WF8B_BPFLCD30_MASK 0x20
#define LCD_WF8B_BPFLCD30_SHIFT 5
#define LCD_WF8B_BPFLCD21_MASK 0x20
#define LCD_WF8B_BPFLCD21_SHIFT 5
#define LCD_WF8B_BPFLCD35_MASK 0x20
#define LCD_WF8B_BPFLCD35_SHIFT 5
#define LCD_WF8B_BPFLCD4_MASK 0x20
#define LCD_WF8B_BPFLCD4_SHIFT 5
#define LCD_WF8B_BPFLCD31_MASK 0x20
#define LCD_WF8B_BPFLCD31_SHIFT 5
#define LCD_WF8B_BPFLCD48_MASK 0x20
#define LCD_WF8B_BPFLCD48_SHIFT 5
#define LCD_WF8B_BPFLCD7_MASK 0x20
#define LCD_WF8B_BPFLCD7_SHIFT 5
#define LCD_WF8B_BPFLCD22_MASK 0x20
#define LCD_WF8B_BPFLCD22_SHIFT 5
#define LCD_WF8B_BPFLCD38_MASK 0x20
#define LCD_WF8B_BPFLCD38_SHIFT 5
#define LCD_WF8B_BPFLCD12_MASK 0x20
#define LCD_WF8B_BPFLCD12_SHIFT 5
#define LCD_WF8B_BPFLCD23_MASK 0x20
#define LCD_WF8B_BPFLCD23_SHIFT 5
#define LCD_WF8B_BPGLCD14_MASK 0x40
#define LCD_WF8B_BPGLCD14_SHIFT 6
#define LCD_WF8B_BPGLCD55_MASK 0x40
#define LCD_WF8B_BPGLCD55_SHIFT 6
#define LCD_WF8B_BPGLCD63_MASK 0x40
#define LCD_WF8B_BPGLCD63_SHIFT 6
#define LCD_WF8B_BPGLCD15_MASK 0x40
#define LCD_WF8B_BPGLCD15_SHIFT 6
#define LCD_WF8B_BPGLCD62_MASK 0x40
#define LCD_WF8B_BPGLCD62_SHIFT 6
#define LCD_WF8B_BPGLCD54_MASK 0x40
#define LCD_WF8B_BPGLCD54_SHIFT 6
#define LCD_WF8B_BPGLCD61_MASK 0x40
#define LCD_WF8B_BPGLCD61_SHIFT 6
#define LCD_WF8B_BPGLCD60_MASK 0x40
#define LCD_WF8B_BPGLCD60_SHIFT 6
#define LCD_WF8B_BPGLCD59_MASK 0x40
#define LCD_WF8B_BPGLCD59_SHIFT 6
#define LCD_WF8B_BPGLCD53_MASK 0x40
#define LCD_WF8B_BPGLCD53_SHIFT 6
#define LCD_WF8B_BPGLCD58_MASK 0x40
#define LCD_WF8B_BPGLCD58_SHIFT 6
#define LCD_WF8B_BPGLCD0_MASK 0x40
#define LCD_WF8B_BPGLCD0_SHIFT 6
#define LCD_WF8B_BPGLCD57_MASK 0x40
#define LCD_WF8B_BPGLCD57_SHIFT 6
#define LCD_WF8B_BPGLCD52_MASK 0x40
#define LCD_WF8B_BPGLCD52_SHIFT 6
#define LCD_WF8B_BPGLCD7_MASK 0x40
#define LCD_WF8B_BPGLCD7_SHIFT 6
#define LCD_WF8B_BPGLCD56_MASK 0x40
#define LCD_WF8B_BPGLCD56_SHIFT 6
#define LCD_WF8B_BPGLCD6_MASK 0x40
#define LCD_WF8B_BPGLCD6_SHIFT 6
#define LCD_WF8B_BPGLCD51_MASK 0x40
#define LCD_WF8B_BPGLCD51_SHIFT 6
#define LCD_WF8B_BPGLCD16_MASK 0x40
#define LCD_WF8B_BPGLCD16_SHIFT 6
#define LCD_WF8B_BPGLCD1_MASK 0x40
#define LCD_WF8B_BPGLCD1_SHIFT 6
#define LCD_WF8B_BPGLCD17_MASK 0x40
#define LCD_WF8B_BPGLCD17_SHIFT 6
#define LCD_WF8B_BPGLCD50_MASK 0x40
#define LCD_WF8B_BPGLCD50_SHIFT 6
#define LCD_WF8B_BPGLCD18_MASK 0x40
#define LCD_WF8B_BPGLCD18_SHIFT 6
#define LCD_WF8B_BPGLCD19_MASK 0x40
#define LCD_WF8B_BPGLCD19_SHIFT 6
#define LCD_WF8B_BPGLCD8_MASK 0x40
#define LCD_WF8B_BPGLCD8_SHIFT 6
#define LCD_WF8B_BPGLCD49_MASK 0x40
#define LCD_WF8B_BPGLCD49_SHIFT 6
#define LCD_WF8B_BPGLCD20_MASK 0x40
#define LCD_WF8B_BPGLCD20_SHIFT 6
#define LCD_WF8B_BPGLCD9_MASK 0x40
#define LCD_WF8B_BPGLCD9_SHIFT 6
#define LCD_WF8B_BPGLCD21_MASK 0x40
#define LCD_WF8B_BPGLCD21_SHIFT 6
#define LCD_WF8B_BPGLCD13_MASK 0x40
#define LCD_WF8B_BPGLCD13_SHIFT 6
#define LCD_WF8B_BPGLCD48_MASK 0x40
#define LCD_WF8B_BPGLCD48_SHIFT 6
#define LCD_WF8B_BPGLCD22_MASK 0x40
#define LCD_WF8B_BPGLCD22_SHIFT 6
#define LCD_WF8B_BPGLCD5_MASK 0x40
#define LCD_WF8B_BPGLCD5_SHIFT 6
#define LCD_WF8B_BPGLCD47_MASK 0x40
#define LCD_WF8B_BPGLCD47_SHIFT 6
#define LCD_WF8B_BPGLCD23_MASK 0x40
#define LCD_WF8B_BPGLCD23_SHIFT 6
#define LCD_WF8B_BPGLCD24_MASK 0x40
#define LCD_WF8B_BPGLCD24_SHIFT 6
#define LCD_WF8B_BPGLCD25_MASK 0x40
#define LCD_WF8B_BPGLCD25_SHIFT 6
#define LCD_WF8B_BPGLCD46_MASK 0x40
#define LCD_WF8B_BPGLCD46_SHIFT 6
#define LCD_WF8B_BPGLCD26_MASK 0x40
#define LCD_WF8B_BPGLCD26_SHIFT 6
#define LCD_WF8B_BPGLCD27_MASK 0x40
#define LCD_WF8B_BPGLCD27_SHIFT 6
#define LCD_WF8B_BPGLCD10_MASK 0x40
#define LCD_WF8B_BPGLCD10_SHIFT 6
#define LCD_WF8B_BPGLCD45_MASK 0x40
#define LCD_WF8B_BPGLCD45_SHIFT 6
#define LCD_WF8B_BPGLCD28_MASK 0x40
#define LCD_WF8B_BPGLCD28_SHIFT 6
#define LCD_WF8B_BPGLCD29_MASK 0x40
#define LCD_WF8B_BPGLCD29_SHIFT 6
#define LCD_WF8B_BPGLCD4_MASK 0x40
#define LCD_WF8B_BPGLCD4_SHIFT 6
#define LCD_WF8B_BPGLCD44_MASK 0x40
#define LCD_WF8B_BPGLCD44_SHIFT 6
#define LCD_WF8B_BPGLCD30_MASK 0x40
#define LCD_WF8B_BPGLCD30_SHIFT 6
#define LCD_WF8B_BPGLCD2_MASK 0x40
#define LCD_WF8B_BPGLCD2_SHIFT 6
#define LCD_WF8B_BPGLCD31_MASK 0x40
#define LCD_WF8B_BPGLCD31_SHIFT 6
#define LCD_WF8B_BPGLCD43_MASK 0x40
#define LCD_WF8B_BPGLCD43_SHIFT 6
#define LCD_WF8B_BPGLCD32_MASK 0x40
#define LCD_WF8B_BPGLCD32_SHIFT 6
#define LCD_WF8B_BPGLCD33_MASK 0x40
#define LCD_WF8B_BPGLCD33_SHIFT 6
#define LCD_WF8B_BPGLCD42_MASK 0x40
#define LCD_WF8B_BPGLCD42_SHIFT 6
#define LCD_WF8B_BPGLCD34_MASK 0x40
#define LCD_WF8B_BPGLCD34_SHIFT 6
#define LCD_WF8B_BPGLCD11_MASK 0x40
#define LCD_WF8B_BPGLCD11_SHIFT 6
#define LCD_WF8B_BPGLCD35_MASK 0x40
#define LCD_WF8B_BPGLCD35_SHIFT 6
#define LCD_WF8B_BPGLCD12_MASK 0x40
#define LCD_WF8B_BPGLCD12_SHIFT 6
#define LCD_WF8B_BPGLCD41_MASK 0x40
#define LCD_WF8B_BPGLCD41_SHIFT 6
#define LCD_WF8B_BPGLCD36_MASK 0x40
#define LCD_WF8B_BPGLCD36_SHIFT 6
#define LCD_WF8B_BPGLCD3_MASK 0x40
#define LCD_WF8B_BPGLCD3_SHIFT 6
#define LCD_WF8B_BPGLCD37_MASK 0x40
#define LCD_WF8B_BPGLCD37_SHIFT 6
#define LCD_WF8B_BPGLCD40_MASK 0x40
#define LCD_WF8B_BPGLCD40_SHIFT 6
#define LCD_WF8B_BPGLCD38_MASK 0x40
#define LCD_WF8B_BPGLCD38_SHIFT 6
#define LCD_WF8B_BPGLCD39_MASK 0x40
#define LCD_WF8B_BPGLCD39_SHIFT 6
#define LCD_WF8B_BPHLCD63_MASK 0x80
#define LCD_WF8B_BPHLCD63_SHIFT 7
#define LCD_WF8B_BPHLCD62_MASK 0x80
#define LCD_WF8B_BPHLCD62_SHIFT 7
#define LCD_WF8B_BPHLCD61_MASK 0x80
#define LCD_WF8B_BPHLCD61_SHIFT 7
#define LCD_WF8B_BPHLCD60_MASK 0x80
#define LCD_WF8B_BPHLCD60_SHIFT 7
#define LCD_WF8B_BPHLCD59_MASK 0x80
#define LCD_WF8B_BPHLCD59_SHIFT 7
#define LCD_WF8B_BPHLCD58_MASK 0x80
#define LCD_WF8B_BPHLCD58_SHIFT 7
#define LCD_WF8B_BPHLCD57_MASK 0x80
#define LCD_WF8B_BPHLCD57_SHIFT 7
#define LCD_WF8B_BPHLCD0_MASK 0x80
#define LCD_WF8B_BPHLCD0_SHIFT 7
#define LCD_WF8B_BPHLCD56_MASK 0x80
#define LCD_WF8B_BPHLCD56_SHIFT 7
#define LCD_WF8B_BPHLCD55_MASK 0x80
#define LCD_WF8B_BPHLCD55_SHIFT 7
#define LCD_WF8B_BPHLCD54_MASK 0x80
#define LCD_WF8B_BPHLCD54_SHIFT 7
#define LCD_WF8B_BPHLCD53_MASK 0x80
#define LCD_WF8B_BPHLCD53_SHIFT 7
#define LCD_WF8B_BPHLCD52_MASK 0x80
#define LCD_WF8B_BPHLCD52_SHIFT 7
#define LCD_WF8B_BPHLCD51_MASK 0x80
#define LCD_WF8B_BPHLCD51_SHIFT 7
#define LCD_WF8B_BPHLCD50_MASK 0x80
#define LCD_WF8B_BPHLCD50_SHIFT 7
#define LCD_WF8B_BPHLCD1_MASK 0x80
#define LCD_WF8B_BPHLCD1_SHIFT 7
#define LCD_WF8B_BPHLCD49_MASK 0x80
#define LCD_WF8B_BPHLCD49_SHIFT 7
#define LCD_WF8B_BPHLCD48_MASK 0x80
#define LCD_WF8B_BPHLCD48_SHIFT 7
#define LCD_WF8B_BPHLCD47_MASK 0x80
#define LCD_WF8B_BPHLCD47_SHIFT 7
#define LCD_WF8B_BPHLCD46_MASK 0x80
#define LCD_WF8B_BPHLCD46_SHIFT 7
#define LCD_WF8B_BPHLCD45_MASK 0x80
#define LCD_WF8B_BPHLCD45_SHIFT 7
#define LCD_WF8B_BPHLCD44_MASK 0x80
#define LCD_WF8B_BPHLCD44_SHIFT 7
#define LCD_WF8B_BPHLCD43_MASK 0x80
#define LCD_WF8B_BPHLCD43_SHIFT 7
#define LCD_WF8B_BPHLCD2_MASK 0x80
#define LCD_WF8B_BPHLCD2_SHIFT 7
#define LCD_WF8B_BPHLCD42_MASK 0x80
#define LCD_WF8B_BPHLCD42_SHIFT 7
#define LCD_WF8B_BPHLCD41_MASK 0x80
#define LCD_WF8B_BPHLCD41_SHIFT 7
#define LCD_WF8B_BPHLCD40_MASK 0x80
#define LCD_WF8B_BPHLCD40_SHIFT 7
#define LCD_WF8B_BPHLCD39_MASK 0x80
#define LCD_WF8B_BPHLCD39_SHIFT 7
#define LCD_WF8B_BPHLCD38_MASK 0x80
#define LCD_WF8B_BPHLCD38_SHIFT 7
#define LCD_WF8B_BPHLCD37_MASK 0x80
#define LCD_WF8B_BPHLCD37_SHIFT 7
#define LCD_WF8B_BPHLCD36_MASK 0x80
#define LCD_WF8B_BPHLCD36_SHIFT 7
#define LCD_WF8B_BPHLCD3_MASK 0x80
#define LCD_WF8B_BPHLCD3_SHIFT 7
#define LCD_WF8B_BPHLCD35_MASK 0x80
#define LCD_WF8B_BPHLCD35_SHIFT 7
#define LCD_WF8B_BPHLCD34_MASK 0x80
#define LCD_WF8B_BPHLCD34_SHIFT 7
#define LCD_WF8B_BPHLCD33_MASK 0x80
#define LCD_WF8B_BPHLCD33_SHIFT 7
#define LCD_WF8B_BPHLCD32_MASK 0x80
#define LCD_WF8B_BPHLCD32_SHIFT 7
#define LCD_WF8B_BPHLCD31_MASK 0x80
#define LCD_WF8B_BPHLCD31_SHIFT 7
#define LCD_WF8B_BPHLCD30_MASK 0x80
#define LCD_WF8B_BPHLCD30_SHIFT 7
#define LCD_WF8B_BPHLCD29_MASK 0x80
#define LCD_WF8B_BPHLCD29_SHIFT 7
#define LCD_WF8B_BPHLCD4_MASK 0x80
#define LCD_WF8B_BPHLCD4_SHIFT 7
#define LCD_WF8B_BPHLCD28_MASK 0x80
#define LCD_WF8B_BPHLCD28_SHIFT 7
#define LCD_WF8B_BPHLCD27_MASK 0x80
#define LCD_WF8B_BPHLCD27_SHIFT 7
#define LCD_WF8B_BPHLCD26_MASK 0x80
#define LCD_WF8B_BPHLCD26_SHIFT 7
#define LCD_WF8B_BPHLCD25_MASK 0x80
#define LCD_WF8B_BPHLCD25_SHIFT 7
#define LCD_WF8B_BPHLCD24_MASK 0x80
#define LCD_WF8B_BPHLCD24_SHIFT 7
#define LCD_WF8B_BPHLCD23_MASK 0x80
#define LCD_WF8B_BPHLCD23_SHIFT 7
#define LCD_WF8B_BPHLCD22_MASK 0x80
#define LCD_WF8B_BPHLCD22_SHIFT 7
#define LCD_WF8B_BPHLCD5_MASK 0x80
#define LCD_WF8B_BPHLCD5_SHIFT 7
#define LCD_WF8B_BPHLCD21_MASK 0x80
#define LCD_WF8B_BPHLCD21_SHIFT 7
#define LCD_WF8B_BPHLCD20_MASK 0x80
#define LCD_WF8B_BPHLCD20_SHIFT 7
#define LCD_WF8B_BPHLCD19_MASK 0x80
#define LCD_WF8B_BPHLCD19_SHIFT 7
#define LCD_WF8B_BPHLCD18_MASK 0x80
#define LCD_WF8B_BPHLCD18_SHIFT 7
#define LCD_WF8B_BPHLCD17_MASK 0x80
#define LCD_WF8B_BPHLCD17_SHIFT 7
#define LCD_WF8B_BPHLCD16_MASK 0x80
#define LCD_WF8B_BPHLCD16_SHIFT 7
#define LCD_WF8B_BPHLCD15_MASK 0x80
#define LCD_WF8B_BPHLCD15_SHIFT 7
#define LCD_WF8B_BPHLCD6_MASK 0x80
#define LCD_WF8B_BPHLCD6_SHIFT 7
#define LCD_WF8B_BPHLCD14_MASK 0x80
#define LCD_WF8B_BPHLCD14_SHIFT 7
#define LCD_WF8B_BPHLCD13_MASK 0x80
#define LCD_WF8B_BPHLCD13_SHIFT 7
#define LCD_WF8B_BPHLCD12_MASK 0x80
#define LCD_WF8B_BPHLCD12_SHIFT 7
#define LCD_WF8B_BPHLCD11_MASK 0x80
#define LCD_WF8B_BPHLCD11_SHIFT 7
#define LCD_WF8B_BPHLCD10_MASK 0x80
#define LCD_WF8B_BPHLCD10_SHIFT 7
#define LCD_WF8B_BPHLCD9_MASK 0x80
#define LCD_WF8B_BPHLCD9_SHIFT 7
#define LCD_WF8B_BPHLCD8_MASK 0x80
#define LCD_WF8B_BPHLCD8_SHIFT 7
#define LCD_WF8B_BPHLCD7_MASK 0x80
#define LCD_WF8B_BPHLCD7_SHIFT 7
//---------------------------------------------------------------
//Multipurpose clock generator (MCG)
#define MCG_BASE 0x40064000
#define MCG_C1_OFFSET 0x00
#define MCG_C2_OFFSET 0x01
#define MCG_C4_OFFSET 0x03
#define MCG_C5_OFFSET 0x04
#define MCG_C6_OFFSET 0x05
#define MCG_S_OFFSET 0x06
#define MCG_C1 (MCG_BASE + MCG_C1_OFFSET)
#define MCG_C2 (MCG_BASE + MCG_C2_OFFSET)
#define MCG_C4 (MCG_BASE + MCG_C4_OFFSET)
#define MCG_C5 (MCG_BASE + MCG_C5_OFFSET)
#define MCG_C6 (MCG_BASE + MCG_C6_OFFSET)
#define MCG_S (MCG_BASE + MCG_S_OFFSET)
//---------------------------------------------------------------
//MCG_C1 (0x04)
//7-6:CLKS=clock source select (00)
//        :00=output of FLL of PLL (depends on MCG_C6.PLLS)
//        :01=internal reference clock
//        :10=external reference clock
//        :11=(reserved)
//5-3:FRDIV=FLL external reference divider (000)
//    (depends on MCG_C2.RANGE0)
//         :first divider is for RANGE0=0
//         :second divider is for all other RANGE0 values
//         :000=  1 or   32
//         :001=  2 or   64
//         :010=  4 or  128
//         :011=  8 or  256
//         :100= 16 or  512
//         :101= 32 or 1024
//         :110= 64 or 1280
//         :111=128 or 1536
//  2:IREFS=internal reference select (for FLL) (1)
//         :0=external reference clock
//         :1=slow internal reference clock
//  1:IRCLKEN=internal reference clock (MCGIRCLK) enable (0)
//  0:IREFSTEN=internal reference stop enable (0)
#define MCG_C1_CLKS_MASK 0xC0
#define MCG_C1_CLKS_SHIFT 6
#define MCG_C1_FRDIV_MASK 0x38
#define MCG_C1_FRDIV_SHIFT 3
#define MCG_C1_IREFS_MASK 0x04
#define MCG_C1_IREFS_SHIFT 2
#define MCG_C1_IRCLKEN_MASK 0x02
#define MCG_C1_IRCLKEN_SHIFT 1
#define MCG_C1_IREFSTEN_MASK 0x01
#define MCG_C1_IREFSTEN_SHIFT 0
//---------------------------------------------------------------
//MCG_C2 (0xC0)
//  7:LOCRE0=loss of clock reset enable (1)
//          :0=interrupt request on loss of OCS0 external reference clock
//          :1=reset request on loss of OCS0 external reference clock
//  6:FCFTRIM=fast internal reference clock fine trim (1)
//5-4:RANGE0=frequency range select (00)
//          :00=low frequency range for crystal oscillator
//          :01=high frequency range for crystal oscillator
//          :1X=very high frequency range for crystal oscillator
//  3:HGO0=high gain oscillator select (0)
//        :0=low-power operation
//        :1=high-gain operation
//  2:EREFS0=external reference select (0)
//          :0=external reference clock
//          :1=oscillator
//  1:LP=low power select (0)
//      :0=FLL or PLL not disabled in bypass modes
//      :1=FLL or PLL disabled in bypass modes (lower power)
//  0:IRCS=internal reference clock select (0)
//        :0=slow internal reference clock
//        :1=fast internal reference clock
#define MCG_C2_LOCRE0_MASK 0x80
#define MCG_C2_LOCRE0_SHIFT 7
#define MCG_C2_FCFTRIM_MASK 0x40
#define MCG_C2_FCFTRIM_SHIFT 6
#define MCG_C2_RANGE0_MASK 0x30
#define MCG_C2_RANGE0_SHIFT 4
#define MCG_C2_HGO0_MASK 0x08
#define MCG_C2_HGO0_SHIFT 3
#define MCG_C2_EREFS0_MASK 0x04
#define MCG_C2_EREFS0_SHIFT 2
#define MCG_C2_LP_MASK 0x02
#define MCG_C2_LP_SHIFT 1
#define MCG_C2_IRCS_MASK 0x01
#define MCG_C2_IRCS_SHIFT 0
//---------------------------------------------------------------
//MCG_C3 (0xXX)
//7-0:SCTRIM=slow internal reference clock trim setting//
//           on reset, loaded with a factory trim value
#define MCG_C3_SCTRIM_MASK 0xFF
#define MCG_C3_SCTRIM_SHIFT 0
//---------------------------------------------------------------
//MCG_C4 (2_000XXXXX)
//  7:DMX32=DCO maximum frequency with 32.768 kHz reference (0)
//         :0=default range of 25%
//         :1=fine-tuned for 32.768 kHz reference
//6-5:DRST_DRS=DCO range select (00)
//            :00=low range (default)
//            :01=mid range
//            :10=mid-high range
//            :11=high range
//4-1:FCTRIM=fast internal reference clock trim setting (XXXX)
//           on reset, loaded with a factory trim value
//  0:SCFTRIM=slow internal reference clock fine trim (X)
//           on reset, loaded with a factory trim value
#define MCG_C4_DMX32_MASK 0x80
#define MCG_C4_DMX32_SHIFT 7
#define MCG_C4_DRST_DRS_MASK 0x60
#define MCG_C4_DRST_DRS_SHIFT 5
#define MCG_C4_FCTRIM_MASK 0x1E
#define MCG_C4_FCTRIM_SHIFT 1
#define MCG_C4_SCFTRIM_MASK 0x1
#define MCG_C4_SCFTRIM_SHIFT 0
//---------------------------------------------------------------
//MCG_C5 (0x00)
//  7:(reserved): read-only// always 0
//  6:PLLCLKEN0=PLL clock (MCGPLLCLK) enable (0)
//  5:PLLSTEN0=PLL stop enable (in normal stop mode) (0)
//4-0:PRDIV0=PLL external reference divider (2_00000)
//          :00000-11000=1-25 (PRDIV0 + 1)
//          :others=(reserved)
#define MCG_C5_PLLCLKEN0_MASK 0x40
#define MCG_C5_PLLCLKEN0_SHIFT 6
#define MCG_C5_PLLSTEN0_MASK 0x20
#define MCG_C5_PLLSTEN0_SHIFT 5
#define MCG_C5_PRDIV0_MASK 0x1F
#define MCG_C5_PRDIV0_SHIFT 0
#define MCG_C5_PRDIV0_DIV2 0x01
//---------------------------------------------------------------
//MCG_C6 (0x00)
//  7:LOLIE0=loss of lock interrupt enable (0)
//  6:PLLS=PLL select (0)
//        :0=FLL
//        :1=PLL
//  5:CME0=clock monitor enable (0)
//4-0:VDIV0=VCO 0 divider (2_00000)
//         :Muliply factor for reference clock is VDIV0 + 24
#define MCG_C6_LOLIE0_MASK 0x80
