PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#define MCG_C6_LOLIE0_SHIFT 7
#define MCG_C6_PLLS_MASK 0x40
#define MCG_C6_PLLS_SHIFT 6
#define MCG_C6_CME0_MASK 0x20
#define MCG_C6_CME0_SHIFT 5
#define MCG_C6_VDIV0_MASK 0x1F
#define MCG_C6_VDIV0_SHIFT 0
//---------------------------------------------------------------
//MCG_S
//  7:LOLS=loss of lock status
//  6:LOCK0=lock status
//  5:PLLST=PLL select status
//         :0=FLL
//         :1=PLL
//  4:IREFST=internal reference status
//          :0=FLL source external
//          :1=FLL source internal
//3-2:CLKST=clock mode status
//         :00=FLL
//         :01=internal reference
//         :10=external reference
//         :11=PLL
//  1:OSCINIT0=OSC initialization (complete)
//  0:IRCST=internal reference clock status
//         :0=slow (32 kHz)
//         :1=fast (4 MHz)
#define MCG_S_LOLS_MASK 0x80
#define MCG_S_LOLS_SHIFT 7
#define MCG_S_LOCK0_MASK 0x40
#define MCG_S_LOCK0_SHIFT 6
#define MCG_S_PLLST_MASK 0x20
#define MCG_S_PLLST_SHIFT 5
#define MCG_S_IREFST_MASK 0x10
#define MCG_S_IREFST_SHIFT 4
#define MCG_S_CLKST_MASK 0x0C
#define MCG_S_CLKST_SHIFT 2
#define MCG_S_OSCINIT0_MASK 0x02
#define MCG_S_OSCINIT0_SHIFT 1
#define MCG_S_IRCST_MASK 0x01
#define MCG_S_IRCST_SHIFT 0
//---------------------------------------------------------------
//Nested vectored interrupt controller (NVIC)
//Part of system control space (SCS)
#define NVIC_BASE 0xE000E100
#define NVIC_ISER_OFFSET 0x00
#define NVIC_ICER_OFFSET 0x80
#define NVIC_ISPR_OFFSET 0x100
#define NVIC_ICPR_OFFSET 0x180
#define NVIC_IPR0_OFFSET 0x300
#define NVIC_IPR1_OFFSET 0x304
#define NVIC_IPR2_OFFSET 0x308
#define NVIC_IPR3_OFFSET 0x30C
#define NVIC_IPR4_OFFSET 0x310
#define NVIC_IPR5_OFFSET 0x314
#define NVIC_IPR6_OFFSET 0x318
#define NVIC_IPR7_OFFSET 0x31C
#define NVIC_ISER (NVIC_BASE + NVIC_ISER_OFFSET)
#define NVIC_ICER (NVIC_BASE + NVIC_ICER_OFFSET)
#define NVIC_ISPR (NVIC_BASE + NVIC_ISPR_OFFSET)
#define NVIC_ICPR (NVIC_BASE + NVIC_ICPR_OFFSET)
#define NVIC_IPR0 (NVIC_BASE + NVIC_IPR0_OFFSET)
#define NVIC_IPR1 (NVIC_BASE + NVIC_IPR1_OFFSET)
#define NVIC_IPR2 (NVIC_BASE + NVIC_IPR2_OFFSET)
#define NVIC_IPR3 (NVIC_BASE + NVIC_IPR3_OFFSET)
#define NVIC_IPR4 (NVIC_BASE + NVIC_IPR4_OFFSET)
#define NVIC_IPR5 (NVIC_BASE + NVIC_IPR5_OFFSET)
#define NVIC_IPR6 (NVIC_BASE + NVIC_IPR6_OFFSET)
#define NVIC_IPR7 (NVIC_BASE + NVIC_IPR7_OFFSET)
//---------------------------------------------------------------
//NVIC IPR assignments
// DMA channel 0 xfer complete/error
#define DMA0_IPR NVIC_IPR0
// DMA channel 1 xfer complete/error
#define DMA1_IPR NVIC_IPR0
// DMA channel 2 xfer complete/error
#define DMA2_IPR NVIC_IPR0
// DMA channel 3 xfer complete/error
#define DMA3_IPR NVIC_IPR0
// (reserved)
#define Reserved20_IPR NVIC_IPR1
// command complete
#define FTFA_IPR NVIC_IPR1
// low-voltage detect
#define PMC_IPR NVIC_IPR1
// low leakage wakeup
#define LLWU_IPR NVIC_IPR1
// I2C0
#define I2C0_IPR NVIC_IPR2
// I2C1
#define I2C1_IPR NVIC_IPR2
// SPI0 (all IRQ sources)
#define SPI0_IPR NVIC_IPR2
// SPI1 (all IRQ sources)
#define SPI1_IPR NVIC_IPR2
// UART0 (status
#define UART0_IPR NVIC_IPR3
// UART1 (status
#define UART1_IPR NVIC_IPR3
// UART2 (status
#define UART2_IPR NVIC_IPR3
// ADC0
#define ADC0_IPR NVIC_IPR3
// CMP0
#define CMP0_IPR NVIC_IPR4
// TPM0
#define TMP0_IPR NVIC_IPR4
// TPM1
#define TPM1_IPR NVIC_IPR4
// TPM2
#define TPM2_IPR NVIC_IPR4
// RTC (alarm)
#define RTC_IPR NVIC_IPR5
// RTC (seconds)
#define RTC_Seconds_IPR NVIC_IPR5
// PIT (all IRQ sources)
#define PIT_IPR NVIC_IPR5
// (reserved)
#define I2S0_IPR NVIC_IPR5
// USB OTG
#define USB0_IPR NVIC_IPR6
// DAC0
#define DAC0_IPR NVIC_IPR6
// TSI0
#define TSI0_IPR NVIC_IPR6
// MCG
#define MCG_IPR NVIC_IPR6
// LPTMR0
#define LPTMR0_IPR NVIC_IPR7
// LCD
#define LCD_IPR NVIC_IPR7
// PORTA pin detect
#define PORTA_IPR NVIC_IPR7
// PORTC and PORTD pin detect
#define PORTC_PORTD_IPR NVIC_IPR7
//---------------------------------------------------------------
//NVIC IPR position
//priority is a 2-bit value (0-3)
//.equ position, ates are for LSB of priority
// DMA channel 0 xfer complete/error
#define DMA0_PRI_POS 6
// DMA channel 1 xfer complete/error
#define DMA1_PRI_POS 14
// DMA channel 2 xfer complete/error
#define DMA2_PRI_POS 22
// DMA channel 3 xfer complete/error
#define DMA3_PRI_POS 30
// (reserved)
#define Reserved20_PRI_POS 6
// command complete
#define FTFA_PRI_POS 14
// low-voltage detect
#define PMC_PRI_POS 22
// low leakage wakeup
#define LLWU_PRI_POS 30
// I2C0
#define I2C0_PRI_POS 6
// I2C1
#define I2C1_PRI_POS 14
// SPI0 (all IRQ sources)
#define SPI0_PRI_POS 22
// SPI1 (all IRQ sources)
#define SPI1_PRI_POS 30
// UART0 (status
#define UART0_PRI_POS 6
// UART1 (status
#define UART1_PRI_POS 14
// UART2 (status
#define UART2_PRI_POS 22
// ADC0
#define ADC0_PRI_POS 30
// CMP0
#define CMP0_PRI_POS 6
// TPM0
#define TMP0_PRI_POS 14
// TPM1
#define TPM1_PRI_POS 22
// TPM2
#define TPM2_PRI_POS 30
// RTC (alarm)
#define RTC_PRI_POS 6
// RTC (seconds)
#define RTC_Seconds_PRI_POS 14
// PIT (all IRQ sources)
#define PIT_PRI_POS 22
// I2S0
#define I2S0_PRI_POS 30
// USB OTG
#define USB0_PRI_POS 6
// DAC0
#define DAC0_PRI_POS 14
// TSI0
#define TSI0_PRI_POS 22
// MCG
#define MCG_PRI_POS 30
// LPTMR0
#define LPTMR0_PRI_POS 6
// LCD
#define LCD_PRI_POS 14
// PORTA pin detect
#define PORTA_PRI_POS 22
// PORTC and PORTD pin detect
#define PORTC_PORTD_PRI_POS 30
//---------------------------------------------------------------
//NVIC IRQ assignments
// DMA channel 0 xfer complete/error
#define DMA0_IRQ 00
// DMA channel 1 xfer complete/error
#define DMA1_IRQ 01
// DMA channel 2 xfer complete/error
#define DMA2_IRQ 02
// DMA channel 3 xfer complete/error
#define DMA3_IRQ 03
// (reserved)
#define Reserved20_IRQ 04
// command complete
#define FTFA_IRQ 05
// low-voltage detect
#define PMC_IRQ 06
// low leakage wakeup
#define LLWU_IRQ 07
// I2C0
#define I2C0_IRQ 8
// I2C1
#define I2C1_IRQ 9
// SPI0 (all IRQ sources)
#define SPI0_IRQ 10
// SPI1 (all IRQ sources)
#define SPI1_IRQ 11
// UART0 (status
#define UART0_IRQ 12
// UART1 (status
#define UART1_IRQ 13
// UART2 (status
#define UART2_IRQ 14
// ADC0
#define ADC0_IRQ 15
// CMP0
#define CMP0_IRQ 16
// TPM0
#define TMP0_IRQ 15
// TPM1
#define TPM1_IRQ 18
// TPM2
#define TPM2_IRQ 19
// RTC (alarm)
#define RTC_IRQ 20
// RTC (seconds)
#define RTC_Seconds_IRQ 21
// PIT (all IRQ sources)
#define PIT_IRQ 22
// I2S0
#define I2S0_IRQ 23
// USB OTG
#define USB0_IRQ 24
// DAC0
#define DAC0_IRQ 25
// TSI0
#define TSI0_IRQ 26
// MCG
#define MCG_IRQ 27
// LPTMR0
#define LPTMR0_IRQ 28
// LCD
#define LCD_IRQ 29
// PORTA pin detect
#define PORTA_IRQ 30
// PORTC and PORTD pin detect
#define PORTC_PORTD_IRQ 31
//---------------------------------------------------------------
//NVIC IRQ masks for ICER, ISER, ICPR, and ISPR
// DMA channel 0 xfer complete/error
#define DMA0_IRQ_MASK (1 << DMA0_IRQ       )
// DMA channel 1 xfer complete/error
#define DMA1_IRQ_MASK (1 << DMA1_IRQ       )
// DMA channel 2 xfer complete/error
#define DMA2_IRQ_MASK (1 << DMA2_IRQ       )
// DMA channel 3 xfer complete/error
#define DMA3_IRQ_MASK (1 << DMA3_IRQ       )
// (reserved)
#define Reserved20_IRQ_MASK (1 << Reserved20_IRQ )
// command complete
#define FTFA_IRQ_MASK (1 << FTFA_IRQ       )
// low-voltage detect
#define PMC_IRQ_MASK (1 << PMC_IRQ        )
// low leakage wakeup
#define LLWU_IRQ_MASK (1 << LLWU_IRQ       )
// I2C0
#define I2C0_IRQ_MASK (1 << I2C0_IRQ       )
// I2C1
#define I2C1_IRQ_MASK (1 << I2C1_IRQ       )
// SPI0 (all IRQ sources)
#define SPI0_IRQ_MASK (1 << SPI0_IRQ       )
// SPI1 (all IRQ sources)
#define SPI1_IRQ_MASK (1 << SPI1_IRQ       )
// UART0 (status
#define UART0_IRQ_MASK (1 << UART0_IRQ      )
// UART1 (status
#define UART1_IRQ_MASK (1 << UART1_IRQ      )
// UART2 (status
#define UART2_IRQ_MASK (1 << UART2_IRQ      )
// ADC0
#define ADC0_IRQ_MASK (1 << ADC0_IRQ       )
// CMP0
#define CMP0_IRQ_MASK (1 << CMP0_IRQ       )
// TPM0
#define TMP0_IRQ_MASK (1 << TMP0_IRQ       )
// TPM1
#define TPM1_IRQ_MASK (1 << TPM1_IRQ       )
// TPM2
#define TPM2_IRQ_MASK (1 << TPM2_IRQ       )
// RTC (alarm)
#define RTC_IRQ_MASK (1 << RTC_IRQ        )
// RTC (seconds)
#define RTC_Seconds_IRQ_MASK (1 << RTC_Seconds_IRQ)
// PIT (all IRQ sources)
#define PIT_IRQ_MASK (1 << PIT_IRQ        )
// I2S0
#define I2S0_IRQ_MASK (1 << I2S0_IRQ       )
// USB OTG
#define USB0_IRQ_MASK (1 << USB0_IRQ       )
// DAC0
#define DAC0_IRQ_MASK (1 << DAC0_IRQ       )
// TSI0
#define TSI0_IRQ_MASK (1 << TSI0_IRQ       )
// MCG
#define MCG_IRQ_MASK (1 << MCG_IRQ        )
// LPTMR0
#define LPTMR0_IRQ_MASK (1 << LPTMR0_IRQ     )
// LCD
#define LCD_IRQ_MASK (1 << LCD_IRQ        )
// PORTA pin detect
#define PORTA_IRQ_MASK (1 << PORTA_IRQ      )
// PORTC and PORTD pin detect
#define PORTC_PORTD_IRQ_MASK (1 << PORTC_PORTD_IRQ)
//---------------------------------------------------------------
//NVIC vectors
// end of stack
#define Init_SP_Vector 00
// reset vector
#define Reset_Vector 01
// NMI
#define NMI_Vector02 02
// hard fault
#define Hard_Fault_Vector 03
// (reserved)
#define Reserved04_Vector 04
// (reserved)
#define Reserved05_Vector 05
// (reserved)
#define Reserved06_Vector 06
// (reserved)
#define Reserved07_Vector 07
// (reserved)
#define Reserved08_Vector 8
// (reserved)
#define Reserved09_Vector 9
// (reserved)
#define Reserved10_Vector 10
// SVCall (supervisor call)
#define SVCall_Vector 11
// (reserved)
#define Reserved12_Vector 12
// (reserved)
#define Reserved13_Vector 13
// PendableSrvReq (pendable request for system service)
#define PendSR_Vector 14
// SysTick (system tick timer)
#define SysTick_Vector 15
// DMA channel 0 xfer complete/error
#define DMA0_Vector 16
// DMA channel 1 xfer complete/error
#define DMA1_Vector 17
// DMA channel 2 xfer complete/error
#define DMA2_Vector 18
// DMA channel 3 xfer complete/error
#define DMA3_Vector 19
// (reserved)
#define Reserved20_Vector 20
// command complete
#define FTFA_Vector 21
// low-voltage detect
#define PMC_Vector 22
// low leakage wakeup
#define LLWU_Vector 23
// I2C0
#define I2C0_Vector 24
// I2C1
#define I2C1_Vector 25
// SPI0 (all IRQ sources)
#define SPI0_Vector 26
// SPI1 (all IRQ sources)
#define SPI1_Vector 27
// UART0 (status
#define UART0_Vector 28
// UART1 (status
#define UART1_Vector 29
// UART2 (status
#define UART2_Vector 30
// ADC0
#define ADC0_Vector 31
// CMP0
#define CMP0_Vector 32
// TPM0
#define TMP0_Vector 33
// TPM1
#define TPM1_Vector 34
// TPM2
#define TPM2_Vector 35
// RTC (alarm)
#define RTC_Vector 36
// RTC (seconds)
#define RTC_Seconds_Vector 37
// PIT (all IRQ sources)
#define PIT_Vector 38
// I2S0
#define I2S0_Vector 39
// USB OTG
#define USB0_Vector 40
// DAC0
#define DAC0_Vector 41
// TSI0
#define TSI0_Vector 42
// MCG
#define MCG_Vector 43
// LPTMR0
#define LPTMR0_Vector 44
// LCD
#define LCD_Vector 45
// PORTA pin detect
#define PORTA_Vector 46
// PORTD pin detect
#define PORTD_Vector 47
//---------------------------------------------------------------
//OSC
#define OSC0_BASE 0x40065000
#define OSC0_CR_OFFSET 0
#define OSC0_CR (OSC0_BASE + OSC0_CR_OFFSET)
//---------------------------------------------------------------
//OSC0_CR (0x00)
//7:ERCLKEN=external reference enable, OSCERCLK (0)
//6:(reserved):read-only:0
//5:EREFSTEN=external reference stop enable (0)
//4:(reserved):read-only:0
//3:SC2P=oscillator 2-pF capacitor load configure (0)
//2:SC4P=oscillator 4-pF capacitor load configure (0)
//1:SC8P=oscillator 8-pF capacitor load configure (0)
//0:SC16P=oscillator 16-pF capacitor load configure (0)
#define OSC_CR_SC16P_MASK 0x1
#define OSC_CR_SC16P_SHIFT 0
#define OSC_CR_SC8P_MASK 0x2
#define OSC_CR_SC8P_SHIFT 1
#define OSC_CR_SC4P_MASK 0x4
#define OSC_CR_SC4P_SHIFT 2
#define OSC_CR_SC2P_MASK 0x8
#define OSC_CR_SC2P_SHIFT 3
#define OSC_CR_EREFSTEN_MASK 0x20
#define OSC_CR_EREFSTEN_SHIFT 5
#define OSC_CR_ERCLKEN_MASK 0x80
#define OSC_CR_ERCLKEN_SHIFT 7
//---------------------------------------------------------------
//PIT
#define PIT_BASE 0x40037000
#define PIT_CH0_BASE 0x40037100
#define PIT_CH1_BASE 0x40037110
#define PIT_LDVAL_OFFSET 0x00
#define PIT_CVAL_OFFSET 0x04
#define PIT_TCTRL_OFFSET 0x08
#define PIT_TFLG_OFFSET 0x0C
#define PIT_MCR_OFFSET 0x00
#define PIT_LTMR64H_OFFSET 0xE0
#define PIT_LTMR64L_OFFSET 0xE4
#define PIT_LDVAL0_OFFSET 0x100
#define PIT_CVAL0_OFFSET 0x104
#define PIT_TCTRL0_OFFSET 0x108
#define PIT_TFLG0_OFFSET 0x10C
#define PIT_LDVAL1_OFFSET 0x110
#define PIT_CVAL1_OFFSET 0x114
#define PIT_TCTRL1_OFFSET 0x118
#define PIT_TFLG1_OFFSET 0x11C
#define PIT_MCR (PIT_BASE + PIT_MCR_OFFSET)
#define PIT_LTMR64H (PIT_BASE + PIT_LTMR64H_OFFSET)
#define PIT_LTMR64L (PIT_BASE + PIT_LTMR64L_OFFSET)
#define PIT_LDVAL0 (PIT_BASE + PIT_LDVAL0_OFFSET)
#define PIT_CVAL0 (PIT_BASE + PIT_CVAL0_OFFSET)
#define PIT_TCTRL0 (PIT_BASE + PIT_TCTRL0_OFFSET)
#define PIT_TFLG0 (PIT_BASE + PIT_TFLG0_OFFSET)
#define PIT_LDVAL1 (PIT_BASE + PIT_LDVAL1_OFFSET)
#define PIT_CVAL1 (PIT_BASE + PIT_CVAL1_OFFSET)
#define PIT_TCTRL1 (PIT_BASE + PIT_TCTRL1_OFFSET)
#define PIT_TFLG1 (PIT_BASE + PIT_TFLG1_OFFSET)
//---------------------------------------------------------------
//PIT_CVALn:  current timer value register (channel n)
//31-0:TVL=current timer value
//---------------------------------------------------------------
//PIT_LDVALn:  timer load value register (channel n)
//31-0:TSV=timer start value
//         PIT chan. n counts down from this value to 0,
//         then sets TIF and loads LDVALn
//---------------------------------------------------------------
//PIT_LTMR64H:  PIT upper lifetime timer register
//for applications chaining timer 0 and timer 1 for 64-bit timer
//31-0:LTH=life timer value (high word)
//         value of timer 1 (CVAL1)// read before PIT_LTMR64L
//---------------------------------------------------------------
//PIT_LTMR64L:  PIT lower lifetime timer register
//for applications chaining timer 0 and timer 1 for 64-bit timer
//31-0:LTL=life timer value (low word)
//         value of timer 0 (CVAL0)// read after PIT_LTMR64H
//---------------------------------------------------------------
//PIT_MCR:  PIT module control register
//31-3:(reserved):read-only:0
//   2:(reserved)
//   1:MDIS=module disable (PIT section)
//          RTI timer not affected by this field
//          must be enabled before any other setup
//   0:FRZ=freeze:  continue'/stop timers in debug mode
#define PIT_MCR_MDIS_MASK 0x00000002
#define PIT_MCR_MDIS_SHIFT 1
#define PIT_MCR_FRZ_MASK 0x00000001
#define PIT_MCR_FRZ_SHIFT 0
//---------------------------------------------------------------
//PIT_TCTRLn:  timer control register (channel n)
//31-3:(reserved):read-only:0
//   2:CHN=chain mode (enable)
//          in chain mode, channel n-1 must expire before
//                         channel n counts
//          timer 0 cannot be changed
//   1:TIE=timer interrupt enable (on TIF)
//   0:TEN=timer enable
#define PIT_TCTRL_CHN_MASK 0x00000004
#define PIT_TCTRL_CHN_SHIFT 2
#define PIT_TCTRL_TIE_MASK 0x00000002
#define PIT_TCTRL_TIE_SHIFT 1
#define PIT_TCTRL_TEN_MASK 0x00000001
#define PIT_TCTRL_TEN_SHIFT 0
//---------------------------------------------------------------
//PIT_TFLGn:  timer flag register (channel n)
//31-1:(reserved):read-only:0
//   0:TIF=timer interrupt flag
//         write 1 to clear
#define PIT_TFLG_TIF_MASK 0x00000001
#define PIT_TFLG_TIF_SHIFT 0
//---------------------------------------------------------------
//PORTx_PCRn (Port x pin control register n [for pin n])
//31-25:(reserved):read-only:0
//   24:ISF=interrupt status flag// write 1 clears
//23-20:(reserved):read-only:0
//19-16:IRCQ=interrupt configuration
//          :0000=interrupt/DMA request disabled
//          :0001=DMA request on rising edge
//          :0010=DMA request on falling edge
//          :0011=DMA request on either edge
//          :1000=interrupt when logic zero
//          :1001=interrupt on rising edge
//          :1010=interrupt on falling edge
//          :1011=interrupt on either edge
//          :1100=interrupt when logic one
//          :others=reserved
//15-11:(reserved):read-only:0
//10-08:MUX=Pin mux control
//         :000=pin disabled (analog)
//         :001=alternative 1 (GPIO)
//         :010-111=alternatives 2-7 (chip-specific)
//    7:(reserved):read-only:0
//    6:DSE=Drive strength enable
//         :0=low
//         :1=high
//    5:(reserved):read-only:0
//    4:PFE=Passive filter enable
//    3:(reserved):read-only:0
//    2:SRE=Slew rate enable
//         :0=fast
//         :1=slow
//    1:PE=Pull enable
//    0:PS=Pull select (if PE=1)
//        :0=internal pulldown
//        :1=internal pullup
#define PORT_PCR_ISF_MASK 0x01000000
#define PORT_PCR_ISF_SHIFT 24
#define PORT_PCR_IRCQ_MASK 0x000F0000
#define PORT_PCR_IRCQ_SHIFT 16
#define PORT_PCR_MUX_MASK 0x00000700
#define PORT_PCR_MUX_SHIFT 8
#define PORT_PCR_DSE_MASK 0x40
#define PORT_PCR_DSE_SHIFT 6
#define PORT_PCR_PFE_MASK 0x10
#define PORT_PCR_PFE_SHIFT 4
#define PORT_PCR_SRE_MASK 0x04
#define PORT_PCR_SRE_SHIFT 2
#define PORT_PCR_PE_MASK 0x02
#define PORT_PCR_PE_SHIFT 1
#define PORT_PCR_PS_MASK 0x01
#define PORT_PCR_PS_SHIFT 0
// analog
#define PORT_PCR_MUX_SELECT_0_MASK 0x00000000
// GPIO
#define PORT_PCR_MUX_SELECT_1_MASK 0x00000100
#define PORT_PCR_MUX_SELECT_2_MASK 0x00000200
#define PORT_PCR_MUX_SELECT_3_MASK 0x00000300
#define PORT_PCR_MUX_SELECT_4_MASK 0x00000400
#define PORT_PCR_MUX_SELECT_5_MASK 0x00000500
#define PORT_PCR_MUX_SELECT_6_MASK 0x00000600
#define PORT_PCR_MUX_SELECT_7_MASK 0x00000700
//---------------------------------------------------------------
//Port A
#define PORTA_BASE 0x40049000
#define PORTA_PCR0_OFFSET 0x00
#define PORTA_PCR1_OFFSET 0x04
#define PORTA_PCR2_OFFSET 0x08
#define PORTA_PCR3_OFFSET 0x0C
#define PORTA_PCR4_OFFSET 0x10
#define PORTA_PCR5_OFFSET 0x14
#define PORTA_PCR6_OFFSET 0x18
#define PORTA_PCR7_OFFSET 0x1C
#define PORTA_PCR8_OFFSET 0x20
#define PORTA_PCR9_OFFSET 0x24
#define PORTA_PCR10_OFFSET 0x28
#define PORTA_PCR11_OFFSET 0x2C
#define PORTA_PCR12_OFFSET 0x30
#define PORTA_PCR13_OFFSET 0x34
#define PORTA_PCR14_OFFSET 0x38
#define PORTA_PCR15_OFFSET 0x3C
#define PORTA_PCR16_OFFSET 0x40
#define PORTA_PCR17_OFFSET 0x44
#define PORTA_PCR18_OFFSET 0x48
#define PORTA_PCR19_OFFSET 0x4C
#define PORTA_PCR20_OFFSET 0x50
#define PORTA_PCR21_OFFSET 0x54
#define PORTA_PCR22_OFFSET 0x58
#define PORTA_PCR23_OFFSET 0x5C
#define PORTA_PCR24_OFFSET 0x60
#define PORTA_PCR25_OFFSET 0x64
#define PORTA_PCR26_OFFSET 0x68
#define PORTA_PCR27_OFFSET 0x6C
#define PORTA_PCR28_OFFSET 0x70
#define PORTA_PCR29_OFFSET 0x74
#define PORTA_PCR30_OFFSET 0x78
#define PORTA_PCR31_OFFSET 0x7C
#define PORTA_GPCLR_OFFSET 0x80
#define PORTA_GPCHR_OFFSET 0x84
#define PORTA_ISFR_OFFSET 0xA0
#define PORTA_PCR0 (PORTA_BASE + PORTA_PCR0_OFFSET)
#define PORTA_PCR1 (PORTA_BASE + PORTA_PCR1_OFFSET)
#define PORTA_PCR2 (PORTA_BASE + PORTA_PCR2_OFFSET)
#define PORTA_PCR3 (PORTA_BASE + PORTA_PCR3_OFFSET)
#define PORTA_PCR4 (PORTA_BASE + PORTA_PCR4_OFFSET)
#define PORTA_PCR5 (PORTA_BASE + PORTA_PCR5_OFFSET)
#define PORTA_PCR6 (PORTA_BASE + PORTA_PCR6_OFFSET)
#define PORTA_PCR7 (PORTA_BASE + PORTA_PCR7_OFFSET)
#define PORTA_PCR8 (PORTA_BASE + PORTA_PCR8_OFFSET)
#define PORTA_PCR9 (PORTA_BASE + PORTA_PCR9_OFFSET)
#define PORTA_PCR10 (PORTA_BASE + PORTA_PCR10_OFFSET)
#define PORTA_PCR11 (PORTA_BASE + PORTA_PCR11_OFFSET)
#define PORTA_PCR12 (PORTA_BASE + PORTA_PCR12_OFFSET)
#define PORTA_PCR13 (PORTA_BASE + PORTA_PCR13_OFFSET)
#define PORTA_PCR14 (PORTA_BASE + PORTA_PCR14_OFFSET)
#define PORTA_PCR15 (PORTA_BASE + PORTA_PCR15_OFFSET)
#define PORTA_PCR16 (PORTA_BASE + PORTA_PCR16_OFFSET)
#define PORTA_PCR17 (PORTA_BASE + PORTA_PCR17_OFFSET)
#define PORTA_PCR18 (PORTA_BASE + PORTA_PCR18_OFFSET)
#define PORTA_PCR19 (PORTA_BASE + PORTA_PCR19_OFFSET)
#define PORTA_PCR20 (PORTA_BASE + PORTA_PCR20_OFFSET)
#define PORTA_PCR21 (PORTA_BASE + PORTA_PCR21_OFFSET)
#define PORTA_PCR22 (PORTA_BASE + PORTA_PCR22_OFFSET)
#define PORTA_PCR23 (PORTA_BASE + PORTA_PCR23_OFFSET)
#define PORTA_PCR24 (PORTA_BASE + PORTA_PCR24_OFFSET)
#define PORTA_PCR25 (PORTA_BASE + PORTA_PCR25_OFFSET)
#define PORTA_PCR26 (PORTA_BASE + PORTA_PCR26_OFFSET)
#define PORTA_PCR27 (PORTA_BASE + PORTA_PCR27_OFFSET)
#define PORTA_PCR28 (PORTA_BASE + PORTA_PCR28_OFFSET)
#define PORTA_PCR29 (PORTA_BASE + PORTA_PCR29_OFFSET)
#define PORTA_PCR30 (PORTA_BASE + PORTA_PCR30_OFFSET)
#define PORTA_PCR31 (PORTA_BASE + PORTA_PCR31_OFFSET)
#define PORTA_GPCLR (PORTA_BASE + PORTA_GPCLR_OFFSET)
#define PORTA_GPCHR (PORTA_BASE + PORTA_GPCHR_OFFSET)
#define PORTA_ISFR (PORTA_BASE + PORTA_ISFR_OFFSET)
//---------------------------------------------------------------
//Port B
#define PORTB_BASE 0x4004A000
#define PORTB_PCR0_OFFSET 0x00
#define PORTB_PCR1_OFFSET 0x04
#define PORTB_PCR2_OFFSET 0x08
#define PORTB_PCR3_OFFSET 0x0C
#define PORTB_PCR4_OFFSET 0x10
#define PORTB_PCR5_OFFSET 0x14
#define PORTB_PCR6_OFFSET 0x18
#define PORTB_PCR7_OFFSET 0x1C
#define PORTB_PCR8_OFFSET 0x20
#define PORTB_PCR9_OFFSET 0x24
#define PORTB_PCR10_OFFSET 0x28
#define PORTB_PCR11_OFFSET 0x2C
#define PORTB_PCR12_OFFSET 0x30
#define PORTB_PCR13_OFFSET 0x34
#define PORTB_PCR14_OFFSET 0x38
#define PORTB_PCR15_OFFSET 0x3C
#define PORTB_PCR16_OFFSET 0x40
#define PORTB_PCR17_OFFSET 0x44
#define PORTB_PCR18_OFFSET 0x48
#define PORTB_PCR19_OFFSET 0x4C
#define PORTB_PCR20_OFFSET 0x50
#define PORTB_PCR21_OFFSET 0x54
#define PORTB_PCR22_OFFSET 0x58
#define PORTB_PCR23_OFFSET 0x5C
#define PORTB_PCR24_OFFSET 0x60
#define PORTB_PCR25_OFFSET 0x64
#define PORTB_PCR26_OFFSET 0x68
#define PORTB_PCR27_OFFSET 0x6C
#define PORTB_PCR28_OFFSET 0x70
#define PORTB_PCR29_OFFSET 0x74
#define PORTB_PCR30_OFFSET 0x78
#define PORTB_PCR31_OFFSET 0x7C
#define PORTB_GPCLR_OFFSET 0x80
#define PORTB_GPCHR_OFFSET 0x84
#define PORTB_ISFR_OFFSET 0xA0
#define PORTB_PCR0 (PORTB_BASE + PORTB_PCR0_OFFSET)
#define PORTB_PCR1 (PORTB_BASE + PORTB_PCR1_OFFSET)
#define PORTB_PCR2 (PORTB_BASE + PORTB_PCR2_OFFSET)
#define PORTB_PCR3 (PORTB_BASE + PORTB_PCR3_OFFSET)
#define PORTB_PCR4 (PORTB_BASE + PORTB_PCR4_OFFSET)
#define PORTB_PCR5 (PORTB_BASE + PORTB_PCR5_OFFSET)
#define PORTB_PCR6 (PORTB_BASE + PORTB_PCR6_OFFSET)
#define PORTB_PCR7 (PORTB_BASE + PORTB_PCR7_OFFSET)
#define PORTB_PCR8 (PORTB_BASE + PORTB_PCR8_OFFSET)
#define PORTB_PCR9 (PORTB_BASE + PORTB_PCR9_OFFSET)
#define PORTB_PCR10 (PORTB_BASE + PORTB_PCR10_OFFSET)
#define PORTB_PCR11 (PORTB_BASE + PORTB_PCR11_OFFSET)
#define PORTB_PCR12 (PORTB_BASE + PORTB_PCR12_OFFSET)
#define PORTB_PCR13 (PORTB_BASE + PORTB_PCR13_OFFSET)
#define PORTB_PCR14 (PORTB_BASE + PORTB_PCR14_OFFSET)
#define PORTB_PCR15 (PORTB_BASE + PORTB_PCR15_OFFSET)
#define PORTB_PCR16 (PORTB_BASE + PORTB_PCR16_OFFSET)
#define PORTB_PCR17 (PORTB_BASE + PORTB_PCR17_OFFSET)
#define PORTB_PCR18 (PORTB_BASE + PORTB_PCR18_OFFSET)
#define PORTB_PCR19 (PORTB_BASE + PORTB_PCR19_OFFSET)
#define PORTB_PCR20 (PORTB_BASE + PORTB_PCR20_OFFSET)
#define PORTB_PCR21 (PORTB_BASE + PORTB_PCR21_OFFSET)
#define PORTB_PCR22 (PORTB_BASE + PORTB_PCR22_OFFSET)
#define PORTB_PCR23 (PORTB_BASE + PORTB_PCR23_OFFSET)
#define PORTB_PCR24 (PORTB_BASE + PORTB_PCR24_OFFSET)
#define PORTB_PCR25 (PORTB_BASE + PORTB_PCR25_OFFSET)
#define PORTB_PCR26 (PORTB_BASE + PORTB_PCR26_OFFSET)
#define PORTB_PCR27 (PORTB_BASE + PORTB_PCR27_OFFSET)
#define PORTB_PCR28 (PORTB_BASE + PORTB_PCR28_OFFSET)
#define PORTB_PCR29 (PORTB_BASE + PORTB_PCR29_OFFSET)
#define PORTB_PCR30 (PORTB_BASE + PORTB_PCR30_OFFSET)
#define PORTB_PCR31 (PORTB_BASE + PORTB_PCR31_OFFSET)
#define PORTB_GPCLR (PORTB_BASE + PORTB_GPCLR_OFFSET)
#define PORTB_GPCHR (PORTB_BASE + PORTB_GPCHR_OFFSET)
#define PORTB_ISFR (PORTB_BASE + PORTB_ISFR_OFFSET)
//---------------------------------------------------------------
//Port C
#define PORTC_BASE 0x4004B000
#define PORTC_PCR0_OFFSET 0x00
#define PORTC_PCR1_OFFSET 0x04
#define PORTC_PCR2_OFFSET 0x08
#define PORTC_PCR3_OFFSET 0x0C
#define PORTC_PCR4_OFFSET 0x10
#define PORTC_PCR5_OFFSET 0x14
#define PORTC_PCR6_OFFSET 0x18
