PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
#define PORTC_PCR7_OFFSET 0x1C
#define PORTC_PCR8_OFFSET 0x20
#define PORTC_PCR9_OFFSET 0x24
#define PORTC_PCR10_OFFSET 0x28
#define PORTC_PCR11_OFFSET 0x2C
#define PORTC_PCR12_OFFSET 0x30
#define PORTC_PCR13_OFFSET 0x34
#define PORTC_PCR14_OFFSET 0x38
#define PORTC_PCR15_OFFSET 0x3C
#define PORTC_PCR16_OFFSET 0x40
#define PORTC_PCR17_OFFSET 0x44
#define PORTC_PCR18_OFFSET 0x48
#define PORTC_PCR19_OFFSET 0x4C
#define PORTC_PCR20_OFFSET 0x50
#define PORTC_PCR21_OFFSET 0x54
#define PORTC_PCR22_OFFSET 0x58
#define PORTC_PCR23_OFFSET 0x5C
#define PORTC_PCR24_OFFSET 0x60
#define PORTC_PCR25_OFFSET 0x64
#define PORTC_PCR26_OFFSET 0x68
#define PORTC_PCR27_OFFSET 0x6C
#define PORTC_PCR28_OFFSET 0x70
#define PORTC_PCR29_OFFSET 0x74
#define PORTC_PCR30_OFFSET 0x78
#define PORTC_PCR31_OFFSET 0x7C
#define PORTC_GPCLR_OFFSET 0x80
#define PORTC_GPCHR_OFFSET 0x84
#define PORTC_ISFR_OFFSET 0xA0
#define PORTC_PCR0 (PORTC_BASE + PORTC_PCR0_OFFSET)
#define PORTC_PCR1 (PORTC_BASE + PORTC_PCR1_OFFSET)
#define PORTC_PCR2 (PORTC_BASE + PORTC_PCR2_OFFSET)
#define PORTC_PCR3 (PORTC_BASE + PORTC_PCR3_OFFSET)
#define PORTC_PCR4 (PORTC_BASE + PORTC_PCR4_OFFSET)
#define PORTC_PCR5 (PORTC_BASE + PORTC_PCR5_OFFSET)
#define PORTC_PCR6 (PORTC_BASE + PORTC_PCR6_OFFSET)
#define PORTC_PCR7 (PORTC_BASE + PORTC_PCR7_OFFSET)
#define PORTC_PCR8 (PORTC_BASE + PORTC_PCR8_OFFSET)
#define PORTC_PCR9 (PORTC_BASE + PORTC_PCR9_OFFSET)
#define PORTC_PCR10 (PORTC_BASE + PORTC_PCR10_OFFSET)
#define PORTC_PCR11 (PORTC_BASE + PORTC_PCR11_OFFSET)
#define PORTC_PCR12 (PORTC_BASE + PORTC_PCR12_OFFSET)
#define PORTC_PCR13 (PORTC_BASE + PORTC_PCR13_OFFSET)
#define PORTC_PCR14 (PORTC_BASE + PORTC_PCR14_OFFSET)
#define PORTC_PCR15 (PORTC_BASE + PORTC_PCR15_OFFSET)
#define PORTC_PCR16 (PORTC_BASE + PORTC_PCR16_OFFSET)
#define PORTC_PCR17 (PORTC_BASE + PORTC_PCR17_OFFSET)
#define PORTC_PCR18 (PORTC_BASE + PORTC_PCR18_OFFSET)
#define PORTC_PCR19 (PORTC_BASE + PORTC_PCR19_OFFSET)
#define PORTC_PCR20 (PORTC_BASE + PORTC_PCR20_OFFSET)
#define PORTC_PCR21 (PORTC_BASE + PORTC_PCR21_OFFSET)
#define PORTC_PCR22 (PORTC_BASE + PORTC_PCR22_OFFSET)
#define PORTC_PCR23 (PORTC_BASE + PORTC_PCR23_OFFSET)
#define PORTC_PCR24 (PORTC_BASE + PORTC_PCR24_OFFSET)
#define PORTC_PCR25 (PORTC_BASE + PORTC_PCR25_OFFSET)
#define PORTC_PCR26 (PORTC_BASE + PORTC_PCR26_OFFSET)
#define PORTC_PCR27 (PORTC_BASE + PORTC_PCR27_OFFSET)
#define PORTC_PCR28 (PORTC_BASE + PORTC_PCR28_OFFSET)
#define PORTC_PCR29 (PORTC_BASE + PORTC_PCR29_OFFSET)
#define PORTC_PCR30 (PORTC_BASE + PORTC_PCR30_OFFSET)
#define PORTC_PCR31 (PORTC_BASE + PORTC_PCR31_OFFSET)
#define PORTC_GPCLR (PORTC_BASE + PORTC_GPCLR_OFFSET)
#define PORTC_GPCHR (PORTC_BASE + PORTC_GPCHR_OFFSET)
#define PORTC_ISFR (PORTC_BASE + PORTC_ISFR_OFFSET)
//---------------------------------------------------------------
//Port D
#define PORTD_BASE 0x4004C000
#define PORTD_PCR0_OFFSET 0x00
#define PORTD_PCR1_OFFSET 0x04
#define PORTD_PCR2_OFFSET 0x08
#define PORTD_PCR3_OFFSET 0x0C
#define PORTD_PCR4_OFFSET 0x10
#define PORTD_PCR5_OFFSET 0x14
#define PORTD_PCR6_OFFSET 0x18
#define PORTD_PCR7_OFFSET 0x1C
#define PORTD_PCR8_OFFSET 0x20
#define PORTD_PCR9_OFFSET 0x24
#define PORTD_PCR10_OFFSET 0x28
#define PORTD_PCR11_OFFSET 0x2C
#define PORTD_PCR12_OFFSET 0x30
#define PORTD_PCR13_OFFSET 0x34
#define PORTD_PCR14_OFFSET 0x38
#define PORTD_PCR15_OFFSET 0x3C
#define PORTD_PCR16_OFFSET 0x40
#define PORTD_PCR17_OFFSET 0x44
#define PORTD_PCR18_OFFSET 0x48
#define PORTD_PCR19_OFFSET 0x4C
#define PORTD_PCR20_OFFSET 0x50
#define PORTD_PCR21_OFFSET 0x54
#define PORTD_PCR22_OFFSET 0x58
#define PORTD_PCR23_OFFSET 0x5C
#define PORTD_PCR24_OFFSET 0x60
#define PORTD_PCR25_OFFSET 0x64
#define PORTD_PCR26_OFFSET 0x68
#define PORTD_PCR27_OFFSET 0x6C
#define PORTD_PCR28_OFFSET 0x70
#define PORTD_PCR29_OFFSET 0x74
#define PORTD_PCR30_OFFSET 0x78
#define PORTD_PCR31_OFFSET 0x7C
#define PORTD_GPCLR_OFFSET 0x80
#define PORTD_GPCHR_OFFSET 0x84
#define PORTD_ISFR_OFFSET 0xA0
#define PORTD_PCR0 (PORTD_BASE + PORTD_PCR0_OFFSET)
#define PORTD_PCR1 (PORTD_BASE + PORTD_PCR1_OFFSET)
#define PORTD_PCR2 (PORTD_BASE + PORTD_PCR2_OFFSET)
#define PORTD_PCR3 (PORTD_BASE + PORTD_PCR3_OFFSET)
#define PORTD_PCR4 (PORTD_BASE + PORTD_PCR4_OFFSET)
#define PORTD_PCR5 (PORTD_BASE + PORTD_PCR5_OFFSET)
#define PORTD_PCR6 (PORTD_BASE + PORTD_PCR6_OFFSET)
#define PORTD_PCR7 (PORTD_BASE + PORTD_PCR7_OFFSET)
#define PORTD_PCR8 (PORTD_BASE + PORTD_PCR8_OFFSET)
#define PORTD_PCR9 (PORTD_BASE + PORTD_PCR9_OFFSET)
#define PORTD_PCR10 (PORTD_BASE + PORTD_PCR10_OFFSET)
#define PORTD_PCR11 (PORTD_BASE + PORTD_PCR11_OFFSET)
#define PORTD_PCR12 (PORTD_BASE + PORTD_PCR12_OFFSET)
#define PORTD_PCR13 (PORTD_BASE + PORTD_PCR13_OFFSET)
#define PORTD_PCR14 (PORTD_BASE + PORTD_PCR14_OFFSET)
#define PORTD_PCR15 (PORTD_BASE + PORTD_PCR15_OFFSET)
#define PORTD_PCR16 (PORTD_BASE + PORTD_PCR16_OFFSET)
#define PORTD_PCR17 (PORTD_BASE + PORTD_PCR17_OFFSET)
#define PORTD_PCR18 (PORTD_BASE + PORTD_PCR18_OFFSET)
#define PORTD_PCR19 (PORTD_BASE + PORTD_PCR19_OFFSET)
#define PORTD_PCR20 (PORTD_BASE + PORTD_PCR20_OFFSET)
#define PORTD_PCR21 (PORTD_BASE + PORTD_PCR21_OFFSET)
#define PORTD_PCR22 (PORTD_BASE + PORTD_PCR22_OFFSET)
#define PORTD_PCR23 (PORTD_BASE + PORTD_PCR23_OFFSET)
#define PORTD_PCR24 (PORTD_BASE + PORTD_PCR24_OFFSET)
#define PORTD_PCR25 (PORTD_BASE + PORTD_PCR25_OFFSET)
#define PORTD_PCR26 (PORTD_BASE + PORTD_PCR26_OFFSET)
#define PORTD_PCR27 (PORTD_BASE + PORTD_PCR27_OFFSET)
#define PORTD_PCR28 (PORTD_BASE + PORTD_PCR28_OFFSET)
#define PORTD_PCR29 (PORTD_BASE + PORTD_PCR29_OFFSET)
#define PORTD_PCR30 (PORTD_BASE + PORTD_PCR30_OFFSET)
#define PORTD_PCR31 (PORTD_BASE + PORTD_PCR31_OFFSET)
#define PORTD_GPCLR (PORTD_BASE + PORTD_GPCLR_OFFSET)
#define PORTD_GPCHR (PORTD_BASE + PORTD_GPCHR_OFFSET)
#define PORTD_ISFR (PORTD_BASE + PORTD_ISFR_OFFSET)
//---------------------------------------------------------------
//Port E
#define PORTE_BASE 0x4004D000
#define PORTE_PCR0_OFFSET 0x00
#define PORTE_PCR1_OFFSET 0x04
#define PORTE_PCR2_OFFSET 0x08
#define PORTE_PCR3_OFFSET 0x0C
#define PORTE_PCR4_OFFSET 0x10
#define PORTE_PCR5_OFFSET 0x14
#define PORTE_PCR6_OFFSET 0x18
#define PORTE_PCR7_OFFSET 0x1C
#define PORTE_PCR8_OFFSET 0x20
#define PORTE_PCR9_OFFSET 0x24
#define PORTE_PCR10_OFFSET 0x28
#define PORTE_PCR11_OFFSET 0x2C
#define PORTE_PCR12_OFFSET 0x30
#define PORTE_PCR13_OFFSET 0x34
#define PORTE_PCR14_OFFSET 0x38
#define PORTE_PCR15_OFFSET 0x3C
#define PORTE_PCR16_OFFSET 0x40
#define PORTE_PCR17_OFFSET 0x44
#define PORTE_PCR18_OFFSET 0x48
#define PORTE_PCR19_OFFSET 0x4C
#define PORTE_PCR20_OFFSET 0x50
#define PORTE_PCR21_OFFSET 0x54
#define PORTE_PCR22_OFFSET 0x58
#define PORTE_PCR23_OFFSET 0x5C
#define PORTE_PCR24_OFFSET 0x60
#define PORTE_PCR25_OFFSET 0x64
#define PORTE_PCR26_OFFSET 0x68
#define PORTE_PCR27_OFFSET 0x6C
#define PORTE_PCR28_OFFSET 0x70
#define PORTE_PCR29_OFFSET 0x74
#define PORTE_PCR30_OFFSET 0x78
#define PORTE_PCR31_OFFSET 0x7C
#define PORTE_GPCLR_OFFSET 0x80
#define PORTE_GPCHR_OFFSET 0x84
#define PORTE_ISFR_OFFSET 0xA0
#define PORTE_PCR0 (PORTE_BASE + PORTE_PCR0_OFFSET)
#define PORTE_PCR1 (PORTE_BASE + PORTE_PCR1_OFFSET)
#define PORTE_PCR2 (PORTE_BASE + PORTE_PCR2_OFFSET)
#define PORTE_PCR3 (PORTE_BASE + PORTE_PCR3_OFFSET)
#define PORTE_PCR4 (PORTE_BASE + PORTE_PCR4_OFFSET)
#define PORTE_PCR5 (PORTE_BASE + PORTE_PCR5_OFFSET)
#define PORTE_PCR6 (PORTE_BASE + PORTE_PCR6_OFFSET)
#define PORTE_PCR7 (PORTE_BASE + PORTE_PCR7_OFFSET)
#define PORTE_PCR8 (PORTE_BASE + PORTE_PCR8_OFFSET)
#define PORTE_PCR9 (PORTE_BASE + PORTE_PCR9_OFFSET)
#define PORTE_PCR10 (PORTE_BASE + PORTE_PCR10_OFFSET)
#define PORTE_PCR11 (PORTE_BASE + PORTE_PCR11_OFFSET)
#define PORTE_PCR12 (PORTE_BASE + PORTE_PCR12_OFFSET)
#define PORTE_PCR13 (PORTE_BASE + PORTE_PCR13_OFFSET)
#define PORTE_PCR14 (PORTE_BASE + PORTE_PCR14_OFFSET)
#define PORTE_PCR15 (PORTE_BASE + PORTE_PCR15_OFFSET)
#define PORTE_PCR16 (PORTE_BASE + PORTE_PCR16_OFFSET)
#define PORTE_PCR17 (PORTE_BASE + PORTE_PCR17_OFFSET)
#define PORTE_PCR18 (PORTE_BASE + PORTE_PCR18_OFFSET)
#define PORTE_PCR19 (PORTE_BASE + PORTE_PCR19_OFFSET)
#define PORTE_PCR20 (PORTE_BASE + PORTE_PCR20_OFFSET)
#define PORTE_PCR21 (PORTE_BASE + PORTE_PCR21_OFFSET)
#define PORTE_PCR22 (PORTE_BASE + PORTE_PCR22_OFFSET)
#define PORTE_PCR23 (PORTE_BASE + PORTE_PCR23_OFFSET)
#define PORTE_PCR24 (PORTE_BASE + PORTE_PCR24_OFFSET)
#define PORTE_PCR25 (PORTE_BASE + PORTE_PCR25_OFFSET)
#define PORTE_PCR26 (PORTE_BASE + PORTE_PCR26_OFFSET)
#define PORTE_PCR27 (PORTE_BASE + PORTE_PCR27_OFFSET)
#define PORTE_PCR28 (PORTE_BASE + PORTE_PCR28_OFFSET)
#define PORTE_PCR29 (PORTE_BASE + PORTE_PCR29_OFFSET)
#define PORTE_PCR30 (PORTE_BASE + PORTE_PCR30_OFFSET)
#define PORTE_PCR31 (PORTE_BASE + PORTE_PCR31_OFFSET)
#define PORTE_GPCLR (PORTE_BASE + PORTE_GPCLR_OFFSET)
#define PORTE_GPCHR (PORTE_BASE + PORTE_GPCHR_OFFSET)
#define PORTE_ISFR (PORTE_BASE + PORTE_ISFR_OFFSET)
//---------------------------------------------------------------
//System integration module (SIM)
#define SIM_BASE 0x40047000
#define SIM_SOPT1_OFFSET 0x00
#define SIM_SOPT1CFG_OFFSET 0x04
#define SIM_SOPT2_OFFSET 0x1004
#define SIM_SOPT4_OFFSET 0x100C
#define SIM_SOPT5_OFFSET 0x1010
#define SIM_SOPT7_OFFSET 0x1018
#define SIM_SDID_OFFSET 0x1024
#define SIM_SCGC4_OFFSET 0x1034
#define SIM_SCGC5_OFFSET 0x1038
#define SIM_SCGC6_OFFSET 0x103C
#define SIM_SCGC7_OFFSET 0x1040
#define SIM_CLKDIV1_OFFSET 0x1044
#define SIM_FCFG1_OFFSET 0x104C
#define SIM_FCFG2_OFFSET 0x1050
#define SIM_UIDMH_OFFSET 0x1058
#define SIM_UIDML_OFFSET 0x105C
#define SIM_UIDL_OFFSET 0x1060
#define SIM_COPC_OFFSET 0x1100
#define SIM_SRVCOP_OFFSET 0x1104
#define SIM_CLKDIV1 (SIM_BASE + SIM_CLKDIV1_OFFSET)
#define SIM_COPC (SIM_BASE + SIM_COPC_OFFSET)
#define SIM_FCFG1 (SIM_BASE + SIM_FCFG1_OFFSET)
#define SIM_FCFG2 (SIM_BASE + SIM_FCFG2_OFFSET)
#define SIM_SCGC4 (SIM_BASE + SIM_SCGC4_OFFSET)
#define SIM_SCGC5 (SIM_BASE + SIM_SCGC5_OFFSET)
#define SIM_SCGC6 (SIM_BASE + SIM_SCGC6_OFFSET)
#define SIM_SCGC7 (SIM_BASE + SIM_SCGC7_OFFSET)
#define SIM_SDID (SIM_BASE + SIM_SDID_OFFSET)
#define SIM_SOPT1 (SIM_BASE + SIM_SOPT1_OFFSET)
#define SIM_SOPT1CFG (SIM_BASE + SIM_SOPT1CFG_OFFSET)
#define SIM_SOPT2 (SIM_BASE + SIM_SOPT2_OFFSET)
#define SIM_SOPT4 (SIM_BASE + SIM_SOPT4_OFFSET)
#define SIM_SOPT5 (SIM_BASE + SIM_SOPT5_OFFSET)
#define SIM_SOPT7 (SIM_BASE + SIM_SOPT7_OFFSET)
#define SIM_SRVCOP (SIM_BASE + SIM_SRVCOP_OFFSET)
#define SIM_UIDL (SIM_BASE + SIM_UIDL_OFFSET)
#define SIM_UIDMH (SIM_BASE + SIM_UIDMH_OFFSET)
#define SIM_UIDML (SIM_BASE + SIM_UIDML_OFFSET)
//---------------------------------------------------------------
//SIM_CLKDIV1
//31-28:OUTDIV1=clock 1 output divider value
//             :set divider for core/system clock,
//             :from which bus/flash clocks are derived
//             :divide by OUTDIV1 + 1
//27-19:Reserved// read-only// always 0
//18-16:OUTDIV4=clock 4 output divider value
//             :sets divider for bus and flash clocks,
//             :relative to core/system clock
//             :divide by OUTDIV4 + 1
//15-00:Reserved// read-only// always 0
#define SIM_CLKDIV1_OUTDIV1_MASK 0xF0000000
#define SIM_CLKDIV1_OUTDIV1_SHIFT 28
#define SIM_CLKDIV1_OUTDIV4_MASK 0x00070000
#define SIM_CLKDIV1_OUTDIV4_SHIFT 16
//---------------------------------------------------------------
//SIM_COPC
//31-04:Reserved// read-only// always 0
//03-02:COPT=COP watchdog timeout
//          :00=disabled
//          :01=timeout after 2^5 LPO cycles or 2^13 bus cycles
//          :10=timeout after 2^8 LPO cycles or 2^16 bus cycles
//          :11=timeout after 2^10 LPO cycles or 2^18 bus cycles
//   01:COPCLKS=COP clock select
//             :0=internal 1 kHz
//             :1=bus clock
//   00:COPW=COP windowed mode
#define COP_COPT_MASK 0x0000000C
#define COP_COPT_SHIFT 2
#define COP_COPCLKS_MASK 0x00000002
#define COP_COPCLKS_SHIFT 1
#define COP_COPW_MASK 0x00000001
#define COP_COPW_SHIFT 1
//---------------------------------------------------------------
//SIM_SCGC4
//1->31-28:Reserved// read-only// always 1
//0->27-24:Reserved// read-only// always 0
//0->   23:SPI1=SPI1 clock gate control (disabled)
//0->   22:SPI0=SPI0 clock gate control (disabled)
//0->21-20:Reserved// read-only// always 0
//0->   19:CMP=comparator clock gate control (disabled)
//0->   18:USBOTG=USB clock gate control (disabled)
//0->17-14:Reserved// read-only// always 0
//0->   13:Reserved// read-only// always 0
//0->   12:UART2=UART2 clock gate control (disabled)
//1->   11:UART1=UART1 clock gate control (disabled)
//0->   10:UART0=UART0 clock gate control (disabled)
//0->09-08:Reserved// read-only// always 0
//0->   07:I2C1=I2C1 clock gate control (disabled)
//0->   06:I2C0=I2C0 clock gate control (disabled)
//1->05-04:Reserved// read-only// always 1
//0->03-00:Reserved// read-only// always 0
#define SIM_SCGC4_SPI1_MASK 0x00800000
#define SIM_SCGC4_SPI1_SHIFT 23
#define SIM_SCGC4_SPI0_MASK 0x00400000
#define SIM_SCGC4_SPI0_SHIFT 22
#define SIM_SCGC4_CMP_MASK 0x00080000
#define SIM_SCGC4_CMP_SHIFT 19
#define SIM_SCGC4_USBOTG_MASK 0x00040000
#define SIM_SCGC4_USBOTG_SHIFT 18
#define SIM_SCGC4_UART2_MASK 0x00001000
#define SIM_SCGC4_UART2_SHIFT 12
#define SIM_SCGC4_UART1_MASK 0x00000800
#define SIM_SCGC4_UART1_SHIFT 11
#define SIM_SCGC4_UART0_MASK 0x00000400
#define SIM_SCGC4_UART0_SHIFT 10
#define SIM_SCGC4_I2C1_MASK 0x00000080
#define SIM_SCGC4_I2C1_SHIFT 7
#define SIM_SCGC4_I2C0_MASK 0x00000040
#define SIM_SCGC4_I2C0_SHIFT 6
//---------------------------------------------------------------
//SIM_SCGC5
//31-20:Reserved// read-only// always 0
//   19:SLCD=segment LCD clock gate control
//18-14:Reserved// read-only// always 0
//   13:PORTE=Port E clock gate control
//   12:PORTD=Port D clock gate control
//   11:PORTC=Port C clock gate control
//   10:PORTB=Port B clock gate control
//    9:PORTA=Port A clock gate control
//08-07:Reserved// read-only// always 1
//    6:Reserved// read-only// always 0
//    5:TSI=TSI access control
//04-02:Reserved// read-only// always 0
//    1:Reserved// read-only// always 0
//    0:LPTMR=Low power timer access control
#define SIM_SCGC5_SLCD_MASK 0x00080000
#define SIM_SCGC5_SLCD_SHIFT 19
#define SIM_SCGC5_PORTE_MASK 0x00002000
#define SIM_SCGC5_PORTE_SHIFT 13
#define SIM_SCGC5_PORTD_MASK 0x00001000
#define SIM_SCGC5_PORTD_SHIFT 12
#define SIM_SCGC5_PORTC_MASK 0x00000800
#define SIM_SCGC5_PORTC_SHIFT 11
#define SIM_SCGC5_PORTB_MASK 0x00000400
#define SIM_SCGC5_PORTB_SHIFT 10
#define SIM_SCGC5_PORTA_MASK 0x00000200
#define SIM_SCGC5_PORTA_SHIFT 9
#define SIM_SCGC5_TSI_MASK 0x00000020
#define SIM_SCGC5_TSI_SHIFT 6
#define SIM_SCGC5_LPTMR_MASK 0x00000001
#define SIM_SCGC5_LPTMR_SHIFT 0
//---------------------------------------------------------------
//SIM_SCGC6
//   31:DAC0=DAC0 clock gate control
//   30:(reserved):read-only:0
//   29:RTC=RTC access control
//   28:(reserved):read-only:0
//   27:ADC0=ADC0 clock gate control
//   26:TPM2=TPM2 clock gate control
//   25:TPM1=TMP1 clock gate control
//   24:TPM0=TMP0 clock gate control
//   23:PIT=PIT clock gate control
//22-16:(reserved)
//   15:(reserved)
//14-02:(reserved)
//    1:DMAMUX=DMA mux clock gate control
//    0:FTF=flash memory clock gate control
#define SIM_SCGC6_DAC0_MASK 0x80000000
#define SIM_SCGC6_DAC0_SHIFT 31
#define SIM_SCGC6_RTC_MASK 0x20000000
#define SIM_SCGC6_RTC_SHIFT 29
#define SIM_SCGC6_ADC0_MASK 0x08000000
#define SIM_SCGC6_ADC0_SHIFT 27
#define SIM_SCGC6_TPM2_MASK 0x04000000
#define SIM_SCGC6_TPM2_SHIFT 26
#define SIM_SCGC6_TPM1_MASK 0x02000000
#define SIM_SCGC6_TPM1_SHIFT 25
#define SIM_SCGC6_TPM0_MASK 0x01000000
#define SIM_SCGC6_TPM0_SHIFT 24
#define SIM_SCGC6_PIT_MASK 0x00800000
#define SIM_SCGC6_PIT_SHIFT 23
#define SIM_SCGC6_DMAMUX_MASK 0x00000002
#define SIM_SCGC6_DMAMUX_SHIFT 1
#define SIM_SCGC6_FTF_MASK 0x00000001
#define SIM_SCGC6_FTF_SHIFT 0
//---------------------------------------------------------------
//SIM_SOPT1 (POR or LVD:  0x80000000)
//   31:USBREGEN=USB voltage regulator enable (1)
//   30:USBSSTBY=USB voltage regulator standby during stop, VLPS, LLS, and VLLS (0)
//   29:USBVSTBY=USB voltage regulator standby during VLPS and VLLS (0)
//28-20:(reserved):read-only:000000000
//19-18:OSC32KSEL=32K oscillator clock select (00)
//      (ERCLK32K for sLCD, RTC, and LPTMR)
//                00:System oscillator (OSC32KCLK)
//                01:(reserved)
//                10:RTC_CLKIN
//                11:LPO 1kHz
// 17-6:(reserved):read-only:000000000000
//  5-0:(reserved)
#define SIM_SOPT1_OSC32KSEL_MASK 0xC0000
#define SIM_SOPT1_OSC32KSEL_SHIFT 18
#define SIM_SOPT1_USBVSTBY_MASK 0x20000000
#define SIM_SOPT1_USBVSTBY_SHIFT 29
#define SIM_SOPT1_USBSSTBY_MASK 0x40000000
#define SIM_SOPT1_USBSSTBY_SHIFT 30
#define SIM_SOPT1_USBREGEN_MASK 0x80000000
#define SIM_SOPT1_USBREGEN_SHIFT 31
//---------------------------------------------------------------
//SIM_SOPT2
//31-28:(reserved):read-only:0
//27-26:UART0SRC=UART0 clock source select
//               00:clock disabled
//               01:MCGFLLCLK or MCGPLLCLK/2
//               10:OSCERCLK
//               11:MCGIRCLK
//25-24:TPMSRC=TPM clock source select
//             00:clock disabled
//             01:MCGFLLCLK or MCGPLLCLK/2
//             10:OSCERCLK
//             11:MCGIRCLK
//23-19:(reserved):read-only:0
//   18:USBSRC=USB clock source select
//             0:USB_CLKIN
//             1:MCGFLLCLK or MCGPLLCLK/2
//   17:(reserved):read-only:0
//   16:PLLFLLSEL=PLL/FLL clock select
//             0:MCGFLLCLK
//             1:MCGPLLCLK/2
//15- 8:(reserved):read-only:0
// 7- 5:CLKOUTSEL=CLKOUT select
//                000:(reserved)
//                001:(reserved)
//                010:bus clock
//                011:LPO clock (1 KHz)
//                100:MCGIRCLK
//                101:(reserved)
//                110:OSCERCLK
//                110:(reserved)
//    4:RTCCLKOUTSEL=RTC clock out select
//                   0:RTC (1 Hz)
//                   1:OSCERCLK
// 3- 0:(reserved):read-only:0
#define SIM_SOPT2_UART0SRC_MASK 0x0C000000
#define SIM_SOPT2_UART0SRC_SHIFT 26
#define SIM_SOPT2_TPMSRC_MASK 0x03000000
#define SIM_SOPT2_TPMSRC_SHIFT 24
#define SIM_SOPT2_USBSRC_MASK 0x00040000
#define SIM_SOPT2_USBSRC_SHIFT 18
#define SIM_SOPT2_PLLFLLSEL_MASK 0x00010000
#define SIM_SOPT2_PLLFLLSEL_SHIFT 16
#define SIM_SOPT2_CLKOUTSEL_MASK 0xE0
#define SIM_SOPT2_CLKOUTSEL_SHIFT 5
#define SIM_SOPT2_RTCCLKOUTSEL_MASK 0x10
#define SIM_SOPT2_RTCCLKOUTSEL_SHIFT 4
//---------------------------------------------------------------
//SIM_SOPT5
//31-20:Reserved// read-only// always 0
//   19:Reserved// read-only// always 0
//   18:UART2ODE=UART2 open drain enable
//   17:UART1ODE=UART1 open drain enable
//   16:UART0ODE=UART0 open drain enable
//15-07:Reserved// read-only// always 0
//   06:UART1TXSRC=UART1 receive data select
//                :0=UART1_RX pin
//                :1=CMP0 output
//05-04:UART1TXSRC=UART1 transmit data select source
//                :00=UART1_TX pin
//                :01=UART1_TX pin modulated with TPM1 channel 0 output
//                :10=UART1_TX pin modulated with TPM2 channel 0 output
//                :11=(reserved)
//   03:Reserved// read-only// always 0
//   02:UART0RXSRC=UART0 receive data select
//                :0=UART0_RX pin
//                :1=CMP0 output
//01-00:UART0TXSRC=UART0 transmit data select source
//                :00=UART0_TX pin
//                :01=UART0_TX pin modulated with TPM1 channel 0 output
//                :10=UART0_TX pin modulated with TPM2 channel 0 output
//                :11=(reserved)
#define SIM_SOPT5_UART2ODE_MASK 0x00040000
#define SIM_SOPT5_UART2ODE_SHIFT 18
#define SIM_SOPT5_UART1ODE_MASK 0x00020000
#define SIM_SOPT5_UART1ODE_SHIFT 17
#define SIM_SOPT5_UART0ODE_MASK 0x00010000
#define SIM_SOPT5_UART0ODE_SHIFT 16
#define SIM_SOPT5_UART1RXSRC_MASK 0x00000040
#define SIM_SOPT5_UART1RXSRC_SHIFT 6
#define SIM_SOPT5_UART1TXSRC_MASK 0x00000030
#define SIM_SOPT5_UART1TXSRC_SHIFT 4
#define SIM_SOPT5_UART0RXSRC_MASK 0x00000004
#define SIM_SOPT5_UART0RXSRC_SHIFT 2
#define SIM_SOPT5_UART0TXSRC_MASK 0x00000003
#define SIM_SOPT5_UART0TXSRC_SHIFT 0
//---------------------------------------------------------------
//Timer/PWM modules (TPMx)
#define TPM_SC_OFFSET 0x00
#define TPM_CNT_OFFSET 0x04
#define TPM_MOD_OFFSET 0x08
#define TPM_C0SC_OFFSET 0x0C
#define TPM_C0V_OFFSET 0x10
#define TPM_C1SC_OFFSET 0x14
#define TPM_C1V_OFFSET 0x18
#define TPM_C2SC_OFFSET 0x1C
#define TPM_C2V_OFFSET 0x20
#define TPM_C3SC_OFFSET 0x24
#define TPM_C3V_OFFSET 0x28
#define TPM_C4SC_OFFSET 0x2C
#define TPM_C4V_OFFSET 0x30
#define TPM_C5SC_OFFSET 0x34
#define TPM_C5V_OFFSET 0x38
#define TPM_STATUS_OFFSET 0x50
#define TPM_CONF_OFFSET 0x84
//---------------------------------------------------------------
//TPMx_CnSC:  Channel n Status and Control
//31-8:(reserved):read-only:0
//   7:CHF=channel flag
//         set on channel event
//         write 1 to clear
//   6:CHIE=channel interrupt enable
//   5:MSB=channel mode select B (see selection table below)
//   4:MSA=channel mode select A (see selection table below)
//   3:ELSB=edge or level select B (see selection table below)
//   2:ELSA=edge or level select A (see selection table below)
//   1:(reserved):read-only:0
//   0:DMA=DMA enable
//Mode, Edge, and Level Selection
//MSB:MSA | ELSB:ELSA | Mode           | Configuration
//  0 0   |    0 0    | (none)         | channel disabled
//  0 1   |    0 0    | SW compare     | pin not used
//  1 X   |    0 0    | SW compare     | pin not used
//  0 0   |    0 1    | input capture  | rising edge
//  0 0   |    1 0    | input capture  | falling edge
//  0 0   |    1 1    | input capture  | either edge
//  0 1   |    0 1    | output compare | toggle on match
//  0 1   |    1 0    | output compare | clear on match
//  0 1   |    1 1    | output compare | set on match
//  1 0   |    X 1    | PWM            | low pulse
//  1 0   |    1 0    | PWM            | high pulse
//  1 1   |    X 1    | output compare | pulse high on match
//  1 1   |    1 0    | output compare | pulse low on match
#define TPM_CnSC_CHF_MASK 0x80
#define TPM_CnSC_CHF_SHIFT 7
#define TPM_CnSC_CHIE_MASK 0x40
#define TPM_CnSC_CHIE_SHIFT 6
#define TPM_CnSC_MSB_MASK 0x20
#define TPM_CnSC_MSB_SHIFT 5
#define TPM_CnSC_MSA_MASK 0x10
#define TPM_CnSC_MSA_SHIFT 4
#define TPM_CnSC_ELSB_MASK 0x08
#define TPM_CnSC_ELSB_SHIFT 3
#define TPM_CnSC_ELSA_MASK 0x04
#define TPM_CnSC_ELSA_SHIFT 2
#define TPM_CnSC_CDMA_MASK 0x01
#define TPM_CnSC_CDMA_SHIFT 0
//---------------------------------------------------------------
//TPMx_CnV:  Channel n Value
//31-16:(reserved):read-only:0
//16- 0:MOD (all bytes must be written at the same time)
#define TPM_CnV_VAL_MASK 0xFFFF
#define TPM_CnV_VAL_SHIFT 0
//---------------------------------------------------------------
//TPMx_CONF:  Configuration
//31-28:(reserved):read-only:0
//27-24:TRGSEL=trigger select
//             should be changed only when counter disabled
//             0000:EXTRG_IN (external trigger pin input)
//             0001:CMP0 output
//             0010:(reserved)
//             0011:(reserved)
//             0100:PIT trigger 0
//             0101:PIT trigger 1
//             0110:(reserved)
//             0111:(reserved)
//             1000:TPM0 overflow
//             1001:TPM1 overflow
//             1010:TPM2 overflow
//             1011:(reserved)
//             1100:RTC alarm
//             1101:RTC seconds
//             1110:LPTMR trigger
//             1111:(reserved)
//23-19:(reserved):read-only:0
//   18:CROT=counter reload on trigger
//           should be changed only when counter disabled
//   17:CSOO=counter stop on overflow
//           should be changed only when counter disabled
//   16:CSOT=counter start on trigger
//           should be changed only when counter disabled
//15-10:(reserved):read-only:0
//    9:GTBEEN=global time base enable
//    8:(reserved):read-only:0
// 7- 6:DBGMODE=debug mode
