PyroAVR/FRDM-KL46Z/MKL46Z4_Constants.h
//              00:paused during debug, and during debug
//                 trigger and input caputure events ignored
//              01:(reserved)
//              10:(reserved)
//              11:counter continues during debug
//    5:DOZEEN=doze enable
//             0:counter continues during debug
//             1:paused during debug, and during debug
//               trigger and input caputure events ignored
// 4- 0:(reserved):read-only:0
#define TPM_CONF_TRGSEL_MASK 0x0F000000
#define TPM_CONF_TRGSEL_SHIFT 24
#define TPM_CONF_CROT_MASK 0x00040000
#define TPM_CONF_CROT_SHIFT 18
#define TPM_CONF_CSOO_MASK 0x00020000
#define TPM_CONF_CSOO_SHIFT 17
#define TPM_CONF_CSOT_MASK 0x00010000
#define TPM_CONF_CSOT_SHIFT 16
#define TPM_CONF_GTBEEN_MASK 0x200
#define TPM_CONF_GTBEEN_SHIFT 9
#define TPM_CONF_DBGMODE_MASK 0xC0
#define TPM_CONF_DBGMODE_SHIFT 6
#define TPM_CONF_DOZEEN_MASK 0x20
#define TPM_CONF_DOZEEN_SHIFT 5
//---------------------------------------------------------------
//TPMx_MOD:  Modulo
//31-16:(reserved):read-only:0
//16- 0:MOD (all bytes must be written at the same time)
#define TPM_MOD_MOD_MASK 0xFFFF
#define TPM_MOD_MOD_SHIFT 0xFFFF
//---------------------------------------------------------------
//TPMx_SC:  Status and Control
//31-9:(reserved):read-only:0
//   8:DMA=DMA enable
//   7:TOF=timer overflow flag
//         set on count after TPMx_CNT = TPMx_MOD
//         write 1 to clear
//   6:TOIE=timer overflow interrupt enable
//   5:CPWMS=center-aligned PWM select
//           0:edge align (up count)
//           1:center align (up-down count)
// 4-3:CMOD=clock mode selection
//          00:counter disabled
//          01:TPMx_CNT increments on every TPMx clock
//          10:TPMx_CNT increments on rising edge of TPMx_EXTCLK
//          11:(reserved)
// 2-0:PS=prescale factor selection
//        can be written only when counter is disabled
//        count clock = CMOD selected clock / 2^PS
#define TPM_SC_DMA_MASK 0x100
#define TPM_SC_DMA_SHIFT 8
#define TPM_SC_TOF_MASK 0x80
#define TPM_SC_TOF_SHIFT 7
#define TPM_SC_TOIE_MASK 0x40
#define TPM_SC_TOIE_SHIFT 6
#define TPM_SC_CPWMS_MASK 0x20
#define TPM_SC_CPWMS_SHIFT 5
#define TPM_SC_CMOD_MASK 0x18
#define TPM_SC_CMOD_SHIFT 3
#define TPM_SC_PS_MASK 0x07
#define TPM_SC_PS_SHIFT 0
//---------------------------------------------------------------
//TPMx_STATUS:  Capture and Compare Status
//31-9:(reserved):read-only:0
//   8:TOF=timer overflow flag=TPMx_SC.TOF
// 7-6:(reserved):read-only:0
//   5:CH5F=channel 5 flag=TPMx_C5SC.CHF
//   4:CH4F=channel 4 flag=TPMx_C4SC.CHF
//   3:CH3F=channel 3 flag=TPMx_C3SC.CHF
//   2:CH2F=channel 2 flag=TPMx_C2SC.CHF
//   1:CH1F=channel 1 flag=TPMx_C1SC.CHF
//   0:CH0F=channel 0 flag=TPMx_C0SC.CHF
#define TPM_STATUS_TOF_MASK 0x100
#define TPM_STATUS_TOF_SHIFT 8
#define TPM_STATUS_CH5F_MASK 0x20
#define TPM_STATUS_CH5F_SHIFT 5
#define TPM_STATUS_CH4F_MASK 0x10
#define TPM_STATUS_CH4F_SHIFT 4
#define TPM_STATUS_CH3F_MASK 0x08
#define TPM_STATUS_CH3F_SHIFT 3
#define TPM_STATUS_CH2F_MASK 0x04
#define TPM_STATUS_CH2F_SHIFT 2
#define TPM_STATUS_CH1F_MASK 0x02
#define TPM_STATUS_CH1F_SHIFT 1
#define TPM_STATUS_CH0F_MASK 0x01
#define TPM_STATUS_CH0F_SHIFT 0
//---------------------------------------------------------------
//Timer/PWM module 0 (TPM0)
#define TPM0_BASE 0x40038000
#define TPM0_SC (TPM0_BASE + TPM_SC_OFFSET    )
#define TPM0_CNT (TPM0_BASE + TPM_CNT_OFFSET   )
#define TPM0_MOD (TPM0_BASE + TPM_MOD_OFFSET   )
#define TPM0_C0SC (TPM0_BASE + TPM_C0SC_OFFSET  )
#define TPM0_C0V (TPM0_BASE + TPM_C0V_OFFSET   )
#define TPM0_C1SC (TPM0_BASE + TPM_C1SC_OFFSET  )
#define TPM0_C1V (TPM0_BASE + TPM_C1V_OFFSET   )
#define TPM0_C2SC (TPM0_BASE + TPM_C2SC_OFFSET  )
#define TPM0_C2V (TPM0_BASE + TPM_C2V_OFFSET   )
#define TPM0_C3SC (TPM0_BASE + TPM_C3SC_OFFSET  )
#define TPM0_C3V (TPM0_BASE + TPM_C3V_OFFSET   )
#define TPM0_C4SC (TPM0_BASE + TPM_C4SC_OFFSET  )
#define TPM0_C4V (TPM0_BASE + TPM_C4V_OFFSET   )
#define TPM0_C5SC (TPM0_BASE + TPM_C5SC_OFFSET  )
#define TPM0_C5V (TPM0_BASE + TPM_C5V_OFFSET   )
#define TPM0_STATUS (TPM0_BASE + TPM_STATUS_OFFSET)
#define TPM0_CONF (TPM0_BASE + TPM_CONF_OFFSET  )
//---------------------------------------------------------------
//Timer/PWM module 1 (TPM1)
#define TPM1_BASE 0x40039000
#define TPM1_SC (TPM1_BASE + TPM_SC_OFFSET    )
#define TPM1_CNT (TPM1_BASE + TPM_CNT_OFFSET   )
#define TPM1_MOD (TPM1_BASE + TPM_MOD_OFFSET   )
#define TPM1_C0SC (TPM1_BASE + TPM_C0SC_OFFSET  )
#define TPM1_C0V (TPM1_BASE + TPM_C0V_OFFSET   )
#define TPM1_C1SC (TPM1_BASE + TPM_C1SC_OFFSET  )
#define TPM1_C1V (TPM1_BASE + TPM_C1V_OFFSET   )
#define TPM1_C2SC (TPM1_BASE + TPM_C2SC_OFFSET  )
#define TPM1_C2V (TPM1_BASE + TPM_C2V_OFFSET   )
#define TPM1_C3SC (TPM1_BASE + TPM_C3SC_OFFSET  )
#define TPM1_C3V (TPM1_BASE + TPM_C3V_OFFSET   )
#define TPM1_C4SC (TPM1_BASE + TPM_C4SC_OFFSET  )
#define TPM1_C4V (TPM1_BASE + TPM_C4V_OFFSET   )
#define TPM1_C5SC (TPM1_BASE + TPM_C5SC_OFFSET  )
#define TPM1_C5V (TPM1_BASE + TPM_C5V_OFFSET   )
#define TPM1_STATUS (TPM1_BASE + TPM_STATUS_OFFSET)
#define TPM1_CONF (TPM1_BASE + TPM_CONF_OFFSET  )
//---------------------------------------------------------------
//Timer/PWM module 2 (TPM2)
#define TPM2_BASE 0x4003A000
#define TPM2_SC (TPM2_BASE + TPM_SC_OFFSET    )
#define TPM2_CNT (TPM2_BASE + TPM_CNT_OFFSET   )
#define TPM2_MOD (TPM2_BASE + TPM_MOD_OFFSET   )
#define TPM2_C0SC (TPM2_BASE + TPM_C0SC_OFFSET  )
#define TPM2_C0V (TPM2_BASE + TPM_C0V_OFFSET   )
#define TPM2_C1SC (TPM2_BASE + TPM_C1SC_OFFSET  )
#define TPM2_C1V (TPM2_BASE + TPM_C1V_OFFSET   )
#define TPM2_C2SC (TPM2_BASE + TPM_C2SC_OFFSET  )
#define TPM2_C2V (TPM2_BASE + TPM_C2V_OFFSET   )
#define TPM2_C3SC (TPM2_BASE + TPM_C3SC_OFFSET  )
#define TPM2_C3V (TPM2_BASE + TPM_C3V_OFFSET   )
#define TPM2_C4SC (TPM2_BASE + TPM_C4SC_OFFSET  )
#define TPM2_C4V (TPM2_BASE + TPM_C4V_OFFSET   )
#define TPM2_C5SC (TPM2_BASE + TPM_C5SC_OFFSET  )
#define TPM2_C5V (TPM2_BASE + TPM_C5V_OFFSET   )
#define TPM2_STATUS (TPM2_BASE + TPM_STATUS_OFFSET)
#define TPM2_CONF (TPM2_BASE + TPM_CONF_OFFSET  )
//---------------------------------------------------------------
//UART 0
#define UART0_BASE 0x4006A000
#define UART0_BDH_OFFSET 0x00
#define UART0_BDL_OFFSET 0x01
#define UART0_C1_OFFSET 0x02
#define UART0_C2_OFFSET 0x03
#define UART0_S1_OFFSET 0x04
#define UART0_S2_OFFSET 0x05
#define UART0_C3_OFFSET 0x06
#define UART0_D_OFFSET 0x07
#define UART0_MA1_OFFSET 0x08
#define UART0_MA2_OFFSET 0x09
#define UART0_C4_OFFSET 0x0A
#define UART0_C5_OFFSET 0x0B
#define UART0_BDH (UART0_BASE + UART0_BDH_OFFSET)
#define UART0_BDL (UART0_BASE + UART0_BDL_OFFSET)
#define UART0_C1 (UART0_BASE + UART0_C1_OFFSET)
#define UART0_C2 (UART0_BASE + UART0_C2_OFFSET)
#define UART0_S1 (UART0_BASE + UART0_S1_OFFSET)
#define UART0_S2 (UART0_BASE + UART0_S2_OFFSET)
#define UART0_C3 (UART0_BASE + UART0_C3_OFFSET)
#define UART0_D (UART0_BASE + UART0_D_OFFSET)
#define UART0_MA1 (UART0_BASE + UART0_MA1_OFFSET)
#define UART0_MA2 (UART0_BASE + UART0_MA2_OFFSET)
#define UART0_C4 (UART0_BASE + UART0_C4_OFFSET)
#define UART0_C5 (UART0_BASE + UART0_C5_OFFSET)
//---------------------------------------------------------------
//UART0_BDH
//  7:LBKDIE=LIN break detect IE
//  6:RXEDGIE=RxD input active edge IE
//  5:SBNS=Stop bit number select
//4-0:SBR[12:0] (BUSCLK / (16 x 9600))
#define UART0_BDH_LBKDIE_MASK 0x80
#define UART0_BDH_LBKDIE_SHIFT 7
#define UART0_BDH_RXEDGIE_MASK 0x40
#define UART0_BDH_RXEDGIE_SHIFT 6
#define UART0_BDH_SBNS_MASK 0x20
#define UART0_BDH_SBNS_SHIFT 5
#define UART0_BDH_SBR_MASK 0x1F
#define UART0_BDH_SBR_SHIFT 0
//---------------------------------------------------------------
//UART0_BDL
//7-0:SBR[7:0] (BUSCLK / 16 x 9600))
#define UART0_BDL_SBR_MASK 0xFF
#define UART0_BDL_SBR_SHIFT 0
//---------------------------------------------------------------
//UART0_C1
//7:LOOPS=loop mode select (normal)
//6:DOZEEN=UART disabled in wait mode (enabled)
//5:RSRC=receiver source select (internal--no effect LOOPS=0)
//4:M=9- or 8-bit mode select (1 start, 8 data [lsb first], 1 stop)
//3:WAKE=receiver wakeup method select (idle)
//2:IDLE=idle line type select (idle begins after start bit)
//1:PE=parity enable (disabled)
//0:PT=parity type (even parity--no effect PE=0)
#define UART0_C1_LOOPS_MASK 0x80
#define UART0_C1_LOOPS_SHIFT 7
#define UART0_C1_DOZEEN_MASK 0x40
#define UART0_C1_DOZEEN_SHIFT 6
#define UART0_C1_RSRC_MASK 0x20
#define UART0_C1_RSRC_SHIFT 5
#define UART0_C1_M_MASK 0x10
#define UART0_C1_M_SHIFT 4
#define UART0_C1_WAKE_MASK 0x08
#define UART0_C1_WAKE_SHIFT 3
#define UART0_C1_ILT_MASK 0x04
#define UART0_C1_ILT_SHIFT 2
#define UART0_C1_PE_MASK 0x02
#define UART0_C1_PE_SHIFT 1
#define UART0_C1_PT_MASK 0x01
#define UART0_C1_PT_SHIFT 0
//---------------------------------------------------------------
//UART0_C2
//7:TIE=transmitter IE for TDRE (disabled)
//6:TCIE=trasmission complete IE for TC (disabled)
//5:RIE=receiver IE for RDRF (disabled)
//4:ILIE=idle line IE for IDLE (disabled)
//3:TE=transmitter enable (disabled)
//2:RE=receiver enable (disabled)
//1:RWU=receiver wakeup control (normal)
//0:SBK=send break (disabled, normal)
#define UART0_C2_TIE_MASK 0x80
#define UART0_C2_TIE_SHIFT 7
#define UART0_C2_TCIE_MASK 0x40
#define UART0_C2_TCIE_SHIFT 6
#define UART0_C2_RIE_MASK 0x20
#define UART0_C2_RIE_SHIFT 5
#define UART0_C2_ILIE_MASK 0x10
#define UART0_C2_ILIE_SHIFT 4
#define UART0_C2_TE_MASK 0x08
#define UART0_C2_TE_SHIFT 3
#define UART0_C2_RE_MASK 0x04
#define UART0_C2_RE_SHIFT 2
#define UART0_C2_RWU_MASK 0x02
#define UART0_C2_RWU_SHIFT 1
#define UART0_C2_SBK_MASK 0x01
#define UART0_C2_SBK_SHIFT 0
//---------------------------------------------------------------
//UART0_C3
//7:R8T9=Receive bit 8// transmit bit 9 (not used M=0)
//6:R9T8=Receive bit 9// transmit bit 8 (not used M=0)
//5:TXDIR=TxD pin direction in single-wire mode 
//                        (input--no effect LOOPS=0)
//4:TXINV=transmit data inversion (not invereted)
//3:ORIE=overrun IE for OR (disabled)
//2:NEIE=noise error IE for NF (disabled)
//1:FEIE=framing error IE for FE (disabled)
//0:PEIE=parity error IE for PF (disabled)
#define UART0_C3_R8T9_MASK 0x80
#define UART0_C3_R8T9_SHIFT 7
#define UART0_C3_R9T8_MASK 0x40
#define UART0_C3_R9T8_SHIFT 6
#define UART0_C3_TXDIR_MASK 0x20
#define UART0_C3_TXDIR_SHIFT 5
#define UART0_C3_TXINV_MASK 0x10
#define UART0_C3_TXINV_SHIFT 4
#define UART0_C3_ORIE_MASK 0x08
#define UART0_C3_ORIE_SHIFT 3
#define UART0_C3_NEIE_MASK 0x04
#define UART0_C3_NEIE_SHIFT 2
#define UART0_C3_FEIE_MASK 0x02
#define UART0_C3_FEIE_SHIFT 1
#define UART0_C3_PEIE_MASK 0x01
#define UART0_C3_PEIE_SHIFT 0
//---------------------------------------------------------------
//UART0_C4
//  7:MAEN1=Match address mode enable 1 (disabled)
//  6:MAEN2=Match address mode enable 2 (disabled)
//  5:M10=10-bit mode select (not selected)
//4-0:OSR=Over sampling ratio (01111)
//        00000 <= OSR <= 00010:  (invalid// defaults to ratio = 16)        
//        00011 <= OSR <= 11111:  ratio = OSR + 1
#define UART0_C4_MAEN1_MASK 0x80
#define UART0_C4_MAEN1_SHIFT 7
#define UART0_C4_MAEN2_MASK 0x40
#define UART0_C4_MAEN2_SHIFT 6
#define UART0_C4_M10_MASK 0x20
#define UART0_C4_M10_SHIFT 5
#define UART0_C4_OSR_MASK 0x1F
#define UART0_C4_OSR_SHIFT 0
//---------------------------------------------------------------
//UART0_C5
//  7:TDMAE=Transmitter DMA enable (disabled)
//  6:(reserved):  read-only:  0
//  5:RDMAE=Receiver full DMA enable (disabled)
//4-2:(reserved):  read-only:  000
//  1:BOTHEDGE=Both edge sampling (only rising edge)
//  0:RESYNCDIS=Resynchronization disable (enabled)
#define UART0_C5_TDMAE_MASK 0x80
#define UART0_C5_TDMAE_SHIFT 7
#define UART0_C5_RDMAE_MASK 0x20
#define UART0_C5_RDMAE_SHIFT 5
#define UART0_C5_BOTHEDGE_MASK 0x02
#define UART0_C5_BOTHEDGE_SHIFT 1
#define UART0_C5_RESYNCDIS_MASK 0x01
#define UART0_C5_RESYNCDIS_SHIFT 0
//---------------------------------------------------------------
//UART0_D
//7:R7T7=Receive data buffer bit 7// 
//       transmit data buffer bit 7
//6:R6T6=Receive data buffer bit 6// 
//       transmit data buffer bit 6
//5:R5T5=Receive data buffer bit 5// 
//       transmit data buffer bit 5
//4:R4T4=Receive data buffer bit 4// 
//       transmit data buffer bit 4
//3:R3T3=Receive data buffer bit 3// 
//       transmit data buffer bit 3
//2:R2T2=Receive data buffer bit 2// 
//       transmit data buffer bit 2
//1:R1T1=Receive data buffer bit 1// 
//       transmit data buffer bit 1
//0:R0T0=Receive data buffer bit 0// 
//       transmit data buffer bit 0
#define UART0_D_R7T7_MASK 0x80
#define UART0_D_R7T7_SHIFT 7
#define UART0_D_R6T6_MASK 0x40
#define UART0_D_R6T6_SHIFT 6
#define UART0_D_R5T5_MASK 0x20
#define UART0_D_R5T5_SHIFT 5
#define UART0_D_R4T4_MASK 0x10
#define UART0_D_R4T4_SHIFT 4
#define UART0_D_R3T3_MASK 0x08
#define UART0_D_R3T3_SHIFT 3
#define UART0_D_R2T2_MASK 0x04
#define UART0_D_R2T2_SHIFT 2
#define UART0_D_R1T1_MASK 0x02
#define UART0_D_R1T1_SHIFT 1
#define UART0_D_R0T0_MASK 0x01
#define UART0_D_R0T0_SHIFT 0
//---------------------------------------------------------------
//UART0_MA1
//7-0:MA=Match address
#define UART0_MA1_MA_MASK 0xFF
#define UART0_MA1_MA_SHIFT 0
//---------------------------------------------------------------
//UART0_MA2
//7-0:MA=Match address
#define UART0_MA2_MA_MASK 0xFF
#define UART0_MA2_MA_SHIFT 0
//---------------------------------------------------------------
//UART0_S1
//7:TDRE=transmit data register empty flag
//6:TC=transmission complete flag
//5:RDRF=receive data register full flag
//4:IDLE=idle line flag
//3:OR=receiver overrun flag
//2:NF=noise flag
//1:FE=framing error flag
//0:PF=parity error flag
#define UART0_S1_TDRE_MASK 0x80
#define UART0_S1_TDRE_SHIFT 7
#define UART0_S1_TC_MASK 0x40
#define UART0_S1_TC_SHIFT 6
#define UART0_S1_RDRF_MASK 0x20
#define UART0_S1_RDRF_SHIFT 5
#define UART0_S1_IDLE_MASK 0x10
#define UART0_S1_IDLE_SHIFT 4
#define UART0_S1_OR_MASK 0x08
#define UART0_S1_OR_SHIFT 3
#define UART0_S1_NF_MASK 0x04
#define UART0_S1_NF_SHIFT 2
#define UART0_S1_FE_MASK 0x02
#define UART0_S1_FE_SHIFT 1
#define UART0_S1_PF_MASK 0x01
#define UART0_S1_PF_SHIFT 0
//---------------------------------------------------------------
//UART0_S2
//7:LBKDIF=LIN break detect interrupt flag
//6:RXEDGIF=RxD pin active edge interrupt flag
//5:MSBF=MSB first (LSB first)
//4:RXINV=receive data inversion (not inverted)
//3:RWUID=receive wake-up idle detect (not detected)
//2:BRK13=break character generation length (10 bit times)
//1:LBKDE=LIN break detect enable (10 bit times)
//0:RAF=receiver active flag
#define UART0_S2_LBKDIF_MASK 0x80
#define UART0_S2_LBKDIF_SHIFT 7
#define UART0_S2_RXEDGIF_MASK 0x40
#define UART0_S2_RXEDGIF_SHIFT 6
#define UART0_S2_MSBF_MASK 0x20
#define UART0_S2_MSBF_SHIFT 5
#define UART0_S2_RXINV_MASK 0x10
#define UART0_S2_RXINV_SHIFT 4
#define UART0_S2_RWUID_MASK 0x08
#define UART0_S2_RWUID_SHIFT 3
#define UART0_S2_BRK13_MASK 0x04
#define UART0_S2_BRK13_SHIFT 2
#define UART0_S2_LBKDE_MASK 0x02
#define UART0_S2_LBKDE_SHIFT 1
#define UART0_S2_RAF_MASK 0x01
#define UART0_S2_RAF_SHIFT 0
//---------------------------------------------------------------
//UART 1 and UART2
#define UART_BDH_OFFSET 0x00
#define UART_BDL_OFFSET 0x01
#define UART_C1_OFFSET 0x02
#define UART_C2_OFFSET 0x03
#define UART_S1_OFFSET 0x04
#define UART_S2_OFFSET 0x05
#define UART_C3_OFFSET 0x06
#define UART_D_OFFSET 0x07
#define UART_C4_OFFSET 0x08
//---------------------------------------------------------------
//UART 1
#define UART1_BASE 0x4006B000
#define UART1_BDH (UART1_BASE + UART_BDH_OFFSET)
#define UART1_BDL (UART1_BASE + UART_BDL_OFFSET)
#define UART1_C1 (UART1_BASE + UART_C1_OFFSET)
#define UART1_C2 (UART1_BASE + UART_C2_OFFSET)
#define UART1_S1 (UART1_BASE + UART_S1_OFFSET)
#define UART1_S2 (UART1_BASE + UART_S2_OFFSET)
#define UART1_C3 (UART1_BASE + UART_C3_OFFSET)
#define UART1_D (UART1_BASE + UART_D_OFFSET)
#define UART1_C4 (UART1_BASE + UART_C4_OFFSET)
//---------------------------------------------------------------
//UART 2
#define UART2_BASE 0x4006C000
#define UART2_BDH (UART2_BASE + UART_BDH_OFFSET)
#define UART2_BDL (UART2_BASE + UART_BDL_OFFSET)
#define UART2_C1 (UART2_BASE + UART_C1_OFFSET)
#define UART2_C2 (UART2_BASE + UART_C2_OFFSET)
#define UART2_S1 (UART2_BASE + UART_S1_OFFSET)
#define UART2_S2 (UART2_BASE + UART_S2_OFFSET)
#define UART2_C3 (UART2_BASE + UART_C3_OFFSET)
#define UART2_D (UART2_BASE + UART_D_OFFSET)
#define UART2_C4 (UART2_BASE + UART_C4_OFFSET)
//---------------------------------------------------------------
//UARTx_BDH
//  7:LBKDIE=LIN break detect IE
//  6:RXEDGIE=RxD input active edge IE
//  5:SBNS=Stop bit number select
//4-0:SBR[12:0] (BUSCLK / (16 x 9600))
#define UART_BDH_LBKDIE_MASK 0x80
#define UART_BDH_LBKDIE_SHIFT 7
#define UART_BDH_RXEDGIE_MASK 0x40
#define UART_BDH_RXEDGIE_SHIFT 6
#define UART_BDH_SBNS_MASK 0x20
#define UART_BDH_SBNS_SHIFT 5
#define UART_BDH_SBR_MASK 0x1F
#define UART_BDH_SBR_SHIFT 0
//---------------------------------------------------------------
//UARTx_BDL
//7-0:SBR[7:0] (BUSCLK / 16 x 9600))
#define UART_BDL_SBR_MASK 0xFF
#define UART_BDL_SBR_SHIFT 0
//---------------------------------------------------------------
//UARTx_C1
//7:LOOPS=loops select (normal)
//6:UARTSWAI=UART stop in wait mode (disabled)
//5:RSRC=receiver source select (internal--no effect LOOPS=0)
//4:M=9- or 8-bit mode select (1 start, 8 data [lsb first], 1 stop)
//3:WAKE=receiver wakeup method select (idle)
//2:IDLE=idle line type select (idle begins after start bit)
//1:PE=parity enable (disabled)
//0:PT=parity type (even parity--no effect PE=0)
#define UART_C1_LOOPS_MASK 0x80
#define UART_C1_LOOPS_SHIFT 7
#define UART_C1_UARTSWAI_MASK 0x40
#define UART_C1_UARTSWAI_SHIFT 6
#define UART_C1_RSRC_MASK 0x20
#define UART_C1_RSRC_SHIFT 5
#define UART_C1_M_MASK 0x10
#define UART_C1_M_SHIFT 4
#define UART_C1_WAKE_MASK 0x08
#define UART_C1_WAKE_SHIFT 3
#define UART_C1_ILT_MASK 0x04
#define UART_C1_ILT_SHIFT 2
#define UART_C1_PE_MASK 0x02
#define UART_C1_PE_SHIFT 1
#define UART_C1_PT_MASK 0x01
#define UART_C1_PT_SHIFT 0
//---------------------------------------------------------------
//UARTx_C2
//7:TIE=transmit IE for TDRE (disabled)
//6:TCIE=trasmission complete IE for TC (disabled)
//5:RIE=receiver IE for RDRF (disabled)
//4:ILIE=idle line IE for IDLE (disabled)
//3:TE=transmitter enable (enabled)
//2:RE=receiver enable (enabled)
//1:RWU=receiver wakeup control (normal)
//0:SBK=send break (disabled, normal)
#define UART_C2_TIE_MASK 0x80
#define UART_C2_TIE_SHIFT 7
#define UART_C2_TCIE_MASK 0x40
#define UART_C2_TCIE_SHIFT 6
#define UART_C2_RIE_MASK 0x20
#define UART_C2_RIE_SHIFT 5
#define UART_C2_ILIE_MASK 0x10
#define UART_C2_ILIE_SHIFT 4
#define UART_C2_TE_MASK 0x08
#define UART_C2_TE_SHIFT 3
#define UART_C2_RE_MASK 0x04
#define UART_C2_RE_SHIFT 2
#define UART_C2_RWU_MASK 0x02
#define UART_C2_RWU_SHIFT 1
#define UART_C2_SBK_MASK 0x01
#define UART_C2_SBK_SHIFT 0
//---------------------------------------------------------------
//UARTx_C3
//7:R8=9th data bit for receiver (not used M=0)
//6:T8=9th data bit for transmitter (not used M=0)
//5:TXDIR=TxD pin direction in single-wire mode (no effect LOOPS=0)
//4:TXINV=transmit data inversion (not invereted)
//3:ORIE=overrun IE for OR (disabled)
//2:NEIE=noise error IE for NF (disabled)
//1:FEIE=framing error IE for FE (disabled)
//0:PEIE=parity error IE for PF (disabled)
#define UART_C3_R8_MASK 0x80
#define UART_C3_R8_SHIFT 7
#define UART_C3_T8_MASK 0x40
#define UART_C3_T8_SHIFT 6
#define UART_C3_TXDIR_MASK 0x20
#define UART_C3_TXDIR_SHIFT 5
#define UART_C3_TXINV_MASK 0x10
#define UART_C3_TXINV_SHIFT 4
#define UART_C3_ORIE_MASK 0x08
#define UART_C3_ORIE_SHIFT 3
#define UART_C3_NEIE_MASK 0x04
#define UART_C3_NEIE_SHIFT 2
#define UART_C3_FEIE_MASK 0x02
#define UART_C3_FEIE_SHIFT 1
#define UART_C3_PEIE_MASK 0x01
#define UART_C3_PEIE_SHIFT 0
//---------------------------------------------------------------
//UARTx_C4
//  7:TDMAS=transmitter DMA select (disabled)
//  6:(reserved)// read-only// always 0
//  5:RDMAS=receiver full DMA select (disabled)
//  4:(reserved)// read-only// always 0
//  3:(reserved)// read-only// always 0
//2-0:(reserved)// read-only// always 0
#define UART_C4_TDMAS_MASK 0x80
#define UART_C4_TDMAS_SHIFT 7
#define UART_C4_RDMAS_MASK 0x20
#define UART_C4_RDMAS_SHIFT 5
//---------------------------------------------------------------
//UARTx_S1
//7:TDRE=transmit data register empty flag
//6:TC=transmission complete flag
//5:RDRF=receive data register full flag
//4:IDLE=idle line flag
//3:OR=receiver overrun flag
//2:NF=noise flag
//1:FE=framing error flag
//0:PF=parity error flag
#define UART_S1_TDRE_MASK 0x80
#define UART_S1_TDRE_SHIFT 7
#define UART_S1_TC_MASK 0x40
#define UART_S1_TC_SHIFT 6
#define UART_S1_RDRF_MASK 0x20
#define UART_S1_RDRF_SHIFT 5
#define UART_S1_IDLE_MASK 0x10
#define UART_S1_IDLE_SHIFT 4
#define UART_S1_OR_MASK 0x08
#define UART_S1_OR_SHIFT 3
#define UART_S1_NF_MASK 0x04
#define UART_S1_NF_SHIFT 2
#define UART_S1_FE_MASK 0x02
#define UART_S1_FE_SHIFT 1
#define UART_S1_PF_MASK 0x01
#define UART_S1_PF_SHIFT 0
//---------------------------------------------------------------
//UARTx_S2
//7:LBKDIF=LIN break detect interrupt flag
//6:RXEDGIF=RxD pin active edge interrupt flag
//5:(reserved)//read-only// always 0
//4:RXINV=receive data inversion
//3:RWUID=receive wake-up idle detect
//2:BRK13=break character generation length
//1:LBKDE=LIN break detect enable
//0:RAF=receiver active flag
#define UART_S2_LBKDIF_MASK 0x80
#define UART_S2_LBKDIF_SHIFT 7
#define UART_S2_RXEDGIF_MASK 0x40
#define UART_S2_RXEDGIF_SHIFT 6
#define UART_S2_RXINV_MASK 0x10
#define UART_S2_RXINV_SHIFT 4
#define UART_S2_RWUID_MASK 0x08
#define UART_S2_RWUID_SHIFT 3
#define UART_S2_BRK13_MASK 0x04
#define UART_S2_BRK13_SHIFT 2
#define UART_S2_LBKDE_MASK 0x02
#define UART_S2_LBKDE_SHIFT 1
#define UART_S2_RAF_MASK 0x01
#define UART_S2_RAF_SHIFT 0
//public int getRed()           {return red//}
#endif
